
binaries/O0/binaries_debug/dev-util/amtterm-1.6-r1/amtterm:     file format elf64-x86-64

Contents of the .eh_frame section:


00000000 0000000000000014 00000000 CIE
  Version:               1
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -8
  Return address column: 16
  Augmentation data:     1b
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_offset: r16 (rip) at cfa-8
  DW_CFA_undefined: r16 (rip)

00000018 0000000000000014 0000001c FDE cie=00000000 pc=0000000000002270..0000000000002292
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000030 0000000000000014 00000000 CIE
  Version:               1
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -8
  Return address column: 16
  Augmentation data:     1b
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_offset: r16 (rip) at cfa-8
  DW_CFA_nop
  DW_CFA_nop

00000048 0000000000000024 0000001c FDE cie=00000030 pc=0000000000002020..0000000000002260
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 6 to 0000000000002026
  DW_CFA_def_cfa_offset: 24
  DW_CFA_advance_loc: 10 to 0000000000002030
  DW_CFA_def_cfa_expression (DW_OP_breg7 (rsp): 8; DW_OP_breg16 (rip): 0; DW_OP_lit15; DW_OP_and; DW_OP_lit11; DW_OP_ge; DW_OP_lit3; DW_OP_shl; DW_OP_plus)
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000070 0000000000000014 00000044 FDE cie=00000030 pc=0000000000002260..0000000000002268
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

  DW_CFA_advance_loc: 1 to 00000000000035f6
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 00000000000035f9
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc1: 93 to 0000000000003656
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop

00000308 000000000000001c 000002dc FDE cie=00000030 pc=0000000000003657..000000000000370b
  DW_CFA_advance_loc: 1 to 0000000000003658
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 000000000000365b
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc1: 175 to 000000000000370a
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop

00000328 000000000000001c 000002fc FDE cie=00000030 pc=000000000000370b..0000000000003978
  DW_CFA_advance_loc: 1 to 000000000000370c
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 000000000000370f
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc2: 616 to 0000000000003977
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop

00000348 000000000000001c 0000031c FDE cie=00000030 pc=0000000000003978..0000000000004116
  DW_CFA_advance_loc: 1 to 0000000000003979
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 000000000000397c
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc2: 1945 to 0000000000004115
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop

00000368 000000000000001c 0000033c FDE cie=00000030 pc=0000000000004116..000000000000415b
  DW_CFA_advance_loc: 1 to 0000000000004117
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 000000000000411a
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc1: 64 to 000000000000415a
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop

00000388 0000000000000020 0000035c FDE cie=00000030 pc=000000000000415b..00000000000046b6
  DW_CFA_advance_loc: 1 to 000000000000415c
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 000000000000415f
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 10 to 0000000000004169
  DW_CFA_offset: r12 (r12) at cfa-24
  DW_CFA_offset: r3 (rbx) at cfa-32
  DW_CFA_advance_loc2: 1356 to 00000000000046b5
  DW_CFA_def_cfa: r7 (rsp) ofs 8

000003ac 0000000000000020 00000380 FDE cie=00000030 pc=00000000000046b6..00000000000049d5
  DW_CFA_advance_loc: 1 to 00000000000046b7
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 00000000000046ba
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 8 to 00000000000046c2
  DW_CFA_offset: r3 (rbx) at cfa-24
  DW_CFA_advance_loc2: 786 to 00000000000049d4
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop

000003d0 ZERO terminator


Contents of the .debug_aranges section:

  Length:                   44
  Version:                  2
  Offset into .debug_info:  0
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000002355 0000000000000abf
    0000000000000000 0000000000000000
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x2f79
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000002e14 0000000000001302
    0000000000000000 0000000000000000
  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x6027
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000004116 00000000000008bf
    0000000000000000 0000000000000000

Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x2f75 (32-bit)
   Version:       4
   Abbrev Offset: 0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x2ad8): GNU C17 10.3.0 -mtune=generic -march=x86-64 -g -O0 -fcf-protection=none -fno-eliminate-unused-debug-types -frecord-gcc-switches -fno-lto
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xb14): amtterm.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xc09): /var/tmp/portage/dev-util/amtterm-1.6-r1/work/amtterm-1.6
    <19>   DW_AT_low_pc      : 0x2355
    <21>   DW_AT_high_pc     : 0xabf
    <29>   DW_AT_stmt_list   : 0
 <1><2d>: Abbrev Number: 2 (DW_TAG_typedef)
    <2e>   DW_AT_name        : (indirect string, offset: 0x3378): size_t
    <32>   DW_AT_decl_file   : 2
    <33>   DW_AT_decl_line   : 209
    <34>   DW_AT_decl_column : 23
    <35>   DW_AT_type        : <0x39>
 <1><39>: Abbrev Number: 3 (DW_TAG_base_type)
    <3a>   DW_AT_byte_size   : 8
    <3b>   DW_AT_encoding    : 7	(unsigned)
    <3c>   DW_AT_name        : (indirect string, offset: 0x1e01): long unsigned int
 <1><40>: Abbrev Number: 2 (DW_TAG_typedef)
    <41>   DW_AT_name        : (indirect string, offset: 0xaa0): __gnuc_va_list
    <45>   DW_AT_decl_file   : 3
    <46>   DW_AT_decl_line   : 40
    <47>   DW_AT_decl_column : 27
    <48>   DW_AT_type        : <0x4c>
 <1><4c>: Abbrev Number: 4 (DW_TAG_typedef)
    <4d>   DW_AT_name        : (indirect string, offset: 0x16e9): __builtin_va_list
    <51>   DW_AT_type        : <0x55>
 <1><55>: Abbrev Number: 5 (DW_TAG_array_type)
    <56>   DW_AT_type        : <0x65>
    <5a>   DW_AT_sibling     : <0x65>
 <2><5e>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <5f>   DW_AT_type        : <0x39>
    <63>   DW_AT_upper_bound : 0
 <2><64>: Abbrev Number: 0
 <1><65>: Abbrev Number: 7 (DW_TAG_structure_type)
    <66>   DW_AT_name        : (indirect string, offset: 0xebe): __va_list_tag
    <6a>   DW_AT_byte_size   : 24
    <6b>   DW_AT_decl_file   : 4
    <6c>   DW_AT_decl_line   : 0
    <6d>   DW_AT_sibling     : <0xa2>
 <2><71>: Abbrev Number: 8 (DW_TAG_member)
    <72>   DW_AT_name        : (indirect string, offset: 0x1738): gp_offset
    <76>   DW_AT_decl_file   : 4
    <77>   DW_AT_decl_line   : 0
    <78>   DW_AT_type        : <0xa2>
    <7c>   DW_AT_data_member_location: 0
 <2><7d>: Abbrev Number: 8 (DW_TAG_member)
    <7e>   DW_AT_name        : (indirect string, offset: 0xd0b): fp_offset
    <82>   DW_AT_decl_file   : 4
    <83>   DW_AT_decl_line   : 0
    <84>   DW_AT_type        : <0xa2>
    <88>   DW_AT_data_member_location: 4
 <2><89>: Abbrev Number: 8 (DW_TAG_member)
    <8a>   DW_AT_name        : (indirect string, offset: 0x19de): overflow_arg_area
    <8e>   DW_AT_decl_file   : 4
    <8f>   DW_AT_decl_line   : 0
    <90>   DW_AT_type        : <0xae>
    <94>   DW_AT_data_member_location: 8
 <2><95>: Abbrev Number: 8 (DW_TAG_member)
    <96>   DW_AT_name        : (indirect string, offset: 0x12f7): reg_save_area
    <9a>   DW_AT_decl_file   : 4
    <9b>   DW_AT_decl_line   : 0
    <9c>   DW_AT_type        : <0xae>
    <a0>   DW_AT_data_member_location: 16
 <2><a1>: Abbrev Number: 0
 <1><a2>: Abbrev Number: 3 (DW_TAG_base_type)
    <a3>   DW_AT_byte_size   : 4
    <a4>   DW_AT_encoding    : 7	(unsigned)
    <a5>   DW_AT_name        : (indirect string, offset: 0x1e06): unsigned int
 <1><a9>: Abbrev Number: 9 (DW_TAG_const_type)
    <aa>   DW_AT_type        : <0xa2>
 <1><ae>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <af>   DW_AT_byte_size   : 8
 <1><b0>: Abbrev Number: 2 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0x2565): __u_char
    <b5>   DW_AT_decl_file   : 5
    <b6>   DW_AT_decl_line   : 31
    <b7>   DW_AT_decl_column : 23
    <b8>   DW_AT_type        : <0xbc>
 <1><bc>: Abbrev Number: 3 (DW_TAG_base_type)
    <bd>   DW_AT_byte_size   : 1
    <be>   DW_AT_encoding    : 8	(unsigned char)
    <bf>   DW_AT_name        : (indirect string, offset: 0x962): unsigned char
 <1><c3>: Abbrev Number: 2 (DW_TAG_typedef)
    <c4>   DW_AT_name        : (indirect string, offset: 0x269e): __u_short
    <c8>   DW_AT_decl_file   : 5
    <c9>   DW_AT_decl_line   : 32
    <ca>   DW_AT_decl_column : 28
    <cb>   DW_AT_type        : <0xcf>
 <1><cf>: Abbrev Number: 3 (DW_TAG_base_type)
    <d0>   DW_AT_byte_size   : 2
    <d1>   DW_AT_encoding    : 7	(unsigned)
    <d2>   DW_AT_name        : (indirect string, offset: 0x28f3): short unsigned int
 <1><d6>: Abbrev Number: 9 (DW_TAG_const_type)
    <d7>   DW_AT_type        : <0xcf>
 <1><db>: Abbrev Number: 2 (DW_TAG_typedef)
    <dc>   DW_AT_name        : (indirect string, offset: 0xe0f): __u_int
    <e0>   DW_AT_decl_file   : 5
    <e1>   DW_AT_decl_line   : 33
    <e2>   DW_AT_decl_column : 22
    <e3>   DW_AT_type        : <0xa2>
 <1><e7>: Abbrev Number: 2 (DW_TAG_typedef)
    <e8>   DW_AT_name        : (indirect string, offset: 0x27bf): __u_long
    <ec>   DW_AT_decl_file   : 5
    <ed>   DW_AT_decl_line   : 34
    <ee>   DW_AT_decl_column : 27
    <ef>   DW_AT_type        : <0x39>
 <1><f3>: Abbrev Number: 2 (DW_TAG_typedef)
    <f4>   DW_AT_name        : (indirect string, offset: 0x1d74): __int8_t
    <f8>   DW_AT_decl_file   : 5
    <f9>   DW_AT_decl_line   : 37
    <fa>   DW_AT_decl_column : 21
    <fb>   DW_AT_type        : <0xff>
 <1><ff>: Abbrev Number: 3 (DW_TAG_base_type)
    <100>   DW_AT_byte_size   : 1
    <101>   DW_AT_encoding    : 6	(signed char)
    <102>   DW_AT_name        : (indirect string, offset: 0x964): signed char
 <1><106>: Abbrev Number: 2 (DW_TAG_typedef)
    <107>   DW_AT_name        : (indirect string, offset: 0x204d): __uint8_t
    <10b>   DW_AT_decl_file   : 5
    <10c>   DW_AT_decl_line   : 38
    <10d>   DW_AT_decl_column : 23
    <10e>   DW_AT_type        : <0xbc>
 <1><112>: Abbrev Number: 2 (DW_TAG_typedef)
    <113>   DW_AT_name        : (indirect string, offset: 0x20bb): __int16_t
    <117>   DW_AT_decl_file   : 5
    <118>   DW_AT_decl_line   : 39
    <119>   DW_AT_decl_column : 26
    <11a>   DW_AT_type        : <0x11e>
 <1><11e>: Abbrev Number: 3 (DW_TAG_base_type)
    <11f>   DW_AT_byte_size   : 2
    <120>   DW_AT_encoding    : 5	(signed)
    <121>   DW_AT_name        : (indirect string, offset: 0x23f4): short int
 <1><125>: Abbrev Number: 2 (DW_TAG_typedef)
    <126>   DW_AT_name        : (indirect string, offset: 0xbf0): __uint16_t
    <12a>   DW_AT_decl_file   : 5
    <12b>   DW_AT_decl_line   : 40
    <12c>   DW_AT_decl_column : 28
    <12d>   DW_AT_type        : <0xcf>
 <1><131>: Abbrev Number: 2 (DW_TAG_typedef)
    <132>   DW_AT_name        : (indirect string, offset: 0x29e9): __int32_t
    <136>   DW_AT_decl_file   : 5
    <137>   DW_AT_decl_line   : 41
    <138>   DW_AT_decl_column : 20
    <139>   DW_AT_type        : <0x13d>
 <1><13d>: Abbrev Number: 11 (DW_TAG_base_type)
    <13e>   DW_AT_byte_size   : 4
    <13f>   DW_AT_encoding    : 5	(signed)
    <140>   DW_AT_name        : int
 <1><144>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <145>   DW_AT_type        : <0x13d>
 <1><149>: Abbrev Number: 9 (DW_TAG_const_type)
    <14a>   DW_AT_type        : <0x13d>
 <1><14e>: Abbrev Number: 2 (DW_TAG_typedef)
    <14f>   DW_AT_name        : (indirect string, offset: 0x1527): __uint32_t
    <153>   DW_AT_decl_file   : 5
    <154>   DW_AT_decl_line   : 42
    <155>   DW_AT_decl_column : 22
    <156>   DW_AT_type        : <0xa2>
 <1><15a>: Abbrev Number: 2 (DW_TAG_typedef)
    <15b>   DW_AT_name        : (indirect string, offset: 0x26b5): __int64_t
    <15f>   DW_AT_decl_file   : 5
    <160>   DW_AT_decl_line   : 44
    <161>   DW_AT_decl_column : 25
    <162>   DW_AT_type        : <0x166>
 <1><166>: Abbrev Number: 3 (DW_TAG_base_type)
    <167>   DW_AT_byte_size   : 8
    <168>   DW_AT_encoding    : 5	(signed)
    <169>   DW_AT_name        : (indirect string, offset: 0x1585): long int
 <1><16d>: Abbrev Number: 2 (DW_TAG_typedef)
    <16e>   DW_AT_name        : (indirect string, offset: 0x11af): __uint64_t
    <172>   DW_AT_decl_file   : 5
    <173>   DW_AT_decl_line   : 45
    <174>   DW_AT_decl_column : 27
    <175>   DW_AT_type        : <0x39>
 <1><179>: Abbrev Number: 2 (DW_TAG_typedef)
    <17a>   DW_AT_name        : (indirect string, offset: 0x2936): __int_least8_t
    <17e>   DW_AT_decl_file   : 5
    <17f>   DW_AT_decl_line   : 52
    <180>   DW_AT_decl_column : 18
    <181>   DW_AT_type        : <0xf3>
 <1><185>: Abbrev Number: 2 (DW_TAG_typedef)
    <186>   DW_AT_name        : (indirect string, offset: 0x1ae): __uint_least8_t
    <18a>   DW_AT_decl_file   : 5
    <18b>   DW_AT_decl_line   : 53
    <18c>   DW_AT_decl_column : 19
    <18d>   DW_AT_type        : <0x106>
 <1><191>: Abbrev Number: 2 (DW_TAG_typedef)
    <192>   DW_AT_name        : (indirect string, offset: 0x1f53): __int_least16_t
    <196>   DW_AT_decl_file   : 5
    <197>   DW_AT_decl_line   : 54
    <198>   DW_AT_decl_column : 19
    <199>   DW_AT_type        : <0x112>
 <1><19d>: Abbrev Number: 2 (DW_TAG_typedef)
    <19e>   DW_AT_name        : (indirect string, offset: 0x970): __uint_least16_t
    <1a2>   DW_AT_decl_file   : 5
    <1a3>   DW_AT_decl_line   : 55
    <1a4>   DW_AT_decl_column : 20
    <1a5>   DW_AT_type        : <0x125>
 <1><1a9>: Abbrev Number: 2 (DW_TAG_typedef)
    <1aa>   DW_AT_name        : (indirect string, offset: 0x286a): __int_least32_t
    <1ae>   DW_AT_decl_file   : 5
    <1af>   DW_AT_decl_line   : 56
    <1b0>   DW_AT_decl_column : 19
    <1b1>   DW_AT_type        : <0x131>
 <1><1b5>: Abbrev Number: 2 (DW_TAG_typedef)
    <1b6>   DW_AT_name        : (indirect string, offset: 0x126a): __uint_least32_t
    <1ba>   DW_AT_decl_file   : 5
    <1bb>   DW_AT_decl_line   : 57
    <1bc>   DW_AT_decl_column : 20
    <1bd>   DW_AT_type        : <0x14e>
 <1><1c1>: Abbrev Number: 2 (DW_TAG_typedef)
    <1c2>   DW_AT_name        : (indirect string, offset: 0x251d): __int_least64_t
    <1c6>   DW_AT_decl_file   : 5
    <1c7>   DW_AT_decl_line   : 58
    <1c8>   DW_AT_decl_column : 19
    <1c9>   DW_AT_type        : <0x15a>
 <1><1cd>: Abbrev Number: 2 (DW_TAG_typedef)
    <1ce>   DW_AT_name        : (indirect string, offset: 0xecc): __uint_least64_t
    <1d2>   DW_AT_decl_file   : 5
    <1d3>   DW_AT_decl_line   : 59
    <1d4>   DW_AT_decl_column : 20
    <1d5>   DW_AT_type        : <0x16d>
 <1><1d9>: Abbrev Number: 2 (DW_TAG_typedef)
    <1da>   DW_AT_name        : (indirect string, offset: 0x1344): __quad_t
    <1de>   DW_AT_decl_file   : 5
    <1df>   DW_AT_decl_line   : 63
    <1e0>   DW_AT_decl_column : 18
    <1e1>   DW_AT_type        : <0x166>
 <1><1e5>: Abbrev Number: 2 (DW_TAG_typedef)
    <1e6>   DW_AT_name        : (indirect string, offset: 0): __u_quad_t
    <1ea>   DW_AT_decl_file   : 5
    <1eb>   DW_AT_decl_line   : 64
    <1ec>   DW_AT_decl_column : 27
    <1ed>   DW_AT_type        : <0x39>
 <1><1f1>: Abbrev Number: 2 (DW_TAG_typedef)
    <1f2>   DW_AT_name        : (indirect string, offset: 0x2a3c): __intmax_t
    <1f6>   DW_AT_decl_file   : 5
    <1f7>   DW_AT_decl_line   : 72
    <1f8>   DW_AT_decl_column : 18
    <1f9>   DW_AT_type        : <0x166>
 <1><1fd>: Abbrev Number: 2 (DW_TAG_typedef)
    <1fe>   DW_AT_name        : (indirect string, offset: 0x25b5): __uintmax_t
    <202>   DW_AT_decl_file   : 5
    <203>   DW_AT_decl_line   : 73
    <204>   DW_AT_decl_column : 27
    <205>   DW_AT_type        : <0x39>
 <1><209>: Abbrev Number: 2 (DW_TAG_typedef)
    <20a>   DW_AT_name        : (indirect string, offset: 0x568): __dev_t
    <20e>   DW_AT_decl_file   : 5
    <20f>   DW_AT_decl_line   : 145
    <210>   DW_AT_decl_column : 25
    <211>   DW_AT_type        : <0x39>
 <1><215>: Abbrev Number: 2 (DW_TAG_typedef)
    <216>   DW_AT_name        : (indirect string, offset: 0x26e4): __uid_t
    <21a>   DW_AT_decl_file   : 5
    <21b>   DW_AT_decl_line   : 146
    <21c>   DW_AT_decl_column : 25
    <21d>   DW_AT_type        : <0xa2>
 <1><221>: Abbrev Number: 2 (DW_TAG_typedef)
    <222>   DW_AT_name        : (indirect string, offset: 0x26b): __gid_t
    <226>   DW_AT_decl_file   : 5
    <227>   DW_AT_decl_line   : 147
    <228>   DW_AT_decl_column : 25
    <229>   DW_AT_type        : <0xa2>
 <1><22d>: Abbrev Number: 2 (DW_TAG_typedef)
    <22e>   DW_AT_name        : (indirect string, offset: 0x14d9): __ino_t
    <232>   DW_AT_decl_file   : 5
    <233>   DW_AT_decl_line   : 148
    <234>   DW_AT_decl_column : 25
    <235>   DW_AT_type        : <0x39>
 <1><239>: Abbrev Number: 2 (DW_TAG_typedef)
    <23a>   DW_AT_name        : (indirect string, offset: 0x1be4): __ino64_t
    <23e>   DW_AT_decl_file   : 5
    <23f>   DW_AT_decl_line   : 149
    <240>   DW_AT_decl_column : 27
    <241>   DW_AT_type        : <0x39>
 <1><245>: Abbrev Number: 2 (DW_TAG_typedef)
    <246>   DW_AT_name        : (indirect string, offset: 0xcac): __mode_t
    <24a>   DW_AT_decl_file   : 5
    <24b>   DW_AT_decl_line   : 150
    <24c>   DW_AT_decl_column : 26
    <24d>   DW_AT_type        : <0xa2>
 <1><251>: Abbrev Number: 2 (DW_TAG_typedef)
    <252>   DW_AT_name        : (indirect string, offset: 0x2a6a): __nlink_t
    <256>   DW_AT_decl_file   : 5
    <257>   DW_AT_decl_line   : 151
    <258>   DW_AT_decl_column : 27
    <259>   DW_AT_type        : <0x39>
 <1><25d>: Abbrev Number: 2 (DW_TAG_typedef)
    <25e>   DW_AT_name        : (indirect string, offset: 0x1eb1): __off_t
    <262>   DW_AT_decl_file   : 5
    <263>   DW_AT_decl_line   : 152
    <264>   DW_AT_decl_column : 25
    <265>   DW_AT_type        : <0x166>
 <1><269>: Abbrev Number: 2 (DW_TAG_typedef)
    <26a>   DW_AT_name        : (indirect string, offset: 0x217a): __off64_t
    <26e>   DW_AT_decl_file   : 5
    <26f>   DW_AT_decl_line   : 153
    <270>   DW_AT_decl_column : 27
    <271>   DW_AT_type        : <0x166>
 <1><275>: Abbrev Number: 2 (DW_TAG_typedef)
    <276>   DW_AT_name        : (indirect string, offset: 0x1cbe): __pid_t
    <27a>   DW_AT_decl_file   : 5
    <27b>   DW_AT_decl_line   : 154
    <27c>   DW_AT_decl_column : 25
    <27d>   DW_AT_type        : <0x13d>
 <1><281>: Abbrev Number: 13 (DW_TAG_structure_type)
    <282>   DW_AT_byte_size   : 8
    <283>   DW_AT_decl_file   : 5
    <284>   DW_AT_decl_line   : 155
    <285>   DW_AT_decl_column : 12
    <286>   DW_AT_sibling     : <0x298>
 <2><28a>: Abbrev Number: 14 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0x25fd): __val
    <28f>   DW_AT_decl_file   : 5
    <290>   DW_AT_decl_line   : 155
    <291>   DW_AT_decl_column : 12
    <292>   DW_AT_type        : <0x298>
    <296>   DW_AT_data_member_location: 0
 <2><297>: Abbrev Number: 0
 <1><298>: Abbrev Number: 5 (DW_TAG_array_type)
    <299>   DW_AT_type        : <0x13d>
    <29d>   DW_AT_sibling     : <0x2a8>
 <2><2a1>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <2a2>   DW_AT_type        : <0x39>
    <2a6>   DW_AT_upper_bound : 1
 <2><2a7>: Abbrev Number: 0
 <1><2a8>: Abbrev Number: 2 (DW_TAG_typedef)
    <2a9>   DW_AT_name        : (indirect string, offset: 0x238): __fsid_t
    <2ad>   DW_AT_decl_file   : 5
    <2ae>   DW_AT_decl_line   : 155
    <2af>   DW_AT_decl_column : 26
    <2b0>   DW_AT_type        : <0x281>
 <1><2b4>: Abbrev Number: 2 (DW_TAG_typedef)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x1a49): __clock_t
    <2b9>   DW_AT_decl_file   : 5
    <2ba>   DW_AT_decl_line   : 156
    <2bb>   DW_AT_decl_column : 27
    <2bc>   DW_AT_type        : <0x166>
 <1><2c0>: Abbrev Number: 2 (DW_TAG_typedef)
    <2c1>   DW_AT_name        : (indirect string, offset: 0x1b3b): __rlim_t
    <2c5>   DW_AT_decl_file   : 5
    <2c6>   DW_AT_decl_line   : 157
    <2c7>   DW_AT_decl_column : 26
    <2c8>   DW_AT_type        : <0x39>
 <1><2cc>: Abbrev Number: 2 (DW_TAG_typedef)
    <2cd>   DW_AT_name        : (indirect string, offset: 0x79): __rlim64_t
    <2d1>   DW_AT_decl_file   : 5
    <2d2>   DW_AT_decl_line   : 158
    <2d3>   DW_AT_decl_column : 28
    <2d4>   DW_AT_type        : <0x39>
 <1><2d8>: Abbrev Number: 2 (DW_TAG_typedef)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x1652): __id_t
    <2dd>   DW_AT_decl_file   : 5
    <2de>   DW_AT_decl_line   : 159
    <2df>   DW_AT_decl_column : 24
    <2e0>   DW_AT_type        : <0xa2>
 <1><2e4>: Abbrev Number: 2 (DW_TAG_typedef)
    <2e5>   DW_AT_name        : (indirect string, offset: 0x2012): __time_t
    <2e9>   DW_AT_decl_file   : 5
    <2ea>   DW_AT_decl_line   : 160
    <2eb>   DW_AT_decl_column : 26
    <2ec>   DW_AT_type        : <0x166>
 <1><2f0>: Abbrev Number: 2 (DW_TAG_typedef)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x1667): __useconds_t
    <2f5>   DW_AT_decl_file   : 5
    <2f6>   DW_AT_decl_line   : 161
    <2f7>   DW_AT_decl_column : 30
    <2f8>   DW_AT_type        : <0xa2>
 <1><2fc>: Abbrev Number: 2 (DW_TAG_typedef)
    <2fd>   DW_AT_name        : (indirect string, offset: 0x1659): __suseconds_t
    <301>   DW_AT_decl_file   : 5
    <302>   DW_AT_decl_line   : 162
    <303>   DW_AT_decl_column : 31
    <304>   DW_AT_type        : <0x166>
 <1><308>: Abbrev Number: 2 (DW_TAG_typedef)
    <309>   DW_AT_name        : (indirect string, offset: 0x19ce): __suseconds64_t
    <30d>   DW_AT_decl_file   : 5
    <30e>   DW_AT_decl_line   : 163
    <30f>   DW_AT_decl_column : 33
    <310>   DW_AT_type        : <0x166>
 <1><314>: Abbrev Number: 2 (DW_TAG_typedef)
    <315>   DW_AT_name        : (indirect string, offset: 0x14f3): __daddr_t
    <319>   DW_AT_decl_file   : 5
    <31a>   DW_AT_decl_line   : 165
    <31b>   DW_AT_decl_column : 27
    <31c>   DW_AT_type        : <0x13d>
 <1><320>: Abbrev Number: 2 (DW_TAG_typedef)
    <321>   DW_AT_name        : (indirect string, offset: 0x1bdc): __key_t
    <325>   DW_AT_decl_file   : 5
    <326>   DW_AT_decl_line   : 166
    <327>   DW_AT_decl_column : 25
    <328>   DW_AT_type        : <0x13d>
 <1><32c>: Abbrev Number: 2 (DW_TAG_typedef)
    <32d>   DW_AT_name        : (indirect string, offset: 0x273): __clockid_t
    <331>   DW_AT_decl_file   : 5
    <332>   DW_AT_decl_line   : 169
    <333>   DW_AT_decl_column : 29
    <334>   DW_AT_type        : <0x13d>
 <1><338>: Abbrev Number: 2 (DW_TAG_typedef)
    <339>   DW_AT_name        : (indirect string, offset: 0xb4b): __timer_t
    <33d>   DW_AT_decl_file   : 5
    <33e>   DW_AT_decl_line   : 172
    <33f>   DW_AT_decl_column : 27
    <340>   DW_AT_type        : <0xae>
 <1><344>: Abbrev Number: 2 (DW_TAG_typedef)
    <345>   DW_AT_name        : (indirect string, offset: 0x82d): __blksize_t
    <349>   DW_AT_decl_file   : 5
    <34a>   DW_AT_decl_line   : 175
    <34b>   DW_AT_decl_column : 29
    <34c>   DW_AT_type        : <0x166>
 <1><350>: Abbrev Number: 2 (DW_TAG_typedef)
    <351>   DW_AT_name        : (indirect string, offset: 0x1469): __blkcnt_t
    <355>   DW_AT_decl_file   : 5
    <356>   DW_AT_decl_line   : 180
    <357>   DW_AT_decl_column : 28
    <358>   DW_AT_type        : <0x166>
 <1><35c>: Abbrev Number: 2 (DW_TAG_typedef)
    <35d>   DW_AT_name        : (indirect string, offset: 0xfdc): __blkcnt64_t
    <361>   DW_AT_decl_file   : 5
    <362>   DW_AT_decl_line   : 181
    <363>   DW_AT_decl_column : 30
    <364>   DW_AT_type        : <0x166>
 <1><368>: Abbrev Number: 2 (DW_TAG_typedef)
    <369>   DW_AT_name        : (indirect string, offset: 0xac2): __fsblkcnt_t
    <36d>   DW_AT_decl_file   : 5
    <36e>   DW_AT_decl_line   : 184
    <36f>   DW_AT_decl_column : 30
    <370>   DW_AT_type        : <0x39>
 <1><374>: Abbrev Number: 2 (DW_TAG_typedef)
    <375>   DW_AT_name        : (indirect string, offset: 0x920): __fsblkcnt64_t
    <379>   DW_AT_decl_file   : 5
    <37a>   DW_AT_decl_line   : 185
    <37b>   DW_AT_decl_column : 32
    <37c>   DW_AT_type        : <0x39>
 <1><380>: Abbrev Number: 2 (DW_TAG_typedef)
    <381>   DW_AT_name        : (indirect string, offset: 0x195c): __fsfilcnt_t
    <385>   DW_AT_decl_file   : 5
    <386>   DW_AT_decl_line   : 188
    <387>   DW_AT_decl_column : 30
    <388>   DW_AT_type        : <0x39>
 <1><38c>: Abbrev Number: 2 (DW_TAG_typedef)
    <38d>   DW_AT_name        : (indirect string, offset: 0x145a): __fsfilcnt64_t
    <391>   DW_AT_decl_file   : 5
    <392>   DW_AT_decl_line   : 189
    <393>   DW_AT_decl_column : 32
    <394>   DW_AT_type        : <0x39>
 <1><398>: Abbrev Number: 2 (DW_TAG_typedef)
    <399>   DW_AT_name        : (indirect string, offset: 0xd00): __fsword_t
    <39d>   DW_AT_decl_file   : 5
    <39e>   DW_AT_decl_line   : 192
    <39f>   DW_AT_decl_column : 28
    <3a0>   DW_AT_type        : <0x166>
 <1><3a4>: Abbrev Number: 2 (DW_TAG_typedef)
    <3a5>   DW_AT_name        : (indirect string, offset: 0x141): __ssize_t
    <3a9>   DW_AT_decl_file   : 5
    <3aa>   DW_AT_decl_line   : 194
    <3ab>   DW_AT_decl_column : 27
    <3ac>   DW_AT_type        : <0x166>
 <1><3b0>: Abbrev Number: 2 (DW_TAG_typedef)
    <3b1>   DW_AT_name        : (indirect string, offset: 0x1dd6): __syscall_slong_t
    <3b5>   DW_AT_decl_file   : 5
    <3b6>   DW_AT_decl_line   : 197
    <3b7>   DW_AT_decl_column : 33
    <3b8>   DW_AT_type        : <0x166>
 <1><3bc>: Abbrev Number: 2 (DW_TAG_typedef)
    <3bd>   DW_AT_name        : (indirect string, offset: 0xf4d): __syscall_ulong_t
    <3c1>   DW_AT_decl_file   : 5
    <3c2>   DW_AT_decl_line   : 199
    <3c3>   DW_AT_decl_column : 33
    <3c4>   DW_AT_type        : <0x39>
 <1><3c8>: Abbrev Number: 2 (DW_TAG_typedef)
    <3c9>   DW_AT_name        : (indirect string, offset: 0x27a2): __loff_t
    <3cd>   DW_AT_decl_file   : 5
    <3ce>   DW_AT_decl_line   : 203
    <3cf>   DW_AT_decl_column : 19
    <3d0>   DW_AT_type        : <0x269>
 <1><3d4>: Abbrev Number: 2 (DW_TAG_typedef)
    <3d5>   DW_AT_name        : (indirect string, offset: 0x6b3): __caddr_t
    <3d9>   DW_AT_decl_file   : 5
    <3da>   DW_AT_decl_line   : 204
    <3db>   DW_AT_decl_column : 15
    <3dc>   DW_AT_type        : <0x3e0>
 <1><3e0>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <3e1>   DW_AT_byte_size   : 8
    <3e2>   DW_AT_type        : <0x3e6>
 <1><3e6>: Abbrev Number: 3 (DW_TAG_base_type)
    <3e7>   DW_AT_byte_size   : 1
    <3e8>   DW_AT_encoding    : 6	(signed char)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x96b): char
 <1><3ed>: Abbrev Number: 9 (DW_TAG_const_type)
    <3ee>   DW_AT_type        : <0x3e6>
 <1><3f2>: Abbrev Number: 2 (DW_TAG_typedef)
    <3f3>   DW_AT_name        : (indirect string, offset: 0x148e): __intptr_t
    <3f7>   DW_AT_decl_file   : 5
    <3f8>   DW_AT_decl_line   : 207
    <3f9>   DW_AT_decl_column : 25
    <3fa>   DW_AT_type        : <0x166>
 <1><3fe>: Abbrev Number: 2 (DW_TAG_typedef)
    <3ff>   DW_AT_name        : (indirect string, offset: 0xd59): __socklen_t
    <403>   DW_AT_decl_file   : 5
    <404>   DW_AT_decl_line   : 210
    <405>   DW_AT_decl_column : 23
    <406>   DW_AT_type        : <0xa2>
 <1><40a>: Abbrev Number: 2 (DW_TAG_typedef)
    <40b>   DW_AT_name        : (indirect string, offset: 0x20ac): __sig_atomic_t
    <40f>   DW_AT_decl_file   : 5
    <410>   DW_AT_decl_line   : 215
    <411>   DW_AT_decl_column : 13
    <412>   DW_AT_type        : <0x13d>
 <1><416>: Abbrev Number: 16 (DW_TAG_union_type)
    <417>   DW_AT_byte_size   : 4
    <418>   DW_AT_decl_file   : 6
    <419>   DW_AT_decl_line   : 16
    <41a>   DW_AT_decl_column : 3
    <41b>   DW_AT_sibling     : <0x438>
 <2><41f>: Abbrev Number: 17 (DW_TAG_member)
    <420>   DW_AT_name        : (indirect string, offset: 0x5a4): __wch
    <424>   DW_AT_decl_file   : 6
    <425>   DW_AT_decl_line   : 18
    <426>   DW_AT_decl_column : 19
    <427>   DW_AT_type        : <0xa2>
 <2><42b>: Abbrev Number: 17 (DW_TAG_member)
    <42c>   DW_AT_name        : (indirect string, offset: 0x1d44): __wchb
    <430>   DW_AT_decl_file   : 6
    <431>   DW_AT_decl_line   : 19
    <432>   DW_AT_decl_column : 10
    <433>   DW_AT_type        : <0x438>
 <2><437>: Abbrev Number: 0
 <1><438>: Abbrev Number: 5 (DW_TAG_array_type)
    <439>   DW_AT_type        : <0x3e6>
    <43d>   DW_AT_sibling     : <0x448>
 <2><441>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <442>   DW_AT_type        : <0x39>
    <446>   DW_AT_upper_bound : 3
 <2><447>: Abbrev Number: 0
 <1><448>: Abbrev Number: 13 (DW_TAG_structure_type)
    <449>   DW_AT_byte_size   : 8
    <44a>   DW_AT_decl_file   : 6
    <44b>   DW_AT_decl_line   : 13
    <44c>   DW_AT_decl_column : 9
    <44d>   DW_AT_sibling     : <0x46c>
 <2><451>: Abbrev Number: 14 (DW_TAG_member)
    <452>   DW_AT_name        : (indirect string, offset: 0x1afd): __count
    <456>   DW_AT_decl_file   : 6
    <457>   DW_AT_decl_line   : 15
    <458>   DW_AT_decl_column : 7
    <459>   DW_AT_type        : <0x13d>
    <45d>   DW_AT_data_member_location: 0
 <2><45e>: Abbrev Number: 14 (DW_TAG_member)
    <45f>   DW_AT_name        : (indirect string, offset: 0x898): __value
    <463>   DW_AT_decl_file   : 6
    <464>   DW_AT_decl_line   : 20
    <465>   DW_AT_decl_column : 5
    <466>   DW_AT_type        : <0x416>
    <46a>   DW_AT_data_member_location: 4
 <2><46b>: Abbrev Number: 0
 <1><46c>: Abbrev Number: 2 (DW_TAG_typedef)
    <46d>   DW_AT_name        : (indirect string, offset: 0x1596): __mbstate_t
    <471>   DW_AT_decl_file   : 6
    <472>   DW_AT_decl_line   : 21
    <473>   DW_AT_decl_column : 3
    <474>   DW_AT_type        : <0x448>
 <1><478>: Abbrev Number: 18 (DW_TAG_structure_type)
    <479>   DW_AT_name        : (indirect string, offset: 0x92f): _G_fpos_t
    <47d>   DW_AT_byte_size   : 16
    <47e>   DW_AT_decl_file   : 7
    <47f>   DW_AT_decl_line   : 10
    <480>   DW_AT_decl_column : 16
    <481>   DW_AT_sibling     : <0x4a0>
 <2><485>: Abbrev Number: 14 (DW_TAG_member)
    <486>   DW_AT_name        : (indirect string, offset: 0x4ad): __pos
    <48a>   DW_AT_decl_file   : 7
    <48b>   DW_AT_decl_line   : 12
    <48c>   DW_AT_decl_column : 11
    <48d>   DW_AT_type        : <0x25d>
    <491>   DW_AT_data_member_location: 0
 <2><492>: Abbrev Number: 14 (DW_TAG_member)
    <493>   DW_AT_name        : (indirect string, offset: 0x2482): __state
    <497>   DW_AT_decl_file   : 7
    <498>   DW_AT_decl_line   : 13
    <499>   DW_AT_decl_column : 15
    <49a>   DW_AT_type        : <0x46c>
    <49e>   DW_AT_data_member_location: 8
 <2><49f>: Abbrev Number: 0
 <1><4a0>: Abbrev Number: 2 (DW_TAG_typedef)
    <4a1>   DW_AT_name        : (indirect string, offset: 0x1852): __fpos_t
    <4a5>   DW_AT_decl_file   : 7
    <4a6>   DW_AT_decl_line   : 14
    <4a7>   DW_AT_decl_column : 3
    <4a8>   DW_AT_type        : <0x478>
 <1><4ac>: Abbrev Number: 18 (DW_TAG_structure_type)
    <4ad>   DW_AT_name        : (indirect string, offset: 0x1018): _G_fpos64_t
    <4b1>   DW_AT_byte_size   : 16
    <4b2>   DW_AT_decl_file   : 8
    <4b3>   DW_AT_decl_line   : 10
    <4b4>   DW_AT_decl_column : 16
    <4b5>   DW_AT_sibling     : <0x4d4>
 <2><4b9>: Abbrev Number: 14 (DW_TAG_member)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x4ad): __pos
    <4be>   DW_AT_decl_file   : 8
    <4bf>   DW_AT_decl_line   : 12
    <4c0>   DW_AT_decl_column : 13
    <4c1>   DW_AT_type        : <0x269>
    <4c5>   DW_AT_data_member_location: 0
 <2><4c6>: Abbrev Number: 14 (DW_TAG_member)
    <4c7>   DW_AT_name        : (indirect string, offset: 0x2482): __state
    <4cb>   DW_AT_decl_file   : 8
    <4cc>   DW_AT_decl_line   : 13
    <4cd>   DW_AT_decl_column : 15
    <4ce>   DW_AT_type        : <0x46c>
    <4d2>   DW_AT_data_member_location: 8
 <2><4d3>: Abbrev Number: 0
 <1><4d4>: Abbrev Number: 2 (DW_TAG_typedef)
    <4d5>   DW_AT_name        : (indirect string, offset: 0x1cf6): __fpos64_t
    <4d9>   DW_AT_decl_file   : 8
    <4da>   DW_AT_decl_line   : 14
    <4db>   DW_AT_decl_column : 3
    <4dc>   DW_AT_type        : <0x4ac>
 <1><4e0>: Abbrev Number: 2 (DW_TAG_typedef)
    <4e1>   DW_AT_name        : (indirect string, offset: 0x207c): __FILE
    <4e5>   DW_AT_decl_file   : 9
    <4e6>   DW_AT_decl_line   : 5
    <4e7>   DW_AT_decl_column : 25
    <4e8>   DW_AT_type        : <0x4ec>
 <1><4ec>: Abbrev Number: 18 (DW_TAG_structure_type)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x867): _IO_FILE
    <4f1>   DW_AT_byte_size   : 216
    <4f2>   DW_AT_decl_file   : 10
    <4f3>   DW_AT_decl_line   : 49
    <4f4>   DW_AT_decl_column : 8
    <4f5>   DW_AT_sibling     : <0x673>
 <2><4f9>: Abbrev Number: 14 (DW_TAG_member)
    <4fa>   DW_AT_name        : (indirect string, offset: 0x1011): _flags
    <4fe>   DW_AT_decl_file   : 10
    <4ff>   DW_AT_decl_line   : 51
    <500>   DW_AT_decl_column : 7
    <501>   DW_AT_type        : <0x13d>
    <505>   DW_AT_data_member_location: 0
 <2><506>: Abbrev Number: 14 (DW_TAG_member)
    <507>   DW_AT_name        : (indirect string, offset: 0xcec): _IO_read_ptr
    <50b>   DW_AT_decl_file   : 10
    <50c>   DW_AT_decl_line   : 54
    <50d>   DW_AT_decl_column : 9
    <50e>   DW_AT_type        : <0x3e0>
    <512>   DW_AT_data_member_location: 8
 <2><513>: Abbrev Number: 14 (DW_TAG_member)
    <514>   DW_AT_name        : (indirect string, offset: 0x272b): _IO_read_end
    <518>   DW_AT_decl_file   : 10
    <519>   DW_AT_decl_line   : 55
    <51a>   DW_AT_decl_column : 9
    <51b>   DW_AT_type        : <0x3e0>
    <51f>   DW_AT_data_member_location: 16
 <2><520>: Abbrev Number: 14 (DW_TAG_member)
    <521>   DW_AT_name        : (indirect string, offset: 0x1290): _IO_read_base
    <525>   DW_AT_decl_file   : 10
    <526>   DW_AT_decl_line   : 56
    <527>   DW_AT_decl_column : 9
    <528>   DW_AT_type        : <0x3e0>
    <52c>   DW_AT_data_member_location: 24
 <2><52d>: Abbrev Number: 14 (DW_TAG_member)
    <52e>   DW_AT_name        : (indirect string, offset: 0x2e8): _IO_write_base
    <532>   DW_AT_decl_file   : 10
    <533>   DW_AT_decl_line   : 57
    <534>   DW_AT_decl_column : 9
    <535>   DW_AT_type        : <0x3e0>
    <539>   DW_AT_data_member_location: 32
 <2><53a>: Abbrev Number: 14 (DW_TAG_member)
    <53b>   DW_AT_name        : (indirect string, offset: 0x298e): _IO_write_ptr
    <53f>   DW_AT_decl_file   : 10
    <540>   DW_AT_decl_line   : 58
    <541>   DW_AT_decl_column : 9
    <542>   DW_AT_type        : <0x3e0>
    <546>   DW_AT_data_member_location: 40
 <2><547>: Abbrev Number: 14 (DW_TAG_member)
    <548>   DW_AT_name        : (indirect string, offset: 0x168b): _IO_write_end
    <54c>   DW_AT_decl_file   : 10
    <54d>   DW_AT_decl_line   : 59
    <54e>   DW_AT_decl_column : 9
    <54f>   DW_AT_type        : <0x3e0>
    <553>   DW_AT_data_member_location: 48
 <2><554>: Abbrev Number: 14 (DW_TAG_member)
    <555>   DW_AT_name        : (indirect string, offset: 0x17da): _IO_buf_base
    <559>   DW_AT_decl_file   : 10
    <55a>   DW_AT_decl_line   : 60
    <55b>   DW_AT_decl_column : 9
    <55c>   DW_AT_type        : <0x3e0>
    <560>   DW_AT_data_member_location: 56
 <2><561>: Abbrev Number: 14 (DW_TAG_member)
    <562>   DW_AT_name        : (indirect string, offset: 0x22ad): _IO_buf_end
    <566>   DW_AT_decl_file   : 10
    <567>   DW_AT_decl_line   : 61
    <568>   DW_AT_decl_column : 9
    <569>   DW_AT_type        : <0x3e0>
    <56d>   DW_AT_data_member_location: 64
 <2><56e>: Abbrev Number: 14 (DW_TAG_member)
    <56f>   DW_AT_name        : (indirect string, offset: 0x411): _IO_save_base
    <573>   DW_AT_decl_file   : 10
    <574>   DW_AT_decl_line   : 64
    <575>   DW_AT_decl_column : 9
    <576>   DW_AT_type        : <0x3e0>
    <57a>   DW_AT_data_member_location: 72
 <2><57b>: Abbrev Number: 14 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0x20c5): _IO_backup_base
    <580>   DW_AT_decl_file   : 10
    <581>   DW_AT_decl_line   : 65
    <582>   DW_AT_decl_column : 9
    <583>   DW_AT_type        : <0x3e0>
    <587>   DW_AT_data_member_location: 80
 <2><588>: Abbrev Number: 14 (DW_TAG_member)
    <589>   DW_AT_name        : (indirect string, offset: 0x202): _IO_save_end
    <58d>   DW_AT_decl_file   : 10
    <58e>   DW_AT_decl_line   : 66
    <58f>   DW_AT_decl_column : 9
    <590>   DW_AT_type        : <0x3e0>
    <594>   DW_AT_data_member_location: 88
 <2><595>: Abbrev Number: 14 (DW_TAG_member)
    <596>   DW_AT_name        : (indirect string, offset: 0xe45): _markers
    <59a>   DW_AT_decl_file   : 10
    <59b>   DW_AT_decl_line   : 68
    <59c>   DW_AT_decl_column : 22
    <59d>   DW_AT_type        : <0x68c>
    <5a1>   DW_AT_data_member_location: 96
 <2><5a2>: Abbrev Number: 14 (DW_TAG_member)
    <5a3>   DW_AT_name        : (indirect string, offset: 0x4b3): _chain
    <5a7>   DW_AT_decl_file   : 10
    <5a8>   DW_AT_decl_line   : 70
    <5a9>   DW_AT_decl_column : 20
    <5aa>   DW_AT_type        : <0x692>
    <5ae>   DW_AT_data_member_location: 104
 <2><5af>: Abbrev Number: 14 (DW_TAG_member)
    <5b0>   DW_AT_name        : (indirect string, offset: 0x2811): _fileno
    <5b4>   DW_AT_decl_file   : 10
    <5b5>   DW_AT_decl_line   : 72
    <5b6>   DW_AT_decl_column : 7
    <5b7>   DW_AT_type        : <0x13d>
    <5bb>   DW_AT_data_member_location: 112
 <2><5bc>: Abbrev Number: 14 (DW_TAG_member)
    <5bd>   DW_AT_name        : (indirect string, offset: 0x1218): _flags2
    <5c1>   DW_AT_decl_file   : 10
    <5c2>   DW_AT_decl_line   : 73
    <5c3>   DW_AT_decl_column : 7
    <5c4>   DW_AT_type        : <0x13d>
    <5c8>   DW_AT_data_member_location: 116
 <2><5c9>: Abbrev Number: 14 (DW_TAG_member)
    <5ca>   DW_AT_name        : (indirect string, offset: 0x1dac): _old_offset
    <5ce>   DW_AT_decl_file   : 10
    <5cf>   DW_AT_decl_line   : 74
    <5d0>   DW_AT_decl_column : 11
    <5d1>   DW_AT_type        : <0x25d>
    <5d5>   DW_AT_data_member_location: 120
 <2><5d6>: Abbrev Number: 14 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0x502): _cur_column
    <5db>   DW_AT_decl_file   : 10
    <5dc>   DW_AT_decl_line   : 77
    <5dd>   DW_AT_decl_column : 18
    <5de>   DW_AT_type        : <0xcf>
    <5e2>   DW_AT_data_member_location: 128
 <2><5e3>: Abbrev Number: 14 (DW_TAG_member)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x253a): _vtable_offset
    <5e8>   DW_AT_decl_file   : 10
    <5e9>   DW_AT_decl_line   : 78
    <5ea>   DW_AT_decl_column : 15
    <5eb>   DW_AT_type        : <0xff>
    <5ef>   DW_AT_data_member_location: 130
 <2><5f0>: Abbrev Number: 14 (DW_TAG_member)
    <5f1>   DW_AT_name        : (indirect string, offset: 0x20dd): _shortbuf
    <5f5>   DW_AT_decl_file   : 10
    <5f6>   DW_AT_decl_line   : 79
    <5f7>   DW_AT_decl_column : 8
    <5f8>   DW_AT_type        : <0x698>
    <5fc>   DW_AT_data_member_location: 131
 <2><5fd>: Abbrev Number: 14 (DW_TAG_member)
    <5fe>   DW_AT_name        : (indirect string, offset: 0xfd6): _lock
    <602>   DW_AT_decl_file   : 10
    <603>   DW_AT_decl_line   : 81
    <604>   DW_AT_decl_column : 15
    <605>   DW_AT_type        : <0x6a8>
    <609>   DW_AT_data_member_location: 136
 <2><60a>: Abbrev Number: 14 (DW_TAG_member)
    <60b>   DW_AT_name        : (indirect string, offset: 0x1db0): _offset
    <60f>   DW_AT_decl_file   : 10
    <610>   DW_AT_decl_line   : 89
    <611>   DW_AT_decl_column : 13
    <612>   DW_AT_type        : <0x269>
    <616>   DW_AT_data_member_location: 144
 <2><617>: Abbrev Number: 14 (DW_TAG_member)
    <618>   DW_AT_name        : (indirect string, offset: 0x156): _codecvt
    <61c>   DW_AT_decl_file   : 10
    <61d>   DW_AT_decl_line   : 91
    <61e>   DW_AT_decl_column : 23
    <61f>   DW_AT_type        : <0x6b3>
    <623>   DW_AT_data_member_location: 152
 <2><624>: Abbrev Number: 14 (DW_TAG_member)
    <625>   DW_AT_name        : (indirect string, offset: 0x87e): _wide_data
    <629>   DW_AT_decl_file   : 10
    <62a>   DW_AT_decl_line   : 92
    <62b>   DW_AT_decl_column : 25
    <62c>   DW_AT_type        : <0x6be>
    <630>   DW_AT_data_member_location: 160
 <2><631>: Abbrev Number: 14 (DW_TAG_member)
    <632>   DW_AT_name        : (indirect string, offset: 0x1620): _freeres_list
    <636>   DW_AT_decl_file   : 10
    <637>   DW_AT_decl_line   : 93
    <638>   DW_AT_decl_column : 20
    <639>   DW_AT_type        : <0x692>
    <63d>   DW_AT_data_member_location: 168
 <2><63e>: Abbrev Number: 14 (DW_TAG_member)
    <63f>   DW_AT_name        : (indirect string, offset: 0x1f83): _freeres_buf
    <643>   DW_AT_decl_file   : 10
    <644>   DW_AT_decl_line   : 94
    <645>   DW_AT_decl_column : 9
    <646>   DW_AT_type        : <0xae>
    <64a>   DW_AT_data_member_location: 176
 <2><64b>: Abbrev Number: 14 (DW_TAG_member)
    <64c>   DW_AT_name        : (indirect string, offset: 0x18f5): __pad5
    <650>   DW_AT_decl_file   : 10
    <651>   DW_AT_decl_line   : 95
    <652>   DW_AT_decl_column : 10
    <653>   DW_AT_type        : <0x2d>
    <657>   DW_AT_data_member_location: 184
 <2><658>: Abbrev Number: 14 (DW_TAG_member)
    <659>   DW_AT_name        : (indirect string, offset: 0x390d): _mode
    <65d>   DW_AT_decl_file   : 10
    <65e>   DW_AT_decl_line   : 96
    <65f>   DW_AT_decl_column : 7
    <660>   DW_AT_type        : <0x13d>
    <664>   DW_AT_data_member_location: 192
 <2><665>: Abbrev Number: 14 (DW_TAG_member)
    <666>   DW_AT_name        : (indirect string, offset: 0x133b): _unused2
    <66a>   DW_AT_decl_file   : 10
    <66b>   DW_AT_decl_line   : 98
    <66c>   DW_AT_decl_column : 8
    <66d>   DW_AT_type        : <0x6c4>
    <671>   DW_AT_data_member_location: 196
 <2><672>: Abbrev Number: 0
 <1><673>: Abbrev Number: 2 (DW_TAG_typedef)
    <674>   DW_AT_name        : (indirect string, offset: 0x86b): FILE
    <678>   DW_AT_decl_file   : 11
    <679>   DW_AT_decl_line   : 7
    <67a>   DW_AT_decl_column : 25
    <67b>   DW_AT_type        : <0x4ec>
 <1><67f>: Abbrev Number: 19 (DW_TAG_typedef)
    <680>   DW_AT_name        : (indirect string, offset: 0xbe5): _IO_lock_t
    <684>   DW_AT_decl_file   : 10
    <685>   DW_AT_decl_line   : 43
    <686>   DW_AT_decl_column : 14
 <1><687>: Abbrev Number: 20 (DW_TAG_structure_type)
    <688>   DW_AT_name        : (indirect string, offset: 0x6ca): _IO_marker
    <68c>   DW_AT_declaration : 1
 <1><68c>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <68d>   DW_AT_byte_size   : 8
    <68e>   DW_AT_type        : <0x687>
 <1><692>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <693>   DW_AT_byte_size   : 8
    <694>   DW_AT_type        : <0x4ec>
 <1><698>: Abbrev Number: 5 (DW_TAG_array_type)
    <699>   DW_AT_type        : <0x3e6>
    <69d>   DW_AT_sibling     : <0x6a8>
 <2><6a1>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <6a2>   DW_AT_type        : <0x39>
    <6a6>   DW_AT_upper_bound : 0
 <2><6a7>: Abbrev Number: 0
 <1><6a8>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <6a9>   DW_AT_byte_size   : 8
    <6aa>   DW_AT_type        : <0x67f>
 <1><6ae>: Abbrev Number: 20 (DW_TAG_structure_type)
    <6af>   DW_AT_name        : (indirect string, offset: 0x153): _IO_codecvt
    <6b3>   DW_AT_declaration : 1
 <1><6b3>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <6b4>   DW_AT_byte_size   : 8
    <6b5>   DW_AT_type        : <0x6ae>
 <1><6b9>: Abbrev Number: 20 (DW_TAG_structure_type)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x87b): _IO_wide_data
    <6be>   DW_AT_declaration : 1
 <1><6be>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <6bf>   DW_AT_byte_size   : 8
    <6c0>   DW_AT_type        : <0x6b9>
 <1><6c4>: Abbrev Number: 5 (DW_TAG_array_type)
    <6c5>   DW_AT_type        : <0x3e6>
    <6c9>   DW_AT_sibling     : <0x6d4>
 <2><6cd>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <6ce>   DW_AT_type        : <0x39>
    <6d2>   DW_AT_upper_bound : 19
 <2><6d3>: Abbrev Number: 0
 <1><6d4>: Abbrev Number: 2 (DW_TAG_typedef)
    <6d5>   DW_AT_name        : (indirect string, offset: 0xaa7): va_list
    <6d9>   DW_AT_decl_file   : 12
    <6da>   DW_AT_decl_line   : 52
    <6db>   DW_AT_decl_column : 24
    <6dc>   DW_AT_type        : <0x40>
 <1><6e0>: Abbrev Number: 2 (DW_TAG_typedef)
    <6e1>   DW_AT_name        : (indirect string, offset: 0x1eb3): off_t
    <6e5>   DW_AT_decl_file   : 12
    <6e6>   DW_AT_decl_line   : 63
    <6e7>   DW_AT_decl_column : 17
    <6e8>   DW_AT_type        : <0x25d>
 <1><6ec>: Abbrev Number: 2 (DW_TAG_typedef)
    <6ed>   DW_AT_name        : (indirect string, offset: 0x143): ssize_t
    <6f1>   DW_AT_decl_file   : 12
    <6f2>   DW_AT_decl_line   : 77
    <6f3>   DW_AT_decl_column : 19
    <6f4>   DW_AT_type        : <0x3a4>
 <1><6f8>: Abbrev Number: 2 (DW_TAG_typedef)
    <6f9>   DW_AT_name        : (indirect string, offset: 0x932): fpos_t
    <6fd>   DW_AT_decl_file   : 12
    <6fe>   DW_AT_decl_line   : 84
    <6ff>   DW_AT_decl_column : 18
    <700>   DW_AT_type        : <0x4a0>
 <1><704>: Abbrev Number: 21 (DW_TAG_variable)
    <705>   DW_AT_name        : (indirect string, offset: 0xd65): stdin
    <709>   DW_AT_decl_file   : 12
    <70a>   DW_AT_decl_line   : 137
    <70b>   DW_AT_decl_column : 14
    <70c>   DW_AT_type        : <0x710>
    <710>   DW_AT_external    : 1
    <710>   DW_AT_declaration : 1
 <1><710>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <711>   DW_AT_byte_size   : 8
    <712>   DW_AT_type        : <0x673>
 <1><716>: Abbrev Number: 21 (DW_TAG_variable)
    <717>   DW_AT_name        : (indirect string, offset: 0x2906): stdout
    <71b>   DW_AT_decl_file   : 12
    <71c>   DW_AT_decl_line   : 138
    <71d>   DW_AT_decl_column : 14
    <71e>   DW_AT_type        : <0x710>
    <722>   DW_AT_external    : 1
    <722>   DW_AT_declaration : 1
 <1><722>: Abbrev Number: 21 (DW_TAG_variable)
    <723>   DW_AT_name        : (indirect string, offset: 0x23ed): stderr
    <727>   DW_AT_decl_file   : 12
    <728>   DW_AT_decl_line   : 139
    <729>   DW_AT_decl_column : 14
    <72a>   DW_AT_type        : <0x710>
    <72e>   DW_AT_external    : 1
    <72e>   DW_AT_declaration : 1
 <1><72e>: Abbrev Number: 22 (DW_TAG_typedef)
    <72f>   DW_AT_name        : (indirect string, offset: 0x2b9f): wchar_t
    <733>   DW_AT_decl_file   : 2
    <734>   DW_AT_decl_line   : 321
    <736>   DW_AT_decl_column : 24
    <737>   DW_AT_type        : <0x13d>
 <1><73b>: Abbrev Number: 13 (DW_TAG_structure_type)
    <73c>   DW_AT_byte_size   : 8
    <73d>   DW_AT_decl_file   : 13
    <73e>   DW_AT_decl_line   : 58
    <73f>   DW_AT_decl_column : 9
    <740>   DW_AT_sibling     : <0x75f>
 <2><744>: Abbrev Number: 14 (DW_TAG_member)
    <745>   DW_AT_name        : (indirect string, offset: 0x1540): quot
    <749>   DW_AT_decl_file   : 13
    <74a>   DW_AT_decl_line   : 60
    <74b>   DW_AT_decl_column : 9
    <74c>   DW_AT_type        : <0x13d>
    <750>   DW_AT_data_member_location: 0
 <2><751>: Abbrev Number: 23 (DW_TAG_member)
    <752>   DW_AT_name        : rem
    <756>   DW_AT_decl_file   : 13
    <757>   DW_AT_decl_line   : 61
    <758>   DW_AT_decl_column : 9
    <759>   DW_AT_type        : <0x13d>
    <75d>   DW_AT_data_member_location: 4
 <2><75e>: Abbrev Number: 0
 <1><75f>: Abbrev Number: 2 (DW_TAG_typedef)
    <760>   DW_AT_name        : (indirect string, offset: 0x13a3): div_t
    <764>   DW_AT_decl_file   : 13
    <765>   DW_AT_decl_line   : 62
    <766>   DW_AT_decl_column : 5
    <767>   DW_AT_type        : <0x73b>
 <1><76b>: Abbrev Number: 13 (DW_TAG_structure_type)
    <76c>   DW_AT_byte_size   : 16
    <76d>   DW_AT_decl_file   : 13
    <76e>   DW_AT_decl_line   : 66
    <76f>   DW_AT_decl_column : 9
    <770>   DW_AT_sibling     : <0x78f>
 <2><774>: Abbrev Number: 14 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0x1540): quot
    <779>   DW_AT_decl_file   : 13
    <77a>   DW_AT_decl_line   : 68
    <77b>   DW_AT_decl_column : 14
    <77c>   DW_AT_type        : <0x166>
    <780>   DW_AT_data_member_location: 0
 <2><781>: Abbrev Number: 23 (DW_TAG_member)
    <782>   DW_AT_name        : rem
    <786>   DW_AT_decl_file   : 13
    <787>   DW_AT_decl_line   : 69
    <788>   DW_AT_decl_column : 14
    <789>   DW_AT_type        : <0x166>
    <78d>   DW_AT_data_member_location: 8
 <2><78e>: Abbrev Number: 0
 <1><78f>: Abbrev Number: 2 (DW_TAG_typedef)
    <790>   DW_AT_name        : (indirect string, offset: 0x13a2): ldiv_t
    <794>   DW_AT_decl_file   : 13
    <795>   DW_AT_decl_line   : 70
    <796>   DW_AT_decl_column : 5
    <797>   DW_AT_type        : <0x76b>
 <1><79b>: Abbrev Number: 13 (DW_TAG_structure_type)
    <79c>   DW_AT_byte_size   : 16
    <79d>   DW_AT_decl_file   : 13
    <79e>   DW_AT_decl_line   : 76
    <79f>   DW_AT_decl_column : 23
    <7a0>   DW_AT_sibling     : <0x7bf>
 <2><7a4>: Abbrev Number: 14 (DW_TAG_member)
    <7a5>   DW_AT_name        : (indirect string, offset: 0x1540): quot
    <7a9>   DW_AT_decl_file   : 13
    <7aa>   DW_AT_decl_line   : 78
    <7ab>   DW_AT_decl_column : 19
    <7ac>   DW_AT_type        : <0x7bf>
    <7b0>   DW_AT_data_member_location: 0
 <2><7b1>: Abbrev Number: 23 (DW_TAG_member)
    <7b2>   DW_AT_name        : rem
    <7b6>   DW_AT_decl_file   : 13
    <7b7>   DW_AT_decl_line   : 79
    <7b8>   DW_AT_decl_column : 19
    <7b9>   DW_AT_type        : <0x7bf>
    <7bd>   DW_AT_data_member_location: 8
 <2><7be>: Abbrev Number: 0
 <1><7bf>: Abbrev Number: 3 (DW_TAG_base_type)
    <7c0>   DW_AT_byte_size   : 8
    <7c1>   DW_AT_encoding    : 5	(signed)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x1580): long long int
 <1><7c6>: Abbrev Number: 2 (DW_TAG_typedef)
    <7c7>   DW_AT_name        : (indirect string, offset: 0x13a1): lldiv_t
    <7cb>   DW_AT_decl_file   : 13
    <7cc>   DW_AT_decl_line   : 80
    <7cd>   DW_AT_decl_column : 5
    <7ce>   DW_AT_type        : <0x79b>
 <1><7d2>: Abbrev Number: 2 (DW_TAG_typedef)
    <7d3>   DW_AT_name        : (indirect string, offset: 0x2567): u_char
    <7d7>   DW_AT_decl_file   : 14
    <7d8>   DW_AT_decl_line   : 33
    <7d9>   DW_AT_decl_column : 18
    <7da>   DW_AT_type        : <0xb0>
 <1><7de>: Abbrev Number: 2 (DW_TAG_typedef)
    <7df>   DW_AT_name        : (indirect string, offset: 0x26a0): u_short
    <7e3>   DW_AT_decl_file   : 14
    <7e4>   DW_AT_decl_line   : 34
    <7e5>   DW_AT_decl_column : 19
    <7e6>   DW_AT_type        : <0xc3>
 <1><7ea>: Abbrev Number: 2 (DW_TAG_typedef)
    <7eb>   DW_AT_name        : (indirect string, offset: 0xe11): u_int
    <7ef>   DW_AT_decl_file   : 14
    <7f0>   DW_AT_decl_line   : 35
    <7f1>   DW_AT_decl_column : 17
    <7f2>   DW_AT_type        : <0xdb>
 <1><7f6>: Abbrev Number: 2 (DW_TAG_typedef)
    <7f7>   DW_AT_name        : (indirect string, offset: 0x27c1): u_long
    <7fb>   DW_AT_decl_file   : 14
    <7fc>   DW_AT_decl_line   : 36
    <7fd>   DW_AT_decl_column : 18
    <7fe>   DW_AT_type        : <0xe7>
 <1><802>: Abbrev Number: 2 (DW_TAG_typedef)
    <803>   DW_AT_name        : (indirect string, offset: 0x1346): quad_t
    <807>   DW_AT_decl_file   : 14
    <808>   DW_AT_decl_line   : 37
    <809>   DW_AT_decl_column : 18
    <80a>   DW_AT_type        : <0x1d9>
 <1><80e>: Abbrev Number: 2 (DW_TAG_typedef)
    <80f>   DW_AT_name        : (indirect string, offset: 0x2): u_quad_t
    <813>   DW_AT_decl_file   : 14
    <814>   DW_AT_decl_line   : 38
    <815>   DW_AT_decl_column : 20
    <816>   DW_AT_type        : <0x1e5>
 <1><81a>: Abbrev Number: 2 (DW_TAG_typedef)
    <81b>   DW_AT_name        : (indirect string, offset: 0x23a): fsid_t
    <81f>   DW_AT_decl_file   : 14
    <820>   DW_AT_decl_line   : 39
    <821>   DW_AT_decl_column : 18
    <822>   DW_AT_type        : <0x2a8>
 <1><826>: Abbrev Number: 2 (DW_TAG_typedef)
    <827>   DW_AT_name        : (indirect string, offset: 0x27a4): loff_t
    <82b>   DW_AT_decl_file   : 14
    <82c>   DW_AT_decl_line   : 42
    <82d>   DW_AT_decl_column : 18
    <82e>   DW_AT_type        : <0x3c8>
 <1><832>: Abbrev Number: 2 (DW_TAG_typedef)
    <833>   DW_AT_name        : (indirect string, offset: 0x14db): ino_t
    <837>   DW_AT_decl_file   : 14
    <838>   DW_AT_decl_line   : 47
    <839>   DW_AT_decl_column : 17
    <83a>   DW_AT_type        : <0x22d>
 <1><83e>: Abbrev Number: 2 (DW_TAG_typedef)
    <83f>   DW_AT_name        : (indirect string, offset: 0x56a): dev_t
    <843>   DW_AT_decl_file   : 14
    <844>   DW_AT_decl_line   : 59
    <845>   DW_AT_decl_column : 17
    <846>   DW_AT_type        : <0x209>
 <1><84a>: Abbrev Number: 2 (DW_TAG_typedef)
    <84b>   DW_AT_name        : (indirect string, offset: 0x26d): gid_t
    <84f>   DW_AT_decl_file   : 14
    <850>   DW_AT_decl_line   : 64
    <851>   DW_AT_decl_column : 17
    <852>   DW_AT_type        : <0x221>
 <1><856>: Abbrev Number: 2 (DW_TAG_typedef)
    <857>   DW_AT_name        : (indirect string, offset: 0xcae): mode_t
    <85b>   DW_AT_decl_file   : 14
    <85c>   DW_AT_decl_line   : 69
    <85d>   DW_AT_decl_column : 18
    <85e>   DW_AT_type        : <0x245>
 <1><862>: Abbrev Number: 2 (DW_TAG_typedef)
    <863>   DW_AT_name        : (indirect string, offset: 0x2a6c): nlink_t
    <867>   DW_AT_decl_file   : 14
    <868>   DW_AT_decl_line   : 74
    <869>   DW_AT_decl_column : 19
    <86a>   DW_AT_type        : <0x251>
 <1><86e>: Abbrev Number: 2 (DW_TAG_typedef)
    <86f>   DW_AT_name        : (indirect string, offset: 0x26e6): uid_t
    <873>   DW_AT_decl_file   : 14
    <874>   DW_AT_decl_line   : 79
    <875>   DW_AT_decl_column : 17
    <876>   DW_AT_type        : <0x215>
 <1><87a>: Abbrev Number: 2 (DW_TAG_typedef)
    <87b>   DW_AT_name        : (indirect string, offset: 0x1cc0): pid_t
    <87f>   DW_AT_decl_file   : 14
    <880>   DW_AT_decl_line   : 97
    <881>   DW_AT_decl_column : 17
    <882>   DW_AT_type        : <0x275>
 <1><886>: Abbrev Number: 2 (DW_TAG_typedef)
    <887>   DW_AT_name        : (indirect string, offset: 0x1654): id_t
    <88b>   DW_AT_decl_file   : 14
    <88c>   DW_AT_decl_line   : 103
    <88d>   DW_AT_decl_column : 16
    <88e>   DW_AT_type        : <0x2d8>
 <1><892>: Abbrev Number: 2 (DW_TAG_typedef)
    <893>   DW_AT_name        : (indirect string, offset: 0x14f5): daddr_t
    <897>   DW_AT_decl_file   : 14
    <898>   DW_AT_decl_line   : 114
    <899>   DW_AT_decl_column : 19
    <89a>   DW_AT_type        : <0x314>
 <1><89e>: Abbrev Number: 2 (DW_TAG_typedef)
    <89f>   DW_AT_name        : (indirect string, offset: 0x6b5): caddr_t
    <8a3>   DW_AT_decl_file   : 14
    <8a4>   DW_AT_decl_line   : 115
    <8a5>   DW_AT_decl_column : 19
    <8a6>   DW_AT_type        : <0x3d4>
 <1><8aa>: Abbrev Number: 2 (DW_TAG_typedef)
    <8ab>   DW_AT_name        : (indirect string, offset: 0x1bde): key_t
    <8af>   DW_AT_decl_file   : 14
    <8b0>   DW_AT_decl_line   : 121
    <8b1>   DW_AT_decl_column : 17
    <8b2>   DW_AT_type        : <0x320>
 <1><8b6>: Abbrev Number: 2 (DW_TAG_typedef)
    <8b7>   DW_AT_name        : (indirect string, offset: 0x1a4b): clock_t
    <8bb>   DW_AT_decl_file   : 15
    <8bc>   DW_AT_decl_line   : 7
    <8bd>   DW_AT_decl_column : 19
    <8be>   DW_AT_type        : <0x2b4>
 <1><8c2>: Abbrev Number: 2 (DW_TAG_typedef)
    <8c3>   DW_AT_name        : (indirect string, offset: 0x275): clockid_t
    <8c7>   DW_AT_decl_file   : 16
    <8c8>   DW_AT_decl_line   : 7
    <8c9>   DW_AT_decl_column : 21
    <8ca>   DW_AT_type        : <0x32c>
 <1><8ce>: Abbrev Number: 2 (DW_TAG_typedef)
    <8cf>   DW_AT_name        : (indirect string, offset: 0x2014): time_t
    <8d3>   DW_AT_decl_file   : 17
    <8d4>   DW_AT_decl_line   : 10
    <8d5>   DW_AT_decl_column : 18
    <8d6>   DW_AT_type        : <0x2e4>
 <1><8da>: Abbrev Number: 2 (DW_TAG_typedef)
    <8db>   DW_AT_name        : (indirect string, offset: 0xb4d): timer_t
    <8df>   DW_AT_decl_file   : 18
    <8e0>   DW_AT_decl_line   : 7
    <8e1>   DW_AT_decl_column : 19
    <8e2>   DW_AT_type        : <0x338>
 <1><8e6>: Abbrev Number: 2 (DW_TAG_typedef)
    <8e7>   DW_AT_name        : (indirect string, offset: 0xedd): ulong
    <8eb>   DW_AT_decl_file   : 14
    <8ec>   DW_AT_decl_line   : 148
    <8ed>   DW_AT_decl_column : 27
    <8ee>   DW_AT_type        : <0x39>
 <1><8f2>: Abbrev Number: 2 (DW_TAG_typedef)
    <8f3>   DW_AT_name        : (indirect string, offset: 0x1819): ushort
    <8f7>   DW_AT_decl_file   : 14
    <8f8>   DW_AT_decl_line   : 149
    <8f9>   DW_AT_decl_column : 28
    <8fa>   DW_AT_type        : <0xcf>
 <1><8fe>: Abbrev Number: 2 (DW_TAG_typedef)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x777): uint
    <903>   DW_AT_decl_file   : 14
    <904>   DW_AT_decl_line   : 150
    <905>   DW_AT_decl_column : 22
    <906>   DW_AT_type        : <0xa2>
 <1><90a>: Abbrev Number: 2 (DW_TAG_typedef)
    <90b>   DW_AT_name        : (indirect string, offset: 0x1d76): int8_t
    <90f>   DW_AT_decl_file   : 19
    <910>   DW_AT_decl_line   : 24
    <911>   DW_AT_decl_column : 18
    <912>   DW_AT_type        : <0xf3>
 <1><916>: Abbrev Number: 2 (DW_TAG_typedef)
    <917>   DW_AT_name        : (indirect string, offset: 0x20bd): int16_t
    <91b>   DW_AT_decl_file   : 19
    <91c>   DW_AT_decl_line   : 25
    <91d>   DW_AT_decl_column : 19
    <91e>   DW_AT_type        : <0x112>
 <1><922>: Abbrev Number: 2 (DW_TAG_typedef)
    <923>   DW_AT_name        : (indirect string, offset: 0x29eb): int32_t
    <927>   DW_AT_decl_file   : 19
    <928>   DW_AT_decl_line   : 26
    <929>   DW_AT_decl_column : 19
    <92a>   DW_AT_type        : <0x131>
 <1><92e>: Abbrev Number: 2 (DW_TAG_typedef)
    <92f>   DW_AT_name        : (indirect string, offset: 0x26b7): int64_t
    <933>   DW_AT_decl_file   : 19
    <934>   DW_AT_decl_line   : 27
    <935>   DW_AT_decl_column : 19
    <936>   DW_AT_type        : <0x15a>
 <1><93a>: Abbrev Number: 2 (DW_TAG_typedef)
    <93b>   DW_AT_name        : (indirect string, offset: 0xb03): u_int8_t
    <93f>   DW_AT_decl_file   : 14
    <940>   DW_AT_decl_line   : 158
    <941>   DW_AT_decl_column : 19
    <942>   DW_AT_type        : <0x106>
 <1><946>: Abbrev Number: 2 (DW_TAG_typedef)
    <947>   DW_AT_name        : (indirect string, offset: 0x1e4e): u_int16_t
    <94b>   DW_AT_decl_file   : 14
    <94c>   DW_AT_decl_line   : 159
    <94d>   DW_AT_decl_column : 20
    <94e>   DW_AT_type        : <0x125>
 <1><952>: Abbrev Number: 2 (DW_TAG_typedef)
    <953>   DW_AT_name        : (indirect string, offset: 0x23fe): u_int32_t
    <957>   DW_AT_decl_file   : 14
    <958>   DW_AT_decl_line   : 160
    <959>   DW_AT_decl_column : 20
    <95a>   DW_AT_type        : <0x14e>
 <1><95e>: Abbrev Number: 2 (DW_TAG_typedef)
    <95f>   DW_AT_name        : (indirect string, offset: 0x52f): u_int64_t
    <963>   DW_AT_decl_file   : 14
    <964>   DW_AT_decl_line   : 161
    <965>   DW_AT_decl_column : 20
    <966>   DW_AT_type        : <0x16d>
 <1><96a>: Abbrev Number: 2 (DW_TAG_typedef)
    <96b>   DW_AT_name        : (indirect string, offset: 0x32a): register_t
    <96f>   DW_AT_decl_file   : 14
    <970>   DW_AT_decl_line   : 164
    <971>   DW_AT_decl_column : 13
    <972>   DW_AT_type        : <0x166>
 <1><976>: Abbrev Number: 13 (DW_TAG_structure_type)
    <977>   DW_AT_byte_size   : 128
    <978>   DW_AT_decl_file   : 20
    <979>   DW_AT_decl_line   : 5
    <97a>   DW_AT_decl_column : 9
    <97b>   DW_AT_sibling     : <0x98d>
 <2><97f>: Abbrev Number: 14 (DW_TAG_member)
    <980>   DW_AT_name        : (indirect string, offset: 0x25fd): __val
    <984>   DW_AT_decl_file   : 20
    <985>   DW_AT_decl_line   : 7
    <986>   DW_AT_decl_column : 21
    <987>   DW_AT_type        : <0x98d>
    <98b>   DW_AT_data_member_location: 0
 <2><98c>: Abbrev Number: 0
 <1><98d>: Abbrev Number: 5 (DW_TAG_array_type)
    <98e>   DW_AT_type        : <0x39>
    <992>   DW_AT_sibling     : <0x99d>
 <2><996>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <997>   DW_AT_type        : <0x39>
    <99b>   DW_AT_upper_bound : 15
 <2><99c>: Abbrev Number: 0
 <1><99d>: Abbrev Number: 2 (DW_TAG_typedef)
    <99e>   DW_AT_name        : (indirect string, offset: 0x2ac2): __sigset_t
    <9a2>   DW_AT_decl_file   : 20
    <9a3>   DW_AT_decl_line   : 8
    <9a4>   DW_AT_decl_column : 3
    <9a5>   DW_AT_type        : <0x976>
 <1><9a9>: Abbrev Number: 2 (DW_TAG_typedef)
    <9aa>   DW_AT_name        : (indirect string, offset: 0x2ac4): sigset_t
    <9ae>   DW_AT_decl_file   : 21
    <9af>   DW_AT_decl_line   : 7
    <9b0>   DW_AT_decl_column : 20
    <9b1>   DW_AT_type        : <0x99d>
 <1><9b5>: Abbrev Number: 18 (DW_TAG_structure_type)
    <9b6>   DW_AT_name        : (indirect string, offset: 0xc43): timeval
    <9ba>   DW_AT_byte_size   : 16
    <9bb>   DW_AT_decl_file   : 22
    <9bc>   DW_AT_decl_line   : 8
    <9bd>   DW_AT_decl_column : 8
    <9be>   DW_AT_sibling     : <0x9dd>
 <2><9c2>: Abbrev Number: 14 (DW_TAG_member)
    <9c3>   DW_AT_name        : (indirect string, offset: 0x2b79): tv_sec
    <9c7>   DW_AT_decl_file   : 22
    <9c8>   DW_AT_decl_line   : 14
    <9c9>   DW_AT_decl_column : 12
    <9ca>   DW_AT_type        : <0x2e4>
    <9ce>   DW_AT_data_member_location: 0
 <2><9cf>: Abbrev Number: 14 (DW_TAG_member)
    <9d0>   DW_AT_name        : (indirect string, offset: 0xf76): tv_usec
    <9d4>   DW_AT_decl_file   : 22
    <9d5>   DW_AT_decl_line   : 15
    <9d6>   DW_AT_decl_column : 17
    <9d7>   DW_AT_type        : <0x2fc>
    <9db>   DW_AT_data_member_location: 8
 <2><9dc>: Abbrev Number: 0
 <1><9dd>: Abbrev Number: 18 (DW_TAG_structure_type)
    <9de>   DW_AT_name        : (indirect string, offset: 0x134d): timespec
    <9e2>   DW_AT_byte_size   : 16
    <9e3>   DW_AT_decl_file   : 23
    <9e4>   DW_AT_decl_line   : 11
    <9e5>   DW_AT_decl_column : 8
    <9e6>   DW_AT_sibling     : <0xa05>
 <2><9ea>: Abbrev Number: 14 (DW_TAG_member)
    <9eb>   DW_AT_name        : (indirect string, offset: 0x2b79): tv_sec
    <9ef>   DW_AT_decl_file   : 23
    <9f0>   DW_AT_decl_line   : 16
    <9f1>   DW_AT_decl_column : 12
    <9f2>   DW_AT_type        : <0x2e4>
    <9f6>   DW_AT_data_member_location: 0
 <2><9f7>: Abbrev Number: 14 (DW_TAG_member)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x24ab): tv_nsec
    <9fc>   DW_AT_decl_file   : 23
    <9fd>   DW_AT_decl_line   : 21
    <9fe>   DW_AT_decl_column : 21
    <9ff>   DW_AT_type        : <0x3b0>
    <a03>   DW_AT_data_member_location: 8
 <2><a04>: Abbrev Number: 0
 <1><a05>: Abbrev Number: 2 (DW_TAG_typedef)
    <a06>   DW_AT_name        : (indirect string, offset: 0x165b): suseconds_t
    <a0a>   DW_AT_decl_file   : 24
    <a0b>   DW_AT_decl_line   : 43
    <a0c>   DW_AT_decl_column : 23
    <a0d>   DW_AT_type        : <0x2fc>
 <1><a11>: Abbrev Number: 2 (DW_TAG_typedef)
    <a12>   DW_AT_name        : (indirect string, offset: 0xf43): __fd_mask
    <a16>   DW_AT_decl_file   : 24
    <a17>   DW_AT_decl_line   : 49
    <a18>   DW_AT_decl_column : 18
    <a19>   DW_AT_type        : <0x166>
 <1><a1d>: Abbrev Number: 13 (DW_TAG_structure_type)
    <a1e>   DW_AT_byte_size   : 128
    <a1f>   DW_AT_decl_file   : 24
    <a20>   DW_AT_decl_line   : 59
    <a21>   DW_AT_decl_column : 9
    <a22>   DW_AT_sibling     : <0xa34>
 <2><a26>: Abbrev Number: 14 (DW_TAG_member)
    <a27>   DW_AT_name        : (indirect string, offset: 0x94d): __fds_bits
    <a2b>   DW_AT_decl_file   : 24
    <a2c>   DW_AT_decl_line   : 67
    <a2d>   DW_AT_decl_column : 15
    <a2e>   DW_AT_type        : <0xa34>
    <a32>   DW_AT_data_member_location: 0
 <2><a33>: Abbrev Number: 0
 <1><a34>: Abbrev Number: 5 (DW_TAG_array_type)
    <a35>   DW_AT_type        : <0xa11>
    <a39>   DW_AT_sibling     : <0xa44>
 <2><a3d>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <a3e>   DW_AT_type        : <0x39>
    <a42>   DW_AT_upper_bound : 15
 <2><a43>: Abbrev Number: 0
 <1><a44>: Abbrev Number: 2 (DW_TAG_typedef)
    <a45>   DW_AT_name        : (indirect string, offset: 0x2c9d): fd_set
    <a49>   DW_AT_decl_file   : 24
    <a4a>   DW_AT_decl_line   : 70
    <a4b>   DW_AT_decl_column : 5
    <a4c>   DW_AT_type        : <0xa1d>
 <1><a50>: Abbrev Number: 2 (DW_TAG_typedef)
    <a51>   DW_AT_name        : (indirect string, offset: 0xf45): fd_mask
    <a55>   DW_AT_decl_file   : 24
    <a56>   DW_AT_decl_line   : 77
    <a57>   DW_AT_decl_column : 19
    <a58>   DW_AT_type        : <0xa11>
 <1><a5c>: Abbrev Number: 2 (DW_TAG_typedef)
    <a5d>   DW_AT_name        : (indirect string, offset: 0x82f): blksize_t
    <a61>   DW_AT_decl_file   : 14
    <a62>   DW_AT_decl_line   : 185
    <a63>   DW_AT_decl_column : 21
    <a64>   DW_AT_type        : <0x344>
 <1><a68>: Abbrev Number: 2 (DW_TAG_typedef)
    <a69>   DW_AT_name        : (indirect string, offset: 0x146b): blkcnt_t
    <a6d>   DW_AT_decl_file   : 14
    <a6e>   DW_AT_decl_line   : 192
    <a6f>   DW_AT_decl_column : 20
    <a70>   DW_AT_type        : <0x350>
 <1><a74>: Abbrev Number: 2 (DW_TAG_typedef)
    <a75>   DW_AT_name        : (indirect string, offset: 0xac4): fsblkcnt_t
    <a79>   DW_AT_decl_file   : 14
    <a7a>   DW_AT_decl_line   : 196
    <a7b>   DW_AT_decl_column : 22
    <a7c>   DW_AT_type        : <0x368>
 <1><a80>: Abbrev Number: 2 (DW_TAG_typedef)
    <a81>   DW_AT_name        : (indirect string, offset: 0x195e): fsfilcnt_t
    <a85>   DW_AT_decl_file   : 14
    <a86>   DW_AT_decl_line   : 200
    <a87>   DW_AT_decl_column : 22
    <a88>   DW_AT_type        : <0x380>
 <1><a8c>: Abbrev Number: 18 (DW_TAG_structure_type)
    <a8d>   DW_AT_name        : (indirect string, offset: 0x3c3): __pthread_internal_list
    <a91>   DW_AT_byte_size   : 16
    <a92>   DW_AT_decl_file   : 25
    <a93>   DW_AT_decl_line   : 49
    <a94>   DW_AT_decl_column : 16
    <a95>   DW_AT_sibling     : <0xab4>
 <2><a99>: Abbrev Number: 14 (DW_TAG_member)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x307): __prev
    <a9e>   DW_AT_decl_file   : 25
    <a9f>   DW_AT_decl_line   : 51
    <aa0>   DW_AT_decl_column : 35
    <aa1>   DW_AT_type        : <0xab4>
    <aa5>   DW_AT_data_member_location: 0
 <2><aa6>: Abbrev Number: 14 (DW_TAG_member)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x2b4): __next
    <aab>   DW_AT_decl_file   : 25
    <aac>   DW_AT_decl_line   : 52
    <aad>   DW_AT_decl_column : 35
    <aae>   DW_AT_type        : <0xab4>
    <ab2>   DW_AT_data_member_location: 8
 <2><ab3>: Abbrev Number: 0
 <1><ab4>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <ab5>   DW_AT_byte_size   : 8
    <ab6>   DW_AT_type        : <0xa8c>
 <1><aba>: Abbrev Number: 2 (DW_TAG_typedef)
    <abb>   DW_AT_name        : (indirect string, offset: 0x1e5): __pthread_list_t
    <abf>   DW_AT_decl_file   : 25
    <ac0>   DW_AT_decl_line   : 53
    <ac1>   DW_AT_decl_column : 3
    <ac2>   DW_AT_type        : <0xa8c>
 <1><ac6>: Abbrev Number: 18 (DW_TAG_structure_type)
    <ac7>   DW_AT_name        : (indirect string, offset: 0x754): __pthread_internal_slist
    <acb>   DW_AT_byte_size   : 8
    <acc>   DW_AT_decl_file   : 25
    <acd>   DW_AT_decl_line   : 55
    <ace>   DW_AT_decl_column : 16
    <acf>   DW_AT_sibling     : <0xae1>
 <2><ad3>: Abbrev Number: 14 (DW_TAG_member)
    <ad4>   DW_AT_name        : (indirect string, offset: 0x2b4): __next
    <ad8>   DW_AT_decl_file   : 25
    <ad9>   DW_AT_decl_line   : 57
    <ada>   DW_AT_decl_column : 36
    <adb>   DW_AT_type        : <0xae1>
    <adf>   DW_AT_data_member_location: 0
 <2><ae0>: Abbrev Number: 0
 <1><ae1>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <ae2>   DW_AT_byte_size   : 8
    <ae3>   DW_AT_type        : <0xac6>
 <1><ae7>: Abbrev Number: 2 (DW_TAG_typedef)
    <ae8>   DW_AT_name        : (indirect string, offset: 0xc74): __pthread_slist_t
    <aec>   DW_AT_decl_file   : 25
    <aed>   DW_AT_decl_line   : 58
    <aee>   DW_AT_decl_column : 3
    <aef>   DW_AT_type        : <0xac6>
 <1><af3>: Abbrev Number: 18 (DW_TAG_structure_type)
    <af4>   DW_AT_name        : (indirect string, offset: 0x2924): __pthread_mutex_s
    <af8>   DW_AT_byte_size   : 40
    <af9>   DW_AT_decl_file   : 26
    <afa>   DW_AT_decl_line   : 22
    <afb>   DW_AT_decl_column : 8
    <afc>   DW_AT_sibling     : <0xb69>
 <2><b00>: Abbrev Number: 14 (DW_TAG_member)
    <b01>   DW_AT_name        : (indirect string, offset: 0xfd5): __lock
    <b05>   DW_AT_decl_file   : 26
    <b06>   DW_AT_decl_line   : 24
    <b07>   DW_AT_decl_column : 7
    <b08>   DW_AT_type        : <0x13d>
    <b0c>   DW_AT_data_member_location: 0
 <2><b0d>: Abbrev Number: 14 (DW_TAG_member)
    <b0e>   DW_AT_name        : (indirect string, offset: 0x1afd): __count
    <b12>   DW_AT_decl_file   : 26
    <b13>   DW_AT_decl_line   : 25
    <b14>   DW_AT_decl_column : 16
    <b15>   DW_AT_type        : <0xa2>
    <b19>   DW_AT_data_member_location: 4
 <2><b1a>: Abbrev Number: 14 (DW_TAG_member)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x43f): __owner
    <b1f>   DW_AT_decl_file   : 26
    <b20>   DW_AT_decl_line   : 26
    <b21>   DW_AT_decl_column : 7
    <b22>   DW_AT_type        : <0x13d>
    <b26>   DW_AT_data_member_location: 8
 <2><b27>: Abbrev Number: 14 (DW_TAG_member)
    <b28>   DW_AT_name        : (indirect string, offset: 0x2021): __nusers
    <b2c>   DW_AT_decl_file   : 26
    <b2d>   DW_AT_decl_line   : 28
    <b2e>   DW_AT_decl_column : 16
    <b2f>   DW_AT_type        : <0xa2>
    <b33>   DW_AT_data_member_location: 12
 <2><b34>: Abbrev Number: 14 (DW_TAG_member)
    <b35>   DW_AT_name        : (indirect string, offset: 0xb8): __kind
    <b39>   DW_AT_decl_file   : 26
    <b3a>   DW_AT_decl_line   : 32
    <b3b>   DW_AT_decl_column : 7
    <b3c>   DW_AT_type        : <0x13d>
    <b40>   DW_AT_data_member_location: 16
 <2><b41>: Abbrev Number: 14 (DW_TAG_member)
    <b42>   DW_AT_name        : (indirect string, offset: 0x981): __spins
    <b46>   DW_AT_decl_file   : 26
    <b47>   DW_AT_decl_line   : 34
    <b48>   DW_AT_decl_column : 9
    <b49>   DW_AT_type        : <0x11e>
    <b4d>   DW_AT_data_member_location: 20
 <2><b4e>: Abbrev Number: 14 (DW_TAG_member)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x255b): __elision
    <b53>   DW_AT_decl_file   : 26
    <b54>   DW_AT_decl_line   : 35
    <b55>   DW_AT_decl_column : 9
    <b56>   DW_AT_type        : <0x11e>
    <b5a>   DW_AT_data_member_location: 22
 <2><b5b>: Abbrev Number: 14 (DW_TAG_member)
    <b5c>   DW_AT_name        : (indirect string, offset: 0x1e47): __list
    <b60>   DW_AT_decl_file   : 26
    <b61>   DW_AT_decl_line   : 36
    <b62>   DW_AT_decl_column : 20
    <b63>   DW_AT_type        : <0xaba>
    <b67>   DW_AT_data_member_location: 24
 <2><b68>: Abbrev Number: 0
 <1><b69>: Abbrev Number: 18 (DW_TAG_structure_type)
    <b6a>   DW_AT_name        : (indirect string, offset: 0x2686): __pthread_rwlock_arch_t
    <b6e>   DW_AT_byte_size   : 56
    <b6f>   DW_AT_decl_file   : 27
    <b70>   DW_AT_decl_line   : 23
    <b71>   DW_AT_decl_column : 8
    <b72>   DW_AT_sibling     : <0xc13>
 <2><b76>: Abbrev Number: 14 (DW_TAG_member)
    <b77>   DW_AT_name        : (indirect string, offset: 0x23d6): __readers
    <b7b>   DW_AT_decl_file   : 27
    <b7c>   DW_AT_decl_line   : 25
    <b7d>   DW_AT_decl_column : 16
    <b7e>   DW_AT_type        : <0xa2>
    <b82>   DW_AT_data_member_location: 0
 <2><b83>: Abbrev Number: 14 (DW_TAG_member)
    <b84>   DW_AT_name        : (indirect string, offset: 0x823): __writers
    <b88>   DW_AT_decl_file   : 27
    <b89>   DW_AT_decl_line   : 26
    <b8a>   DW_AT_decl_column : 16
    <b8b>   DW_AT_type        : <0xa2>
    <b8f>   DW_AT_data_member_location: 4
 <2><b90>: Abbrev Number: 14 (DW_TAG_member)
    <b91>   DW_AT_name        : (indirect string, offset: 0x1d7d): __wrphase_futex
    <b95>   DW_AT_decl_file   : 27
    <b96>   DW_AT_decl_line   : 27
    <b97>   DW_AT_decl_column : 16
    <b98>   DW_AT_type        : <0xa2>
    <b9c>   DW_AT_data_member_location: 8
 <2><b9d>: Abbrev Number: 14 (DW_TAG_member)
    <b9e>   DW_AT_name        : (indirect string, offset: 0x2a25): __writers_futex
    <ba2>   DW_AT_decl_file   : 27
    <ba3>   DW_AT_decl_line   : 28
    <ba4>   DW_AT_decl_column : 16
    <ba5>   DW_AT_type        : <0xa2>
    <ba9>   DW_AT_data_member_location: 12
 <2><baa>: Abbrev Number: 14 (DW_TAG_member)
    <bab>   DW_AT_name        : (indirect string, offset: 0x18e7): __pad3
    <baf>   DW_AT_decl_file   : 27
    <bb0>   DW_AT_decl_line   : 29
    <bb1>   DW_AT_decl_column : 16
    <bb2>   DW_AT_type        : <0xa2>
    <bb6>   DW_AT_data_member_location: 16
 <2><bb7>: Abbrev Number: 14 (DW_TAG_member)
    <bb8>   DW_AT_name        : (indirect string, offset: 0x18ee): __pad4
    <bbc>   DW_AT_decl_file   : 27
    <bbd>   DW_AT_decl_line   : 30
    <bbe>   DW_AT_decl_column : 16
    <bbf>   DW_AT_type        : <0xa2>
    <bc3>   DW_AT_data_member_location: 20
 <2><bc4>: Abbrev Number: 14 (DW_TAG_member)
    <bc5>   DW_AT_name        : (indirect string, offset: 0x1356): __cur_writer
    <bc9>   DW_AT_decl_file   : 27
    <bca>   DW_AT_decl_line   : 32
    <bcb>   DW_AT_decl_column : 7
    <bcc>   DW_AT_type        : <0x13d>
    <bd0>   DW_AT_data_member_location: 24
 <2><bd1>: Abbrev Number: 14 (DW_TAG_member)
    <bd2>   DW_AT_name        : (indirect string, offset: 0xb): __shared
    <bd6>   DW_AT_decl_file   : 27
    <bd7>   DW_AT_decl_line   : 33
    <bd8>   DW_AT_decl_column : 7
    <bd9>   DW_AT_type        : <0x13d>
    <bdd>   DW_AT_data_member_location: 28
 <2><bde>: Abbrev Number: 14 (DW_TAG_member)
    <bdf>   DW_AT_name        : (indirect string, offset: 0x1a31): __rwelision
    <be3>   DW_AT_decl_file   : 27
    <be4>   DW_AT_decl_line   : 34
    <be5>   DW_AT_decl_column : 15
    <be6>   DW_AT_type        : <0xff>
    <bea>   DW_AT_data_member_location: 32
 <2><beb>: Abbrev Number: 14 (DW_TAG_member)
    <bec>   DW_AT_name        : (indirect string, offset: 0x18d9): __pad1
    <bf0>   DW_AT_decl_file   : 27
    <bf1>   DW_AT_decl_line   : 39
    <bf2>   DW_AT_decl_column : 17
    <bf3>   DW_AT_type        : <0xc13>
    <bf7>   DW_AT_data_member_location: 33
 <2><bf8>: Abbrev Number: 14 (DW_TAG_member)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x18e0): __pad2
    <bfd>   DW_AT_decl_file   : 27
    <bfe>   DW_AT_decl_line   : 42
    <bff>   DW_AT_decl_column : 21
    <c00>   DW_AT_type        : <0x39>
    <c04>   DW_AT_data_member_location: 40
 <2><c05>: Abbrev Number: 14 (DW_TAG_member)
    <c06>   DW_AT_name        : (indirect string, offset: 0x1010): __flags
    <c0a>   DW_AT_decl_file   : 27
    <c0b>   DW_AT_decl_line   : 45
    <c0c>   DW_AT_decl_column : 16
    <c0d>   DW_AT_type        : <0xa2>
    <c11>   DW_AT_data_member_location: 48
 <2><c12>: Abbrev Number: 0
 <1><c13>: Abbrev Number: 5 (DW_TAG_array_type)
    <c14>   DW_AT_type        : <0xbc>
    <c18>   DW_AT_sibling     : <0xc23>
 <2><c1c>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <c1d>   DW_AT_type        : <0x39>
    <c21>   DW_AT_upper_bound : 6
 <2><c22>: Abbrev Number: 0
 <1><c23>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c24>   DW_AT_byte_size   : 8
    <c25>   DW_AT_decl_file   : 25
    <c26>   DW_AT_decl_line   : 97
    <c27>   DW_AT_decl_column : 5
    <c28>   DW_AT_sibling     : <0xc47>
 <2><c2c>: Abbrev Number: 14 (DW_TAG_member)
    <c2d>   DW_AT_name        : (indirect string, offset: 0xcc9): __low
    <c31>   DW_AT_decl_file   : 25
    <c32>   DW_AT_decl_line   : 99
    <c33>   DW_AT_decl_column : 20
    <c34>   DW_AT_type        : <0xa2>
    <c38>   DW_AT_data_member_location: 0
 <2><c39>: Abbrev Number: 14 (DW_TAG_member)
    <c3a>   DW_AT_name        : (indirect string, offset: 0xba6): __high
    <c3e>   DW_AT_decl_file   : 25
    <c3f>   DW_AT_decl_line   : 100
    <c40>   DW_AT_decl_column : 20
    <c41>   DW_AT_type        : <0xa2>
    <c45>   DW_AT_data_member_location: 4
 <2><c46>: Abbrev Number: 0
 <1><c47>: Abbrev Number: 16 (DW_TAG_union_type)
    <c48>   DW_AT_byte_size   : 8
    <c49>   DW_AT_decl_file   : 25
    <c4a>   DW_AT_decl_line   : 94
    <c4b>   DW_AT_decl_column : 17
    <c4c>   DW_AT_sibling     : <0xc69>
 <2><c50>: Abbrev Number: 17 (DW_TAG_member)
    <c51>   DW_AT_name        : (indirect string, offset: 0x71f): __wseq
    <c55>   DW_AT_decl_file   : 25
    <c56>   DW_AT_decl_line   : 96
    <c57>   DW_AT_decl_column : 42
    <c58>   DW_AT_type        : <0xc69>
 <2><c5c>: Abbrev Number: 17 (DW_TAG_member)
    <c5d>   DW_AT_name        : (indirect string, offset: 0xacf): __wseq32
    <c61>   DW_AT_decl_file   : 25
    <c62>   DW_AT_decl_line   : 101
    <c63>   DW_AT_decl_column : 7
    <c64>   DW_AT_type        : <0xc23>
 <2><c68>: Abbrev Number: 0
 <1><c69>: Abbrev Number: 3 (DW_TAG_base_type)
    <c6a>   DW_AT_byte_size   : 8
    <c6b>   DW_AT_encoding    : 7	(unsigned)
    <c6c>   DW_AT_name        : (indirect string, offset: 0x1dfc): long long unsigned int
 <1><c70>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c71>   DW_AT_byte_size   : 8
    <c72>   DW_AT_decl_file   : 25
    <c73>   DW_AT_decl_line   : 106
    <c74>   DW_AT_decl_column : 5
    <c75>   DW_AT_sibling     : <0xc94>
 <2><c79>: Abbrev Number: 14 (DW_TAG_member)
    <c7a>   DW_AT_name        : (indirect string, offset: 0xcc9): __low
    <c7e>   DW_AT_decl_file   : 25
    <c7f>   DW_AT_decl_line   : 108
    <c80>   DW_AT_decl_column : 20
    <c81>   DW_AT_type        : <0xa2>
    <c85>   DW_AT_data_member_location: 0
 <2><c86>: Abbrev Number: 14 (DW_TAG_member)
    <c87>   DW_AT_name        : (indirect string, offset: 0xba6): __high
    <c8b>   DW_AT_decl_file   : 25
    <c8c>   DW_AT_decl_line   : 109
    <c8d>   DW_AT_decl_column : 20
    <c8e>   DW_AT_type        : <0xa2>
    <c92>   DW_AT_data_member_location: 4
 <2><c93>: Abbrev Number: 0
 <1><c94>: Abbrev Number: 16 (DW_TAG_union_type)
    <c95>   DW_AT_byte_size   : 8
    <c96>   DW_AT_decl_file   : 25
    <c97>   DW_AT_decl_line   : 103
    <c98>   DW_AT_decl_column : 17
    <c99>   DW_AT_sibling     : <0xcb6>
 <2><c9d>: Abbrev Number: 17 (DW_TAG_member)
    <c9e>   DW_AT_name        : (indirect string, offset: 0x1166): __g1_start
    <ca2>   DW_AT_decl_file   : 25
    <ca3>   DW_AT_decl_line   : 105
    <ca4>   DW_AT_decl_column : 42
    <ca5>   DW_AT_type        : <0xc69>
 <2><ca9>: Abbrev Number: 17 (DW_TAG_member)
    <caa>   DW_AT_name        : (indirect string, offset: 0xbd8): __g1_start32
    <cae>   DW_AT_decl_file   : 25
    <caf>   DW_AT_decl_line   : 110
    <cb0>   DW_AT_decl_column : 7
    <cb1>   DW_AT_type        : <0xc70>
 <2><cb5>: Abbrev Number: 0
 <1><cb6>: Abbrev Number: 18 (DW_TAG_structure_type)
    <cb7>   DW_AT_name        : (indirect string, offset: 0x283c): __pthread_cond_s
    <cbb>   DW_AT_byte_size   : 48
    <cbc>   DW_AT_decl_file   : 25
    <cbd>   DW_AT_decl_line   : 92
    <cbe>   DW_AT_decl_column : 8
    <cbf>   DW_AT_sibling     : <0xd11>
 <2><cc3>: Abbrev Number: 24 (DW_TAG_member)
    <cc4>   DW_AT_type        : <0xc47>
    <cc8>   DW_AT_data_member_location: 0
 <2><cc9>: Abbrev Number: 24 (DW_TAG_member)
    <cca>   DW_AT_type        : <0xc94>
    <cce>   DW_AT_data_member_location: 8
 <2><ccf>: Abbrev Number: 14 (DW_TAG_member)
    <cd0>   DW_AT_name        : (indirect string, offset: 0x206c): __g_refs
    <cd4>   DW_AT_decl_file   : 25
    <cd5>   DW_AT_decl_line   : 112
    <cd6>   DW_AT_decl_column : 16
    <cd7>   DW_AT_type        : <0xd11>
    <cdb>   DW_AT_data_member_location: 16
 <2><cdc>: Abbrev Number: 14 (DW_TAG_member)
    <cdd>   DW_AT_name        : (indirect string, offset: 0x1eb9): __g_size
    <ce1>   DW_AT_decl_file   : 25
    <ce2>   DW_AT_decl_line   : 113
    <ce3>   DW_AT_decl_column : 16
    <ce4>   DW_AT_type        : <0xd11>
    <ce8>   DW_AT_data_member_location: 24
 <2><ce9>: Abbrev Number: 14 (DW_TAG_member)
    <cea>   DW_AT_name        : (indirect string, offset: 0x14b1): __g1_orig_size
    <cee>   DW_AT_decl_file   : 25
    <cef>   DW_AT_decl_line   : 114
    <cf0>   DW_AT_decl_column : 16
    <cf1>   DW_AT_type        : <0xa2>
    <cf5>   DW_AT_data_member_location: 32
 <2><cf6>: Abbrev Number: 14 (DW_TAG_member)
    <cf7>   DW_AT_name        : (indirect string, offset: 0x17c9): __wrefs
    <cfb>   DW_AT_decl_file   : 25
    <cfc>   DW_AT_decl_line   : 115
    <cfd>   DW_AT_decl_column : 16
    <cfe>   DW_AT_type        : <0xa2>
    <d02>   DW_AT_data_member_location: 36
 <2><d03>: Abbrev Number: 14 (DW_TAG_member)
    <d04>   DW_AT_name        : (indirect string, offset: 0x25f1): __g_signals
    <d08>   DW_AT_decl_file   : 25
    <d09>   DW_AT_decl_line   : 116
    <d0a>   DW_AT_decl_column : 16
    <d0b>   DW_AT_type        : <0xd11>
    <d0f>   DW_AT_data_member_location: 40
 <2><d10>: Abbrev Number: 0
 <1><d11>: Abbrev Number: 5 (DW_TAG_array_type)
    <d12>   DW_AT_type        : <0xa2>
    <d16>   DW_AT_sibling     : <0xd21>
 <2><d1a>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <d1b>   DW_AT_type        : <0x39>
    <d1f>   DW_AT_upper_bound : 1
 <2><d20>: Abbrev Number: 0
 <1><d21>: Abbrev Number: 2 (DW_TAG_typedef)
    <d22>   DW_AT_name        : (indirect string, offset: 0x4d9): __tss_t
    <d26>   DW_AT_decl_file   : 25
    <d27>   DW_AT_decl_line   : 119
    <d28>   DW_AT_decl_column : 22
    <d29>   DW_AT_type        : <0xa2>
 <1><d2d>: Abbrev Number: 2 (DW_TAG_typedef)
    <d2e>   DW_AT_name        : (indirect string, offset: 0x8ad): __thrd_t
    <d32>   DW_AT_decl_file   : 25
    <d33>   DW_AT_decl_line   : 120
    <d34>   DW_AT_decl_column : 27
    <d35>   DW_AT_type        : <0x39>
 <1><d39>: Abbrev Number: 13 (DW_TAG_structure_type)
    <d3a>   DW_AT_byte_size   : 4
    <d3b>   DW_AT_decl_file   : 25
    <d3c>   DW_AT_decl_line   : 122
    <d3d>   DW_AT_decl_column : 9
    <d3e>   DW_AT_sibling     : <0xd50>
 <2><d42>: Abbrev Number: 14 (DW_TAG_member)
    <d43>   DW_AT_name        : (indirect string, offset: 0x8f9): __data
    <d47>   DW_AT_decl_file   : 25
    <d48>   DW_AT_decl_line   : 124
    <d49>   DW_AT_decl_column : 7
    <d4a>   DW_AT_type        : <0x13d>
    <d4e>   DW_AT_data_member_location: 0
 <2><d4f>: Abbrev Number: 0
 <1><d50>: Abbrev Number: 2 (DW_TAG_typedef)
    <d51>   DW_AT_name        : (indirect string, offset: 0x1b44): __once_flag
    <d55>   DW_AT_decl_file   : 25
    <d56>   DW_AT_decl_line   : 125
    <d57>   DW_AT_decl_column : 3
    <d58>   DW_AT_type        : <0xd39>
 <1><d5c>: Abbrev Number: 2 (DW_TAG_typedef)
    <d5d>   DW_AT_name        : (indirect string, offset: 0x11f6): pthread_t
    <d61>   DW_AT_decl_file   : 28
    <d62>   DW_AT_decl_line   : 27
    <d63>   DW_AT_decl_column : 27
    <d64>   DW_AT_type        : <0x39>
 <1><d68>: Abbrev Number: 16 (DW_TAG_union_type)
    <d69>   DW_AT_byte_size   : 4
    <d6a>   DW_AT_decl_file   : 28
    <d6b>   DW_AT_decl_line   : 32
    <d6c>   DW_AT_decl_column : 9
    <d6d>   DW_AT_sibling     : <0xd8a>
 <2><d71>: Abbrev Number: 17 (DW_TAG_member)
    <d72>   DW_AT_name        : (indirect string, offset: 0x1384): __size
    <d76>   DW_AT_decl_file   : 28
    <d77>   DW_AT_decl_line   : 34
    <d78>   DW_AT_decl_column : 8
    <d79>   DW_AT_type        : <0x438>
 <2><d7d>: Abbrev Number: 17 (DW_TAG_member)
    <d7e>   DW_AT_name        : (indirect string, offset: 0x171d): __align
    <d82>   DW_AT_decl_file   : 28
    <d83>   DW_AT_decl_line   : 35
    <d84>   DW_AT_decl_column : 7
    <d85>   DW_AT_type        : <0x13d>
 <2><d89>: Abbrev Number: 0
 <1><d8a>: Abbrev Number: 2 (DW_TAG_typedef)
    <d8b>   DW_AT_name        : (indirect string, offset: 0x246e): pthread_mutexattr_t
    <d8f>   DW_AT_decl_file   : 28
    <d90>   DW_AT_decl_line   : 36
    <d91>   DW_AT_decl_column : 3
    <d92>   DW_AT_type        : <0xd68>
 <1><d96>: Abbrev Number: 16 (DW_TAG_union_type)
    <d97>   DW_AT_byte_size   : 4
    <d98>   DW_AT_decl_file   : 28
    <d99>   DW_AT_decl_line   : 41
    <d9a>   DW_AT_decl_column : 9
    <d9b>   DW_AT_sibling     : <0xdb8>
 <2><d9f>: Abbrev Number: 17 (DW_TAG_member)
    <da0>   DW_AT_name        : (indirect string, offset: 0x1384): __size
    <da4>   DW_AT_decl_file   : 28
    <da5>   DW_AT_decl_line   : 43
    <da6>   DW_AT_decl_column : 8
    <da7>   DW_AT_type        : <0x438>
 <2><dab>: Abbrev Number: 17 (DW_TAG_member)
    <dac>   DW_AT_name        : (indirect string, offset: 0x171d): __align
    <db0>   DW_AT_decl_file   : 28
    <db1>   DW_AT_decl_line   : 44
    <db2>   DW_AT_decl_column : 7
    <db3>   DW_AT_type        : <0x13d>
 <2><db7>: Abbrev Number: 0
 <1><db8>: Abbrev Number: 2 (DW_TAG_typedef)
    <db9>   DW_AT_name        : (indirect string, offset: 0xb79): pthread_condattr_t
    <dbd>   DW_AT_decl_file   : 28
    <dbe>   DW_AT_decl_line   : 45
    <dbf>   DW_AT_decl_column : 3
    <dc0>   DW_AT_type        : <0xd96>
 <1><dc4>: Abbrev Number: 2 (DW_TAG_typedef)
    <dc5>   DW_AT_name        : (indirect string, offset: 0x1639): pthread_key_t
    <dc9>   DW_AT_decl_file   : 28
    <dca>   DW_AT_decl_line   : 49
    <dcb>   DW_AT_decl_column : 22
    <dcc>   DW_AT_type        : <0xa2>
 <1><dd0>: Abbrev Number: 2 (DW_TAG_typedef)
    <dd1>   DW_AT_name        : (indirect string, offset: 0x15e3): pthread_once_t
    <dd5>   DW_AT_decl_file   : 28
    <dd6>   DW_AT_decl_line   : 53
    <dd7>   DW_AT_decl_column : 30
    <dd8>   DW_AT_type        : <0x13d>
 <1><ddc>: Abbrev Number: 25 (DW_TAG_union_type)
    <ddd>   DW_AT_name        : (indirect string, offset: 0x17ba): pthread_attr_t
    <de1>   DW_AT_byte_size   : 56
    <de2>   DW_AT_decl_file   : 28
    <de3>   DW_AT_decl_line   : 56
    <de4>   DW_AT_decl_column : 7
    <de5>   DW_AT_sibling     : <0xe02>
 <2><de9>: Abbrev Number: 17 (DW_TAG_member)
    <dea>   DW_AT_name        : (indirect string, offset: 0x1384): __size
    <dee>   DW_AT_decl_file   : 28
    <def>   DW_AT_decl_line   : 58
    <df0>   DW_AT_decl_column : 8
    <df1>   DW_AT_type        : <0xe02>
 <2><df5>: Abbrev Number: 17 (DW_TAG_member)
    <df6>   DW_AT_name        : (indirect string, offset: 0x171d): __align
    <dfa>   DW_AT_decl_file   : 28
    <dfb>   DW_AT_decl_line   : 59
    <dfc>   DW_AT_decl_column : 12
    <dfd>   DW_AT_type        : <0x166>
 <2><e01>: Abbrev Number: 0
 <1><e02>: Abbrev Number: 5 (DW_TAG_array_type)
    <e03>   DW_AT_type        : <0x3e6>
    <e07>   DW_AT_sibling     : <0xe12>
 <2><e0b>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <e0c>   DW_AT_type        : <0x39>
    <e10>   DW_AT_upper_bound : 55
 <2><e11>: Abbrev Number: 0
 <1><e12>: Abbrev Number: 2 (DW_TAG_typedef)
    <e13>   DW_AT_name        : (indirect string, offset: 0x17ba): pthread_attr_t
    <e17>   DW_AT_decl_file   : 28
    <e18>   DW_AT_decl_line   : 62
    <e19>   DW_AT_decl_column : 30
    <e1a>   DW_AT_type        : <0xddc>
 <1><e1e>: Abbrev Number: 16 (DW_TAG_union_type)
    <e1f>   DW_AT_byte_size   : 40
    <e20>   DW_AT_decl_file   : 28
    <e21>   DW_AT_decl_line   : 67
    <e22>   DW_AT_decl_column : 9
    <e23>   DW_AT_sibling     : <0xe4c>
 <2><e27>: Abbrev Number: 17 (DW_TAG_member)
    <e28>   DW_AT_name        : (indirect string, offset: 0x8f9): __data
    <e2c>   DW_AT_decl_file   : 28
    <e2d>   DW_AT_decl_line   : 69
    <e2e>   DW_AT_decl_column : 28
    <e2f>   DW_AT_type        : <0xaf3>
 <2><e33>: Abbrev Number: 17 (DW_TAG_member)
    <e34>   DW_AT_name        : (indirect string, offset: 0x1384): __size
    <e38>   DW_AT_decl_file   : 28
    <e39>   DW_AT_decl_line   : 70
    <e3a>   DW_AT_decl_column : 8
    <e3b>   DW_AT_type        : <0xe4c>
 <2><e3f>: Abbrev Number: 17 (DW_TAG_member)
    <e40>   DW_AT_name        : (indirect string, offset: 0x171d): __align
    <e44>   DW_AT_decl_file   : 28
    <e45>   DW_AT_decl_line   : 71
    <e46>   DW_AT_decl_column : 12
    <e47>   DW_AT_type        : <0x166>
 <2><e4b>: Abbrev Number: 0
 <1><e4c>: Abbrev Number: 5 (DW_TAG_array_type)
    <e4d>   DW_AT_type        : <0x3e6>
    <e51>   DW_AT_sibling     : <0xe5c>
 <2><e55>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <e56>   DW_AT_type        : <0x39>
    <e5a>   DW_AT_upper_bound : 39
 <2><e5b>: Abbrev Number: 0
 <1><e5c>: Abbrev Number: 2 (DW_TAG_typedef)
    <e5d>   DW_AT_name        : (indirect string, offset: 0x1842): pthread_mutex_t
    <e61>   DW_AT_decl_file   : 28
    <e62>   DW_AT_decl_line   : 72
    <e63>   DW_AT_decl_column : 3
    <e64>   DW_AT_type        : <0xe1e>
 <1><e68>: Abbrev Number: 16 (DW_TAG_union_type)
    <e69>   DW_AT_byte_size   : 48
    <e6a>   DW_AT_decl_file   : 28
    <e6b>   DW_AT_decl_line   : 75
    <e6c>   DW_AT_decl_column : 9
    <e6d>   DW_AT_sibling     : <0xe96>
 <2><e71>: Abbrev Number: 17 (DW_TAG_member)
    <e72>   DW_AT_name        : (indirect string, offset: 0x8f9): __data
    <e76>   DW_AT_decl_file   : 28
    <e77>   DW_AT_decl_line   : 77
    <e78>   DW_AT_decl_column : 27
    <e79>   DW_AT_type        : <0xcb6>
 <2><e7d>: Abbrev Number: 17 (DW_TAG_member)
    <e7e>   DW_AT_name        : (indirect string, offset: 0x1384): __size
    <e82>   DW_AT_decl_file   : 28
    <e83>   DW_AT_decl_line   : 78
    <e84>   DW_AT_decl_column : 8
    <e85>   DW_AT_type        : <0xe96>
 <2><e89>: Abbrev Number: 17 (DW_TAG_member)
    <e8a>   DW_AT_name        : (indirect string, offset: 0x171d): __align
    <e8e>   DW_AT_decl_file   : 28
    <e8f>   DW_AT_decl_line   : 79
    <e90>   DW_AT_decl_column : 31
    <e91>   DW_AT_type        : <0x7bf>
 <2><e95>: Abbrev Number: 0
 <1><e96>: Abbrev Number: 5 (DW_TAG_array_type)
    <e97>   DW_AT_type        : <0x3e6>
    <e9b>   DW_AT_sibling     : <0xea6>
 <2><e9f>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <ea0>   DW_AT_type        : <0x39>
    <ea4>   DW_AT_upper_bound : 47
 <2><ea5>: Abbrev Number: 0
 <1><ea6>: Abbrev Number: 2 (DW_TAG_typedef)
    <ea7>   DW_AT_name        : (indirect string, offset: 0x104): pthread_cond_t
    <eab>   DW_AT_decl_file   : 28
    <eac>   DW_AT_decl_line   : 80
    <ead>   DW_AT_decl_column : 3
    <eae>   DW_AT_type        : <0xe68>
 <1><eb2>: Abbrev Number: 16 (DW_TAG_union_type)
    <eb3>   DW_AT_byte_size   : 56
    <eb4>   DW_AT_decl_file   : 28
    <eb5>   DW_AT_decl_line   : 86
    <eb6>   DW_AT_decl_column : 9
    <eb7>   DW_AT_sibling     : <0xee0>
 <2><ebb>: Abbrev Number: 17 (DW_TAG_member)
    <ebc>   DW_AT_name        : (indirect string, offset: 0x8f9): __data
    <ec0>   DW_AT_decl_file   : 28
    <ec1>   DW_AT_decl_line   : 88
    <ec2>   DW_AT_decl_column : 34
    <ec3>   DW_AT_type        : <0xb69>
 <2><ec7>: Abbrev Number: 17 (DW_TAG_member)
    <ec8>   DW_AT_name        : (indirect string, offset: 0x1384): __size
    <ecc>   DW_AT_decl_file   : 28
    <ecd>   DW_AT_decl_line   : 89
    <ece>   DW_AT_decl_column : 8
    <ecf>   DW_AT_type        : <0xe02>
 <2><ed3>: Abbrev Number: 17 (DW_TAG_member)
    <ed4>   DW_AT_name        : (indirect string, offset: 0x171d): __align
    <ed8>   DW_AT_decl_file   : 28
    <ed9>   DW_AT_decl_line   : 90
    <eda>   DW_AT_decl_column : 12
    <edb>   DW_AT_type        : <0x166>
 <2><edf>: Abbrev Number: 0
 <1><ee0>: Abbrev Number: 2 (DW_TAG_typedef)
    <ee1>   DW_AT_name        : (indirect string, offset: 0x11d3): pthread_rwlock_t
    <ee5>   DW_AT_decl_file   : 28
    <ee6>   DW_AT_decl_line   : 91
    <ee7>   DW_AT_decl_column : 3
    <ee8>   DW_AT_type        : <0xeb2>
 <1><eec>: Abbrev Number: 16 (DW_TAG_union_type)
    <eed>   DW_AT_byte_size   : 8
    <eee>   DW_AT_decl_file   : 28
    <eef>   DW_AT_decl_line   : 93
    <ef0>   DW_AT_decl_column : 9
    <ef1>   DW_AT_sibling     : <0xf0e>
 <2><ef5>: Abbrev Number: 17 (DW_TAG_member)
    <ef6>   DW_AT_name        : (indirect string, offset: 0x1384): __size
    <efa>   DW_AT_decl_file   : 28
    <efb>   DW_AT_decl_line   : 95
    <efc>   DW_AT_decl_column : 8
    <efd>   DW_AT_type        : <0xf0e>
 <2><f01>: Abbrev Number: 17 (DW_TAG_member)
    <f02>   DW_AT_name        : (indirect string, offset: 0x171d): __align
    <f06>   DW_AT_decl_file   : 28
    <f07>   DW_AT_decl_line   : 96
    <f08>   DW_AT_decl_column : 12
    <f09>   DW_AT_type        : <0x166>
 <2><f0d>: Abbrev Number: 0
 <1><f0e>: Abbrev Number: 5 (DW_TAG_array_type)
    <f0f>   DW_AT_type        : <0x3e6>
    <f13>   DW_AT_sibling     : <0xf1e>
 <2><f17>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <f18>   DW_AT_type        : <0x39>
    <f1c>   DW_AT_upper_bound : 7
 <2><f1d>: Abbrev Number: 0
 <1><f1e>: Abbrev Number: 2 (DW_TAG_typedef)
    <f1f>   DW_AT_name        : (indirect string, offset: 0xa15): pthread_rwlockattr_t
    <f23>   DW_AT_decl_file   : 28
    <f24>   DW_AT_decl_line   : 97
    <f25>   DW_AT_decl_column : 3
    <f26>   DW_AT_type        : <0xeec>
 <1><f2a>: Abbrev Number: 2 (DW_TAG_typedef)
    <f2b>   DW_AT_name        : (indirect string, offset: 0x20f): pthread_spinlock_t
    <f2f>   DW_AT_decl_file   : 28
    <f30>   DW_AT_decl_line   : 103
    <f31>   DW_AT_decl_column : 22
    <f32>   DW_AT_type        : <0x144>
 <1><f36>: Abbrev Number: 16 (DW_TAG_union_type)
    <f37>   DW_AT_byte_size   : 32
    <f38>   DW_AT_decl_file   : 28
    <f39>   DW_AT_decl_line   : 108
    <f3a>   DW_AT_decl_column : 9
    <f3b>   DW_AT_sibling     : <0xf58>
 <2><f3f>: Abbrev Number: 17 (DW_TAG_member)
    <f40>   DW_AT_name        : (indirect string, offset: 0x1384): __size
    <f44>   DW_AT_decl_file   : 28
    <f45>   DW_AT_decl_line   : 110
    <f46>   DW_AT_decl_column : 8
    <f47>   DW_AT_type        : <0xf58>
 <2><f4b>: Abbrev Number: 17 (DW_TAG_member)
    <f4c>   DW_AT_name        : (indirect string, offset: 0x171d): __align
    <f50>   DW_AT_decl_file   : 28
    <f51>   DW_AT_decl_line   : 111
    <f52>   DW_AT_decl_column : 12
    <f53>   DW_AT_type        : <0x166>
 <2><f57>: Abbrev Number: 0
 <1><f58>: Abbrev Number: 5 (DW_TAG_array_type)
    <f59>   DW_AT_type        : <0x3e6>
    <f5d>   DW_AT_sibling     : <0xf68>
 <2><f61>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <f62>   DW_AT_type        : <0x39>
    <f66>   DW_AT_upper_bound : 31
 <2><f67>: Abbrev Number: 0
 <1><f68>: Abbrev Number: 2 (DW_TAG_typedef)
    <f69>   DW_AT_name        : (indirect string, offset: 0x2356): pthread_barrier_t
    <f6d>   DW_AT_decl_file   : 28
    <f6e>   DW_AT_decl_line   : 112
    <f6f>   DW_AT_decl_column : 3
    <f70>   DW_AT_type        : <0xf36>
 <1><f74>: Abbrev Number: 16 (DW_TAG_union_type)
    <f75>   DW_AT_byte_size   : 4
    <f76>   DW_AT_decl_file   : 28
    <f77>   DW_AT_decl_line   : 114
    <f78>   DW_AT_decl_column : 9
    <f79>   DW_AT_sibling     : <0xf96>
 <2><f7d>: Abbrev Number: 17 (DW_TAG_member)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x1384): __size
    <f82>   DW_AT_decl_file   : 28
    <f83>   DW_AT_decl_line   : 116
    <f84>   DW_AT_decl_column : 8
    <f85>   DW_AT_type        : <0x438>
 <2><f89>: Abbrev Number: 17 (DW_TAG_member)
    <f8a>   DW_AT_name        : (indirect string, offset: 0x171d): __align
    <f8e>   DW_AT_decl_file   : 28
    <f8f>   DW_AT_decl_line   : 117
    <f90>   DW_AT_decl_column : 7
    <f91>   DW_AT_type        : <0x13d>
 <2><f95>: Abbrev Number: 0
 <1><f96>: Abbrev Number: 2 (DW_TAG_typedef)
    <f97>   DW_AT_name        : (indirect string, offset: 0x2240): pthread_barrierattr_t
    <f9b>   DW_AT_decl_file   : 28
    <f9c>   DW_AT_decl_line   : 118
    <f9d>   DW_AT_decl_column : 3
    <f9e>   DW_AT_type        : <0xf74>
 <1><fa2>: Abbrev Number: 26 (DW_TAG_structure_type)
    <fa3>   DW_AT_name        : (indirect string, offset: 0x1a1b): random_data
    <fa7>   DW_AT_byte_size   : 48
    <fa8>   DW_AT_decl_file   : 13
    <fa9>   DW_AT_decl_line   : 423
    <fab>   DW_AT_decl_column : 8
    <fac>   DW_AT_sibling     : <0x1013>
 <2><fb0>: Abbrev Number: 27 (DW_TAG_member)
    <fb1>   DW_AT_name        : (indirect string, offset: 0x1991): fptr
    <fb5>   DW_AT_decl_file   : 13
    <fb6>   DW_AT_decl_line   : 425
    <fb8>   DW_AT_decl_column : 14
    <fb9>   DW_AT_type        : <0x1013>
    <fbd>   DW_AT_data_member_location: 0
 <2><fbe>: Abbrev Number: 27 (DW_TAG_member)
    <fbf>   DW_AT_name        : (indirect string, offset: 0x29db): rptr
    <fc3>   DW_AT_decl_file   : 13
    <fc4>   DW_AT_decl_line   : 426
    <fc6>   DW_AT_decl_column : 14
    <fc7>   DW_AT_type        : <0x1013>
    <fcb>   DW_AT_data_member_location: 8
 <2><fcc>: Abbrev Number: 27 (DW_TAG_member)
    <fcd>   DW_AT_name        : (indirect string, offset: 0x2484): state
    <fd1>   DW_AT_decl_file   : 13
    <fd2>   DW_AT_decl_line   : 427
    <fd4>   DW_AT_decl_column : 14
    <fd5>   DW_AT_type        : <0x1013>
    <fd9>   DW_AT_data_member_location: 16
 <2><fda>: Abbrev Number: 27 (DW_TAG_member)
    <fdb>   DW_AT_name        : (indirect string, offset: 0x15af): rand_type
    <fdf>   DW_AT_decl_file   : 13
    <fe0>   DW_AT_decl_line   : 428
    <fe2>   DW_AT_decl_column : 9
    <fe3>   DW_AT_type        : <0x13d>
    <fe7>   DW_AT_data_member_location: 24
 <2><fe8>: Abbrev Number: 27 (DW_TAG_member)
    <fe9>   DW_AT_name        : (indirect string, offset: 0xa2a): rand_deg
    <fed>   DW_AT_decl_file   : 13
    <fee>   DW_AT_decl_line   : 429
    <ff0>   DW_AT_decl_column : 9
    <ff1>   DW_AT_type        : <0x13d>
    <ff5>   DW_AT_data_member_location: 28
 <2><ff6>: Abbrev Number: 27 (DW_TAG_member)
    <ff7>   DW_AT_name        : (indirect string, offset: 0xbad): rand_sep
    <ffb>   DW_AT_decl_file   : 13
    <ffc>   DW_AT_decl_line   : 430
    <ffe>   DW_AT_decl_column : 9
    <fff>   DW_AT_type        : <0x13d>
    <1003>   DW_AT_data_member_location: 32
 <2><1004>: Abbrev Number: 27 (DW_TAG_member)
    <1005>   DW_AT_name        : (indirect string, offset: 0x1fb4): end_ptr
    <1009>   DW_AT_decl_file   : 13
    <100a>   DW_AT_decl_line   : 431
    <100c>   DW_AT_decl_column : 14
    <100d>   DW_AT_type        : <0x1013>
    <1011>   DW_AT_data_member_location: 40
 <2><1012>: Abbrev Number: 0
 <1><1013>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1014>   DW_AT_byte_size   : 8
    <1015>   DW_AT_type        : <0x922>
 <1><1019>: Abbrev Number: 26 (DW_TAG_structure_type)
    <101a>   DW_AT_name        : (indirect string, offset: 0x4cc): drand48_data
    <101e>   DW_AT_byte_size   : 24
    <101f>   DW_AT_decl_file   : 13
    <1020>   DW_AT_decl_line   : 490
    <1022>   DW_AT_decl_column : 8
    <1023>   DW_AT_sibling     : <0x106e>
 <2><1027>: Abbrev Number: 28 (DW_TAG_member)
    <1028>   DW_AT_name        : __x
    <102c>   DW_AT_decl_file   : 13
    <102d>   DW_AT_decl_line   : 492
    <102f>   DW_AT_decl_column : 24
    <1030>   DW_AT_type        : <0x106e>
    <1034>   DW_AT_data_member_location: 0
 <2><1035>: Abbrev Number: 27 (DW_TAG_member)
    <1036>   DW_AT_name        : (indirect string, offset: 0x158e): __old_x
    <103a>   DW_AT_decl_file   : 13
    <103b>   DW_AT_decl_line   : 493
    <103d>   DW_AT_decl_column : 24
    <103e>   DW_AT_type        : <0x106e>
    <1042>   DW_AT_data_member_location: 6
 <2><1043>: Abbrev Number: 28 (DW_TAG_member)
    <1044>   DW_AT_name        : __c
    <1048>   DW_AT_decl_file   : 13
    <1049>   DW_AT_decl_line   : 494
    <104b>   DW_AT_decl_column : 24
    <104c>   DW_AT_type        : <0xcf>
    <1050>   DW_AT_data_member_location: 12
 <2><1051>: Abbrev Number: 27 (DW_TAG_member)
    <1052>   DW_AT_name        : (indirect string, offset: 0x2653): __init
    <1056>   DW_AT_decl_file   : 13
    <1057>   DW_AT_decl_line   : 495
    <1059>   DW_AT_decl_column : 24
    <105a>   DW_AT_type        : <0xcf>
    <105e>   DW_AT_data_member_location: 14
