
binaries/O0/binaries_debug/dev-util/bsdiff-4.3-r4/bsdiff:     file format elf64-x86-64

Contents of the .eh_frame section:


00000000 0000000000000014 00000000 CIE
  Version:               1
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -8
  Return address column: 16
  Augmentation data:     1b
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_offset: r16 (rip) at cfa-8
  DW_CFA_undefined: r16 (rip)

00000018 0000000000000014 0000001c FDE cie=00000000 pc=0000000000001170..0000000000001192
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000030 0000000000000014 00000000 CIE
  Version:               1
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -8
  Return address column: 16
  Augmentation data:     1b
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_offset: r16 (rip) at cfa-8
  DW_CFA_nop
  DW_CFA_nop

00000048 0000000000000024 0000001c FDE cie=00000030 pc=0000000000001020..0000000000001160
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 6 to 0000000000001026
  DW_CFA_def_cfa_offset: 24
  DW_CFA_advance_loc: 10 to 0000000000001030
  DW_CFA_def_cfa_expression (DW_OP_breg7 (rsp): 8; DW_OP_breg16 (rip): 0; DW_OP_lit15; DW_OP_and; DW_OP_lit11; DW_OP_ge; DW_OP_lit3; DW_OP_shl; DW_OP_plus)
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000070 0000000000000014 00000044 FDE cie=00000030 pc=0000000000001160..0000000000001168
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

    <111>   DW_AT_name        : (indirect string, offset: 0x17bc): __uint_least8_t
    <115>   DW_AT_decl_file   : 2
    <116>   DW_AT_decl_line   : 53
    <117>   DW_AT_decl_column : 19
    <118>   DW_AT_type        : <0x91>
 <1><11c>: Abbrev Number: 2 (DW_TAG_typedef)
    <11d>   DW_AT_name        : (indirect string, offset: 0x13fd): __int_least16_t
    <121>   DW_AT_decl_file   : 2
    <122>   DW_AT_decl_line   : 54
    <123>   DW_AT_decl_column : 19
    <124>   DW_AT_type        : <0x9d>
 <1><128>: Abbrev Number: 2 (DW_TAG_typedef)
    <129>   DW_AT_name        : (indirect string, offset: 0x1b93): __uint_least16_t
    <12d>   DW_AT_decl_file   : 2
    <12e>   DW_AT_decl_line   : 55
    <12f>   DW_AT_decl_column : 20
    <130>   DW_AT_type        : <0xb0>
 <1><134>: Abbrev Number: 2 (DW_TAG_typedef)
    <135>   DW_AT_name        : (indirect string, offset: 0x54e): __int_least32_t
    <139>   DW_AT_decl_file   : 2
    <13a>   DW_AT_decl_line   : 56
    <13b>   DW_AT_decl_column : 19
    <13c>   DW_AT_type        : <0xbc>
 <1><140>: Abbrev Number: 2 (DW_TAG_typedef)
    <141>   DW_AT_name        : (indirect string, offset: 0xc8b): __uint_least32_t
    <145>   DW_AT_decl_file   : 2
    <146>   DW_AT_decl_line   : 57
    <147>   DW_AT_decl_column : 20
    <148>   DW_AT_type        : <0xd9>
 <1><14c>: Abbrev Number: 2 (DW_TAG_typedef)
    <14d>   DW_AT_name        : (indirect string, offset: 0x1799): __int_least64_t
    <151>   DW_AT_decl_file   : 2
    <152>   DW_AT_decl_line   : 58
    <153>   DW_AT_decl_column : 19
    <154>   DW_AT_type        : <0xe5>
 <1><158>: Abbrev Number: 2 (DW_TAG_typedef)
    <159>   DW_AT_name        : (indirect string, offset: 0x1e3b): __uint_least64_t
    <15d>   DW_AT_decl_file   : 2
    <15e>   DW_AT_decl_line   : 59
    <15f>   DW_AT_decl_column : 20
    <160>   DW_AT_type        : <0xf8>
 <1><164>: Abbrev Number: 2 (DW_TAG_typedef)
    <165>   DW_AT_name        : (indirect string, offset: 0x13d5): __quad_t
    <169>   DW_AT_decl_file   : 2
    <16a>   DW_AT_decl_line   : 63
    <16b>   DW_AT_decl_column : 18
    <16c>   DW_AT_type        : <0xf1>
 <1><170>: Abbrev Number: 2 (DW_TAG_typedef)
    <171>   DW_AT_name        : (indirect string, offset: 0x55e): __u_quad_t
    <175>   DW_AT_decl_file   : 2
    <176>   DW_AT_decl_line   : 64
    <177>   DW_AT_decl_column : 27
    <178>   DW_AT_type        : <0x77>
 <1><17c>: Abbrev Number: 2 (DW_TAG_typedef)
    <17d>   DW_AT_name        : (indirect string, offset: 0x1692): __intmax_t
    <181>   DW_AT_decl_file   : 2
    <182>   DW_AT_decl_line   : 72
    <183>   DW_AT_decl_column : 18
    <184>   DW_AT_type        : <0xf1>
 <1><188>: Abbrev Number: 2 (DW_TAG_typedef)
    <189>   DW_AT_name        : (indirect string, offset: 0x491): __uintmax_t
    <18d>   DW_AT_decl_file   : 2
    <18e>   DW_AT_decl_line   : 73
    <18f>   DW_AT_decl_column : 27
    <190>   DW_AT_type        : <0x77>
 <1><194>: Abbrev Number: 2 (DW_TAG_typedef)
    <195>   DW_AT_name        : (indirect string, offset: 0x11f3): __dev_t
    <199>   DW_AT_decl_file   : 2
    <19a>   DW_AT_decl_line   : 145
    <19b>   DW_AT_decl_column : 25
    <19c>   DW_AT_type        : <0x77>
 <1><1a0>: Abbrev Number: 2 (DW_TAG_typedef)
    <1a1>   DW_AT_name        : (indirect string, offset: 0x1aed): __uid_t
    <1a5>   DW_AT_decl_file   : 2
    <1a6>   DW_AT_decl_line   : 146
    <1a7>   DW_AT_decl_column : 25
    <1a8>   DW_AT_type        : <0x64>
 <1><1ac>: Abbrev Number: 2 (DW_TAG_typedef)
    <1ad>   DW_AT_name        : (indirect string, offset: 0x16ba): __gid_t
    <1b1>   DW_AT_decl_file   : 2
    <1b2>   DW_AT_decl_line   : 147
    <1b3>   DW_AT_decl_column : 25
    <1b4>   DW_AT_type        : <0x64>
 <1><1b8>: Abbrev Number: 2 (DW_TAG_typedef)
    <1b9>   DW_AT_name        : (indirect string, offset: 0x6c3): __ino_t
    <1bd>   DW_AT_decl_file   : 2
    <1be>   DW_AT_decl_line   : 148
    <1bf>   DW_AT_decl_column : 25
    <1c0>   DW_AT_type        : <0x77>
 <1><1c4>: Abbrev Number: 2 (DW_TAG_typedef)
    <1c5>   DW_AT_name        : (indirect string, offset: 0x183a): __ino64_t
    <1c9>   DW_AT_decl_file   : 2
    <1ca>   DW_AT_decl_line   : 149
    <1cb>   DW_AT_decl_column : 27
    <1cc>   DW_AT_type        : <0x77>
 <1><1d0>: Abbrev Number: 2 (DW_TAG_typedef)
    <1d1>   DW_AT_name        : (indirect string, offset: 0xc3a): __mode_t
    <1d5>   DW_AT_decl_file   : 2
    <1d6>   DW_AT_decl_line   : 150
    <1d7>   DW_AT_decl_column : 26
    <1d8>   DW_AT_type        : <0x64>
 <1><1dc>: Abbrev Number: 2 (DW_TAG_typedef)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x515): __nlink_t
    <1e1>   DW_AT_decl_file   : 2
    <1e2>   DW_AT_decl_line   : 151
    <1e3>   DW_AT_decl_column : 27
    <1e4>   DW_AT_type        : <0x77>
 <1><1e8>: Abbrev Number: 2 (DW_TAG_typedef)
    <1e9>   DW_AT_name        : (indirect string, offset: 0x1fa7): __off_t
    <1ed>   DW_AT_decl_file   : 2
    <1ee>   DW_AT_decl_line   : 152
    <1ef>   DW_AT_decl_column : 25
    <1f0>   DW_AT_type        : <0xf1>
 <1><1f4>: Abbrev Number: 2 (DW_TAG_typedef)
    <1f5>   DW_AT_name        : (indirect string, offset: 0x2339): __off64_t
    <1f9>   DW_AT_decl_file   : 2
    <1fa>   DW_AT_decl_line   : 153
    <1fb>   DW_AT_decl_column : 27
    <1fc>   DW_AT_type        : <0xf1>
 <1><200>: Abbrev Number: 2 (DW_TAG_typedef)
    <201>   DW_AT_name        : (indirect string, offset: 0x1184): __pid_t
    <205>   DW_AT_decl_file   : 2
    <206>   DW_AT_decl_line   : 154
    <207>   DW_AT_decl_column : 25
    <208>   DW_AT_type        : <0xc8>
 <1><20c>: Abbrev Number: 7 (DW_TAG_structure_type)
    <20d>   DW_AT_byte_size   : 8
    <20e>   DW_AT_decl_file   : 2
    <20f>   DW_AT_decl_line   : 155
    <210>   DW_AT_decl_column : 12
    <211>   DW_AT_sibling     : <0x223>
 <2><215>: Abbrev Number: 8 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x20d4): __val
    <21a>   DW_AT_decl_file   : 2
    <21b>   DW_AT_decl_line   : 155
    <21c>   DW_AT_decl_column : 12
    <21d>   DW_AT_type        : <0x223>
    <221>   DW_AT_data_member_location: 0
 <2><222>: Abbrev Number: 0
 <1><223>: Abbrev Number: 9 (DW_TAG_array_type)
    <224>   DW_AT_type        : <0xc8>
    <228>   DW_AT_sibling     : <0x233>
 <2><22c>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <22d>   DW_AT_type        : <0x77>
    <231>   DW_AT_upper_bound : 1
 <2><232>: Abbrev Number: 0
 <1><233>: Abbrev Number: 2 (DW_TAG_typedef)
    <234>   DW_AT_name        : (indirect string, offset: 0x63d): __fsid_t
    <238>   DW_AT_decl_file   : 2
    <239>   DW_AT_decl_line   : 155
    <23a>   DW_AT_decl_column : 26
    <23b>   DW_AT_type        : <0x20c>
 <1><23f>: Abbrev Number: 2 (DW_TAG_typedef)
    <240>   DW_AT_name        : (indirect string, offset: 0x14f4): __clock_t
    <244>   DW_AT_decl_file   : 2
    <245>   DW_AT_decl_line   : 156
    <246>   DW_AT_decl_column : 27
    <247>   DW_AT_type        : <0xf1>
 <1><24b>: Abbrev Number: 2 (DW_TAG_typedef)
    <24c>   DW_AT_name        : (indirect string, offset: 0x10e6): __rlim_t
    <250>   DW_AT_decl_file   : 2
    <251>   DW_AT_decl_line   : 157
    <252>   DW_AT_decl_column : 26
    <253>   DW_AT_type        : <0x77>
 <1><257>: Abbrev Number: 2 (DW_TAG_typedef)
    <258>   DW_AT_name        : (indirect string, offset: 0xe4e): __rlim64_t
    <25c>   DW_AT_decl_file   : 2
    <25d>   DW_AT_decl_line   : 158
    <25e>   DW_AT_decl_column : 28
    <25f>   DW_AT_type        : <0x77>
 <1><263>: Abbrev Number: 2 (DW_TAG_typedef)
    <264>   DW_AT_name        : (indirect string, offset: 0x10b9): __id_t
    <268>   DW_AT_decl_file   : 2
    <269>   DW_AT_decl_line   : 159
    <26a>   DW_AT_decl_column : 24
    <26b>   DW_AT_type        : <0x64>
 <1><26f>: Abbrev Number: 2 (DW_TAG_typedef)
    <270>   DW_AT_name        : (indirect string, offset: 0x1e71): __time_t
    <274>   DW_AT_decl_file   : 2
    <275>   DW_AT_decl_line   : 160
    <276>   DW_AT_decl_column : 26
    <277>   DW_AT_type        : <0xf1>
 <1><27b>: Abbrev Number: 2 (DW_TAG_typedef)
    <27c>   DW_AT_name        : (indirect string, offset: 0x871): __useconds_t
    <280>   DW_AT_decl_file   : 2
    <281>   DW_AT_decl_line   : 161
    <282>   DW_AT_decl_column : 30
    <283>   DW_AT_type        : <0x64>
 <1><287>: Abbrev Number: 2 (DW_TAG_typedef)
    <288>   DW_AT_name        : (indirect string, offset: 0x1e12): __suseconds_t
    <28c>   DW_AT_decl_file   : 2
    <28d>   DW_AT_decl_line   : 162
    <28e>   DW_AT_decl_column : 31
    <28f>   DW_AT_type        : <0xf1>
 <1><293>: Abbrev Number: 2 (DW_TAG_typedef)
    <294>   DW_AT_name        : (indirect string, offset: 0x57f): __suseconds64_t
    <298>   DW_AT_decl_file   : 2
    <299>   DW_AT_decl_line   : 163
    <29a>   DW_AT_decl_column : 33
    <29b>   DW_AT_type        : <0xf1>
 <1><29f>: Abbrev Number: 2 (DW_TAG_typedef)
    <2a0>   DW_AT_name        : (indirect string, offset: 0x1a59): __daddr_t
    <2a4>   DW_AT_decl_file   : 2
    <2a5>   DW_AT_decl_line   : 165
    <2a6>   DW_AT_decl_column : 27
    <2a7>   DW_AT_type        : <0xc8>
 <1><2ab>: Abbrev Number: 2 (DW_TAG_typedef)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x9f5): __key_t
    <2b0>   DW_AT_decl_file   : 2
    <2b1>   DW_AT_decl_line   : 166
    <2b2>   DW_AT_decl_column : 25
    <2b3>   DW_AT_type        : <0xc8>
 <1><2b7>: Abbrev Number: 2 (DW_TAG_typedef)
    <2b8>   DW_AT_name        : (indirect string, offset: 0x188b): __clockid_t
    <2bc>   DW_AT_decl_file   : 2
    <2bd>   DW_AT_decl_line   : 169
    <2be>   DW_AT_decl_column : 29
    <2bf>   DW_AT_type        : <0xc8>
 <1><2c3>: Abbrev Number: 2 (DW_TAG_typedef)
    <2c4>   DW_AT_name        : (indirect string, offset: 0x1f24): __timer_t
    <2c8>   DW_AT_decl_file   : 2
    <2c9>   DW_AT_decl_line   : 172
    <2ca>   DW_AT_decl_column : 27
    <2cb>   DW_AT_type        : <0x2cf>
 <1><2cf>: Abbrev Number: 11 (DW_TAG_pointer_type)
    <2d0>   DW_AT_byte_size   : 8
 <1><2d1>: Abbrev Number: 2 (DW_TAG_typedef)
    <2d2>   DW_AT_name        : (indirect string, offset: 0x1a4d): __blksize_t
    <2d6>   DW_AT_decl_file   : 2
    <2d7>   DW_AT_decl_line   : 175
    <2d8>   DW_AT_decl_column : 29
    <2d9>   DW_AT_type        : <0xf1>
 <1><2dd>: Abbrev Number: 2 (DW_TAG_typedef)
    <2de>   DW_AT_name        : (indirect string, offset: 0x218a): __blkcnt_t
    <2e2>   DW_AT_decl_file   : 2
    <2e3>   DW_AT_decl_line   : 180
    <2e4>   DW_AT_decl_column : 28
    <2e5>   DW_AT_type        : <0xf1>
 <1><2e9>: Abbrev Number: 2 (DW_TAG_typedef)
    <2ea>   DW_AT_name        : (indirect string, offset: 0x1825): __blkcnt64_t
    <2ee>   DW_AT_decl_file   : 2
    <2ef>   DW_AT_decl_line   : 181
    <2f0>   DW_AT_decl_column : 30
    <2f1>   DW_AT_type        : <0xf1>
 <1><2f5>: Abbrev Number: 2 (DW_TAG_typedef)
    <2f6>   DW_AT_name        : (indirect string, offset: 0x82b): __fsblkcnt_t
    <2fa>   DW_AT_decl_file   : 2
    <2fb>   DW_AT_decl_line   : 184
    <2fc>   DW_AT_decl_column : 30
    <2fd>   DW_AT_type        : <0x77>
 <1><301>: Abbrev Number: 2 (DW_TAG_typedef)
    <302>   DW_AT_name        : (indirect string, offset: 0x352): __fsblkcnt64_t
    <306>   DW_AT_decl_file   : 2
    <307>   DW_AT_decl_line   : 185
    <308>   DW_AT_decl_column : 32
    <309>   DW_AT_type        : <0x77>
 <1><30d>: Abbrev Number: 2 (DW_TAG_typedef)
    <30e>   DW_AT_name        : (indirect string, offset: 0x1396): __fsfilcnt_t
    <312>   DW_AT_decl_file   : 2
    <313>   DW_AT_decl_line   : 188
    <314>   DW_AT_decl_column : 30
    <315>   DW_AT_type        : <0x77>
 <1><319>: Abbrev Number: 2 (DW_TAG_typedef)
    <31a>   DW_AT_name        : (indirect string, offset: 0x11ad): __fsfilcnt64_t
    <31e>   DW_AT_decl_file   : 2
    <31f>   DW_AT_decl_line   : 189
    <320>   DW_AT_decl_column : 32
    <321>   DW_AT_type        : <0x77>
 <1><325>: Abbrev Number: 2 (DW_TAG_typedef)
    <326>   DW_AT_name        : (indirect string, offset: 0xb57): __fsword_t
    <32a>   DW_AT_decl_file   : 2
    <32b>   DW_AT_decl_line   : 192
    <32c>   DW_AT_decl_column : 28
    <32d>   DW_AT_type        : <0xf1>
 <1><331>: Abbrev Number: 2 (DW_TAG_typedef)
    <332>   DW_AT_name        : (indirect string, offset: 0x1aa4): __ssize_t
    <336>   DW_AT_decl_file   : 2
    <337>   DW_AT_decl_line   : 194
    <338>   DW_AT_decl_column : 27
    <339>   DW_AT_type        : <0xf1>
 <1><33d>: Abbrev Number: 2 (DW_TAG_typedef)
    <33e>   DW_AT_name        : (indirect string, offset: 0x132d): __syscall_slong_t
    <342>   DW_AT_decl_file   : 2
    <343>   DW_AT_decl_line   : 197
    <344>   DW_AT_decl_column : 33
    <345>   DW_AT_type        : <0xf1>
 <1><349>: Abbrev Number: 2 (DW_TAG_typedef)
    <34a>   DW_AT_name        : (indirect string, offset: 0x17cc): __syscall_ulong_t
    <34e>   DW_AT_decl_file   : 2
    <34f>   DW_AT_decl_line   : 199
    <350>   DW_AT_decl_column : 33
    <351>   DW_AT_type        : <0x77>
 <1><355>: Abbrev Number: 2 (DW_TAG_typedef)
    <356>   DW_AT_name        : (indirect string, offset: 0x94b): __loff_t
    <35a>   DW_AT_decl_file   : 2
    <35b>   DW_AT_decl_line   : 203
    <35c>   DW_AT_decl_column : 19
    <35d>   DW_AT_type        : <0x1f4>
 <1><361>: Abbrev Number: 2 (DW_TAG_typedef)
    <362>   DW_AT_name        : (indirect string, offset: 0x663): __caddr_t
    <366>   DW_AT_decl_file   : 2
    <367>   DW_AT_decl_line   : 204
    <368>   DW_AT_decl_column : 15
    <369>   DW_AT_type        : <0x36d>
 <1><36d>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <36e>   DW_AT_byte_size   : 8
    <36f>   DW_AT_type        : <0x373>
 <1><373>: Abbrev Number: 3 (DW_TAG_base_type)
    <374>   DW_AT_byte_size   : 1
    <375>   DW_AT_encoding    : 6	(signed char)
    <376>   DW_AT_name        : (indirect string, offset: 0x1d2b): char
 <1><37a>: Abbrev Number: 4 (DW_TAG_const_type)
    <37b>   DW_AT_type        : <0x373>
 <1><37f>: Abbrev Number: 2 (DW_TAG_typedef)
    <380>   DW_AT_name        : (indirect string, offset: 0x632): __intptr_t
    <384>   DW_AT_decl_file   : 2
    <385>   DW_AT_decl_line   : 207
    <386>   DW_AT_decl_column : 25
    <387>   DW_AT_type        : <0xf1>
 <1><38b>: Abbrev Number: 2 (DW_TAG_typedef)
    <38c>   DW_AT_name        : (indirect string, offset: 0x1d8a): __socklen_t
    <390>   DW_AT_decl_file   : 2
    <391>   DW_AT_decl_line   : 210
    <392>   DW_AT_decl_column : 23
    <393>   DW_AT_type        : <0x64>
 <1><397>: Abbrev Number: 2 (DW_TAG_typedef)
    <398>   DW_AT_name        : (indirect string, offset: 0x18ab): __sig_atomic_t
    <39c>   DW_AT_decl_file   : 2
    <39d>   DW_AT_decl_line   : 215
    <39e>   DW_AT_decl_column : 13
    <39f>   DW_AT_type        : <0xc8>
 <1><3a3>: Abbrev Number: 2 (DW_TAG_typedef)
    <3a4>   DW_AT_name        : (indirect string, offset: 0x138f): u_char
    <3a8>   DW_AT_decl_file   : 3
    <3a9>   DW_AT_decl_line   : 33
    <3aa>   DW_AT_decl_column : 18
    <3ab>   DW_AT_type        : <0x2d>
 <1><3af>: Abbrev Number: 2 (DW_TAG_typedef)
    <3b0>   DW_AT_name        : (indirect string, offset: 0x214e): u_short
    <3b4>   DW_AT_decl_file   : 3
    <3b5>   DW_AT_decl_line   : 34
    <3b6>   DW_AT_decl_column : 19
    <3b7>   DW_AT_type        : <0x40>
 <1><3bb>: Abbrev Number: 2 (DW_TAG_typedef)
    <3bc>   DW_AT_name        : (indirect string, offset: 0x1349): u_int
    <3c0>   DW_AT_decl_file   : 3
    <3c1>   DW_AT_decl_line   : 35
    <3c2>   DW_AT_decl_column : 17
    <3c3>   DW_AT_type        : <0x58>
 <1><3c7>: Abbrev Number: 2 (DW_TAG_typedef)
    <3c8>   DW_AT_name        : (indirect string, offset: 0xd1a): u_long
    <3cc>   DW_AT_decl_file   : 3
    <3cd>   DW_AT_decl_line   : 36
    <3ce>   DW_AT_decl_column : 18
    <3cf>   DW_AT_type        : <0x6b>
 <1><3d3>: Abbrev Number: 2 (DW_TAG_typedef)
    <3d4>   DW_AT_name        : (indirect string, offset: 0x13d7): quad_t
    <3d8>   DW_AT_decl_file   : 3
    <3d9>   DW_AT_decl_line   : 37
    <3da>   DW_AT_decl_column : 18
    <3db>   DW_AT_type        : <0x164>
 <1><3df>: Abbrev Number: 2 (DW_TAG_typedef)
    <3e0>   DW_AT_name        : (indirect string, offset: 0x560): u_quad_t
    <3e4>   DW_AT_decl_file   : 3
    <3e5>   DW_AT_decl_line   : 38
    <3e6>   DW_AT_decl_column : 20
    <3e7>   DW_AT_type        : <0x170>
 <1><3eb>: Abbrev Number: 2 (DW_TAG_typedef)
    <3ec>   DW_AT_name        : (indirect string, offset: 0x63f): fsid_t
    <3f0>   DW_AT_decl_file   : 3
    <3f1>   DW_AT_decl_line   : 39
    <3f2>   DW_AT_decl_column : 18
    <3f3>   DW_AT_type        : <0x233>
 <1><3f7>: Abbrev Number: 2 (DW_TAG_typedef)
    <3f8>   DW_AT_name        : (indirect string, offset: 0x94d): loff_t
    <3fc>   DW_AT_decl_file   : 3
    <3fd>   DW_AT_decl_line   : 42
    <3fe>   DW_AT_decl_column : 18
    <3ff>   DW_AT_type        : <0x355>
 <1><403>: Abbrev Number: 2 (DW_TAG_typedef)
    <404>   DW_AT_name        : (indirect string, offset: 0x6c5): ino_t
    <408>   DW_AT_decl_file   : 3
    <409>   DW_AT_decl_line   : 49
    <40a>   DW_AT_decl_column : 19
    <40b>   DW_AT_type        : <0x1c4>
 <1><40f>: Abbrev Number: 2 (DW_TAG_typedef)
    <410>   DW_AT_name        : (indirect string, offset: 0x183c): ino64_t
    <414>   DW_AT_decl_file   : 3
    <415>   DW_AT_decl_line   : 54
    <416>   DW_AT_decl_column : 19
    <417>   DW_AT_type        : <0x1c4>
 <1><41b>: Abbrev Number: 2 (DW_TAG_typedef)
    <41c>   DW_AT_name        : (indirect string, offset: 0x11f5): dev_t
    <420>   DW_AT_decl_file   : 3
    <421>   DW_AT_decl_line   : 59
    <422>   DW_AT_decl_column : 17
    <423>   DW_AT_type        : <0x194>
 <1><427>: Abbrev Number: 2 (DW_TAG_typedef)
    <428>   DW_AT_name        : (indirect string, offset: 0x16bc): gid_t
    <42c>   DW_AT_decl_file   : 3
    <42d>   DW_AT_decl_line   : 64
    <42e>   DW_AT_decl_column : 17
    <42f>   DW_AT_type        : <0x1ac>
 <1><433>: Abbrev Number: 2 (DW_TAG_typedef)
    <434>   DW_AT_name        : (indirect string, offset: 0xc3c): mode_t
    <438>   DW_AT_decl_file   : 3
    <439>   DW_AT_decl_line   : 69
    <43a>   DW_AT_decl_column : 18
    <43b>   DW_AT_type        : <0x1d0>
 <1><43f>: Abbrev Number: 2 (DW_TAG_typedef)
    <440>   DW_AT_name        : (indirect string, offset: 0x517): nlink_t
    <444>   DW_AT_decl_file   : 3
    <445>   DW_AT_decl_line   : 74
    <446>   DW_AT_decl_column : 19
    <447>   DW_AT_type        : <0x1dc>
 <1><44b>: Abbrev Number: 2 (DW_TAG_typedef)
    <44c>   DW_AT_name        : (indirect string, offset: 0x1aef): uid_t
    <450>   DW_AT_decl_file   : 3
    <451>   DW_AT_decl_line   : 79
    <452>   DW_AT_decl_column : 17
    <453>   DW_AT_type        : <0x1a0>
 <1><457>: Abbrev Number: 2 (DW_TAG_typedef)
    <458>   DW_AT_name        : (indirect string, offset: 0x1fa9): off_t
    <45c>   DW_AT_decl_file   : 3
    <45d>   DW_AT_decl_line   : 87
    <45e>   DW_AT_decl_column : 19
    <45f>   DW_AT_type        : <0x1f4>
 <1><463>: Abbrev Number: 2 (DW_TAG_typedef)
    <464>   DW_AT_name        : (indirect string, offset: 0x233b): off64_t
    <468>   DW_AT_decl_file   : 3
    <469>   DW_AT_decl_line   : 92
    <46a>   DW_AT_decl_column : 19
    <46b>   DW_AT_type        : <0x1f4>
 <1><46f>: Abbrev Number: 2 (DW_TAG_typedef)
    <470>   DW_AT_name        : (indirect string, offset: 0x1186): pid_t
    <474>   DW_AT_decl_file   : 3
    <475>   DW_AT_decl_line   : 97
    <476>   DW_AT_decl_column : 17
    <477>   DW_AT_type        : <0x200>
 <1><47b>: Abbrev Number: 2 (DW_TAG_typedef)
    <47c>   DW_AT_name        : (indirect string, offset: 0x10bb): id_t
    <480>   DW_AT_decl_file   : 3
    <481>   DW_AT_decl_line   : 103
    <482>   DW_AT_decl_column : 16
    <483>   DW_AT_type        : <0x263>
 <1><487>: Abbrev Number: 2 (DW_TAG_typedef)
    <488>   DW_AT_name        : (indirect string, offset: 0x1aa6): ssize_t
    <48c>   DW_AT_decl_file   : 3
    <48d>   DW_AT_decl_line   : 108
    <48e>   DW_AT_decl_column : 19
    <48f>   DW_AT_type        : <0x331>
 <1><493>: Abbrev Number: 2 (DW_TAG_typedef)
    <494>   DW_AT_name        : (indirect string, offset: 0x1a5b): daddr_t
    <498>   DW_AT_decl_file   : 3
    <499>   DW_AT_decl_line   : 114
    <49a>   DW_AT_decl_column : 19
    <49b>   DW_AT_type        : <0x29f>
 <1><49f>: Abbrev Number: 2 (DW_TAG_typedef)
    <4a0>   DW_AT_name        : (indirect string, offset: 0x665): caddr_t
    <4a4>   DW_AT_decl_file   : 3
    <4a5>   DW_AT_decl_line   : 115
    <4a6>   DW_AT_decl_column : 19
    <4a7>   DW_AT_type        : <0x361>
 <1><4ab>: Abbrev Number: 2 (DW_TAG_typedef)
    <4ac>   DW_AT_name        : (indirect string, offset: 0x9f7): key_t
    <4b0>   DW_AT_decl_file   : 3
    <4b1>   DW_AT_decl_line   : 121
    <4b2>   DW_AT_decl_column : 17
    <4b3>   DW_AT_type        : <0x2ab>
 <1><4b7>: Abbrev Number: 2 (DW_TAG_typedef)
    <4b8>   DW_AT_name        : (indirect string, offset: 0x14f6): clock_t
    <4bc>   DW_AT_decl_file   : 4
    <4bd>   DW_AT_decl_line   : 7
    <4be>   DW_AT_decl_column : 19
    <4bf>   DW_AT_type        : <0x23f>
 <1><4c3>: Abbrev Number: 2 (DW_TAG_typedef)
    <4c4>   DW_AT_name        : (indirect string, offset: 0x188d): clockid_t
    <4c8>   DW_AT_decl_file   : 5
    <4c9>   DW_AT_decl_line   : 7
    <4ca>   DW_AT_decl_column : 21
    <4cb>   DW_AT_type        : <0x2b7>
 <1><4cf>: Abbrev Number: 2 (DW_TAG_typedef)
    <4d0>   DW_AT_name        : (indirect string, offset: 0x1e73): time_t
    <4d4>   DW_AT_decl_file   : 6
    <4d5>   DW_AT_decl_line   : 10
    <4d6>   DW_AT_decl_column : 18
    <4d7>   DW_AT_type        : <0x26f>
 <1><4db>: Abbrev Number: 2 (DW_TAG_typedef)
    <4dc>   DW_AT_name        : (indirect string, offset: 0x1f26): timer_t
    <4e0>   DW_AT_decl_file   : 7
    <4e1>   DW_AT_decl_line   : 7
    <4e2>   DW_AT_decl_column : 19
    <4e3>   DW_AT_type        : <0x2c3>
 <1><4e7>: Abbrev Number: 2 (DW_TAG_typedef)
    <4e8>   DW_AT_name        : (indirect string, offset: 0x1a52): size_t
    <4ec>   DW_AT_decl_file   : 8
    <4ed>   DW_AT_decl_line   : 209
    <4ee>   DW_AT_decl_column : 23
    <4ef>   DW_AT_type        : <0x77>
 <1><4f3>: Abbrev Number: 2 (DW_TAG_typedef)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x1a14): ulong
    <4f8>   DW_AT_decl_file   : 3
    <4f9>   DW_AT_decl_line   : 148
    <4fa>   DW_AT_decl_column : 27
    <4fb>   DW_AT_type        : <0x77>
 <1><4ff>: Abbrev Number: 2 (DW_TAG_typedef)
    <500>   DW_AT_name        : (indirect string, offset: 0xfbb): ushort
    <504>   DW_AT_decl_file   : 3
    <505>   DW_AT_decl_line   : 149
    <506>   DW_AT_decl_column : 28
    <507>   DW_AT_type        : <0x4c>
 <1><50b>: Abbrev Number: 2 (DW_TAG_typedef)
    <50c>   DW_AT_name        : (indirect string, offset: 0x2156): uint
    <510>   DW_AT_decl_file   : 3
    <511>   DW_AT_decl_line   : 150
    <512>   DW_AT_decl_column : 22
    <513>   DW_AT_type        : <0x64>
 <1><517>: Abbrev Number: 2 (DW_TAG_typedef)
    <518>   DW_AT_name        : (indirect string, offset: 0x15b1): int8_t
    <51c>   DW_AT_decl_file   : 9
    <51d>   DW_AT_decl_line   : 24
    <51e>   DW_AT_decl_column : 18
    <51f>   DW_AT_type        : <0x7e>
 <1><523>: Abbrev Number: 2 (DW_TAG_typedef)
    <524>   DW_AT_name        : (indirect string, offset: 0x12de): int16_t
    <528>   DW_AT_decl_file   : 9
    <529>   DW_AT_decl_line   : 25
    <52a>   DW_AT_decl_column : 19
    <52b>   DW_AT_type        : <0x9d>
 <1><52f>: Abbrev Number: 2 (DW_TAG_typedef)
    <530>   DW_AT_name        : (indirect string, offset: 0xf2a): int32_t
    <534>   DW_AT_decl_file   : 9
    <535>   DW_AT_decl_line   : 26
    <536>   DW_AT_decl_column : 19
    <537>   DW_AT_type        : <0xbc>
 <1><53b>: Abbrev Number: 2 (DW_TAG_typedef)
    <53c>   DW_AT_name        : (indirect string, offset: 0x165f): int64_t
    <540>   DW_AT_decl_file   : 9
    <541>   DW_AT_decl_line   : 27
    <542>   DW_AT_decl_column : 19
    <543>   DW_AT_type        : <0xe5>
 <1><547>: Abbrev Number: 2 (DW_TAG_typedef)
    <548>   DW_AT_name        : (indirect string, offset: 0x1784): u_int8_t
    <54c>   DW_AT_decl_file   : 3
    <54d>   DW_AT_decl_line   : 158
    <54e>   DW_AT_decl_column : 19
    <54f>   DW_AT_type        : <0x91>
 <1><553>: Abbrev Number: 2 (DW_TAG_typedef)
    <554>   DW_AT_name        : (indirect string, offset: 0x1d80): u_int16_t
    <558>   DW_AT_decl_file   : 3
    <559>   DW_AT_decl_line   : 159
    <55a>   DW_AT_decl_column : 20
    <55b>   DW_AT_type        : <0xb0>
 <1><55f>: Abbrev Number: 2 (DW_TAG_typedef)
    <560>   DW_AT_name        : (indirect string, offset: 0xf06): u_int32_t
    <564>   DW_AT_decl_file   : 3
    <565>   DW_AT_decl_line   : 160
    <566>   DW_AT_decl_column : 20
    <567>   DW_AT_type        : <0xd9>
 <1><56b>: Abbrev Number: 2 (DW_TAG_typedef)
    <56c>   DW_AT_name        : (indirect string, offset: 0x20f5): u_int64_t
    <570>   DW_AT_decl_file   : 3
    <571>   DW_AT_decl_line   : 161
    <572>   DW_AT_decl_column : 20
    <573>   DW_AT_type        : <0xf8>
 <1><577>: Abbrev Number: 2 (DW_TAG_typedef)
    <578>   DW_AT_name        : (indirect string, offset: 0x9fd): register_t
    <57c>   DW_AT_decl_file   : 3
    <57d>   DW_AT_decl_line   : 164
    <57e>   DW_AT_decl_column : 13
    <57f>   DW_AT_type        : <0xf1>
 <1><583>: Abbrev Number: 7 (DW_TAG_structure_type)
    <584>   DW_AT_byte_size   : 128
    <585>   DW_AT_decl_file   : 10
    <586>   DW_AT_decl_line   : 5
    <587>   DW_AT_decl_column : 9
    <588>   DW_AT_sibling     : <0x59a>
 <2><58c>: Abbrev Number: 8 (DW_TAG_member)
    <58d>   DW_AT_name        : (indirect string, offset: 0x20d4): __val
    <591>   DW_AT_decl_file   : 10
    <592>   DW_AT_decl_line   : 7
    <593>   DW_AT_decl_column : 21
    <594>   DW_AT_type        : <0x59a>
    <598>   DW_AT_data_member_location: 0
 <2><599>: Abbrev Number: 0
 <1><59a>: Abbrev Number: 9 (DW_TAG_array_type)
    <59b>   DW_AT_type        : <0x77>
    <59f>   DW_AT_sibling     : <0x5aa>
 <2><5a3>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <5a4>   DW_AT_type        : <0x77>
    <5a8>   DW_AT_upper_bound : 15
 <2><5a9>: Abbrev Number: 0
 <1><5aa>: Abbrev Number: 2 (DW_TAG_typedef)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x7b4): __sigset_t
    <5af>   DW_AT_decl_file   : 10
    <5b0>   DW_AT_decl_line   : 8
    <5b1>   DW_AT_decl_column : 3
    <5b2>   DW_AT_type        : <0x583>
 <1><5b6>: Abbrev Number: 2 (DW_TAG_typedef)
    <5b7>   DW_AT_name        : (indirect string, offset: 0x7b6): sigset_t
    <5bb>   DW_AT_decl_file   : 11
    <5bc>   DW_AT_decl_line   : 7
    <5bd>   DW_AT_decl_column : 20
    <5be>   DW_AT_type        : <0x5aa>
 <1><5c2>: Abbrev Number: 13 (DW_TAG_structure_type)
    <5c3>   DW_AT_name        : (indirect string, offset: 0xb35): timeval
    <5c7>   DW_AT_byte_size   : 16
    <5c8>   DW_AT_decl_file   : 12
    <5c9>   DW_AT_decl_line   : 8
    <5ca>   DW_AT_decl_column : 8
    <5cb>   DW_AT_sibling     : <0x5ea>
 <2><5cf>: Abbrev Number: 8 (DW_TAG_member)
    <5d0>   DW_AT_name        : (indirect string, offset: 0x1bb1): tv_sec
    <5d4>   DW_AT_decl_file   : 12
    <5d5>   DW_AT_decl_line   : 14
    <5d6>   DW_AT_decl_column : 12
    <5d7>   DW_AT_type        : <0x26f>
    <5db>   DW_AT_data_member_location: 0
 <2><5dc>: Abbrev Number: 8 (DW_TAG_member)
    <5dd>   DW_AT_name        : (indirect string, offset: 0xd10): tv_usec
    <5e1>   DW_AT_decl_file   : 12
    <5e2>   DW_AT_decl_line   : 15
    <5e3>   DW_AT_decl_column : 17
    <5e4>   DW_AT_type        : <0x287>
    <5e8>   DW_AT_data_member_location: 8
 <2><5e9>: Abbrev Number: 0
 <1><5ea>: Abbrev Number: 13 (DW_TAG_structure_type)
    <5eb>   DW_AT_name        : (indirect string, offset: 0xf10): timespec
    <5ef>   DW_AT_byte_size   : 16
    <5f0>   DW_AT_decl_file   : 13
    <5f1>   DW_AT_decl_line   : 11
    <5f2>   DW_AT_decl_column : 8
    <5f3>   DW_AT_sibling     : <0x612>
 <2><5f7>: Abbrev Number: 8 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x1bb1): tv_sec
    <5fc>   DW_AT_decl_file   : 13
    <5fd>   DW_AT_decl_line   : 16
    <5fe>   DW_AT_decl_column : 12
    <5ff>   DW_AT_type        : <0x26f>
    <603>   DW_AT_data_member_location: 0
 <2><604>: Abbrev Number: 8 (DW_TAG_member)
    <605>   DW_AT_name        : (indirect string, offset: 0xbe9): tv_nsec
    <609>   DW_AT_decl_file   : 13
    <60a>   DW_AT_decl_line   : 21
    <60b>   DW_AT_decl_column : 21
    <60c>   DW_AT_type        : <0x33d>
    <610>   DW_AT_data_member_location: 8
 <2><611>: Abbrev Number: 0
 <1><612>: Abbrev Number: 2 (DW_TAG_typedef)
    <613>   DW_AT_name        : (indirect string, offset: 0x1e14): suseconds_t
    <617>   DW_AT_decl_file   : 14
    <618>   DW_AT_decl_line   : 43
    <619>   DW_AT_decl_column : 23
    <61a>   DW_AT_type        : <0x287>
 <1><61e>: Abbrev Number: 2 (DW_TAG_typedef)
    <61f>   DW_AT_name        : (indirect string, offset: 0x2f5): __fd_mask
    <623>   DW_AT_decl_file   : 14
    <624>   DW_AT_decl_line   : 49
    <625>   DW_AT_decl_column : 18
    <626>   DW_AT_type        : <0xf1>
 <1><62a>: Abbrev Number: 7 (DW_TAG_structure_type)
    <62b>   DW_AT_byte_size   : 128
    <62c>   DW_AT_decl_file   : 14
    <62d>   DW_AT_decl_line   : 59
    <62e>   DW_AT_decl_column : 9
    <62f>   DW_AT_sibling     : <0x641>
 <2><633>: Abbrev Number: 8 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0xbba): __fds_bits
    <638>   DW_AT_decl_file   : 14
    <639>   DW_AT_decl_line   : 67
    <63a>   DW_AT_decl_column : 15
    <63b>   DW_AT_type        : <0x641>
    <63f>   DW_AT_data_member_location: 0
 <2><640>: Abbrev Number: 0
 <1><641>: Abbrev Number: 9 (DW_TAG_array_type)
    <642>   DW_AT_type        : <0x61e>
    <646>   DW_AT_sibling     : <0x651>
 <2><64a>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <64b>   DW_AT_type        : <0x77>
    <64f>   DW_AT_upper_bound : 15
 <2><650>: Abbrev Number: 0
 <1><651>: Abbrev Number: 2 (DW_TAG_typedef)
    <652>   DW_AT_name        : (indirect string, offset: 0xf0): fd_set
    <656>   DW_AT_decl_file   : 14
    <657>   DW_AT_decl_line   : 70
    <658>   DW_AT_decl_column : 5
    <659>   DW_AT_type        : <0x62a>
 <1><65d>: Abbrev Number: 2 (DW_TAG_typedef)
    <65e>   DW_AT_name        : (indirect string, offset: 0x2f7): fd_mask
    <662>   DW_AT_decl_file   : 14
    <663>   DW_AT_decl_line   : 77
    <664>   DW_AT_decl_column : 19
    <665>   DW_AT_type        : <0x61e>
 <1><669>: Abbrev Number: 2 (DW_TAG_typedef)
    <66a>   DW_AT_name        : (indirect string, offset: 0x1a4f): blksize_t
    <66e>   DW_AT_decl_file   : 3
    <66f>   DW_AT_decl_line   : 185
    <670>   DW_AT_decl_column : 21
    <671>   DW_AT_type        : <0x2d1>
 <1><675>: Abbrev Number: 2 (DW_TAG_typedef)
    <676>   DW_AT_name        : (indirect string, offset: 0x218c): blkcnt_t
    <67a>   DW_AT_decl_file   : 3
    <67b>   DW_AT_decl_line   : 205
    <67c>   DW_AT_decl_column : 22
    <67d>   DW_AT_type        : <0x2e9>
 <1><681>: Abbrev Number: 2 (DW_TAG_typedef)
    <682>   DW_AT_name        : (indirect string, offset: 0x82d): fsblkcnt_t
    <686>   DW_AT_decl_file   : 3
    <687>   DW_AT_decl_line   : 209
    <688>   DW_AT_decl_column : 24
    <689>   DW_AT_type        : <0x301>
 <1><68d>: Abbrev Number: 2 (DW_TAG_typedef)
    <68e>   DW_AT_name        : (indirect string, offset: 0x1398): fsfilcnt_t
    <692>   DW_AT_decl_file   : 3
    <693>   DW_AT_decl_line   : 213
    <694>   DW_AT_decl_column : 24
    <695>   DW_AT_type        : <0x319>
 <1><699>: Abbrev Number: 2 (DW_TAG_typedef)
    <69a>   DW_AT_name        : (indirect string, offset: 0x1827): blkcnt64_t
    <69e>   DW_AT_decl_file   : 3
    <69f>   DW_AT_decl_line   : 219
    <6a0>   DW_AT_decl_column : 22
    <6a1>   DW_AT_type        : <0x2e9>
 <1><6a5>: Abbrev Number: 2 (DW_TAG_typedef)
    <6a6>   DW_AT_name        : (indirect string, offset: 0x354): fsblkcnt64_t
    <6aa>   DW_AT_decl_file   : 3
    <6ab>   DW_AT_decl_line   : 220
    <6ac>   DW_AT_decl_column : 24
    <6ad>   DW_AT_type        : <0x301>
 <1><6b1>: Abbrev Number: 2 (DW_TAG_typedef)
    <6b2>   DW_AT_name        : (indirect string, offset: 0x11af): fsfilcnt64_t
    <6b6>   DW_AT_decl_file   : 3
    <6b7>   DW_AT_decl_line   : 221
    <6b8>   DW_AT_decl_column : 24
    <6b9>   DW_AT_type        : <0x319>
 <1><6bd>: Abbrev Number: 13 (DW_TAG_structure_type)
    <6be>   DW_AT_name        : (indirect string, offset: 0x752): __pthread_internal_list
    <6c2>   DW_AT_byte_size   : 16
    <6c3>   DW_AT_decl_file   : 15
    <6c4>   DW_AT_decl_line   : 49
    <6c5>   DW_AT_decl_column : 16
    <6c6>   DW_AT_sibling     : <0x6e5>
 <2><6ca>: Abbrev Number: 8 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0x103b): __prev
    <6cf>   DW_AT_decl_file   : 15
    <6d0>   DW_AT_decl_line   : 51
    <6d1>   DW_AT_decl_column : 35
    <6d2>   DW_AT_type        : <0x6e5>
    <6d6>   DW_AT_data_member_location: 0
 <2><6d7>: Abbrev Number: 8 (DW_TAG_member)
    <6d8>   DW_AT_name        : (indirect string, offset: 0xe69): __next
    <6dc>   DW_AT_decl_file   : 15
    <6dd>   DW_AT_decl_line   : 52
    <6de>   DW_AT_decl_column : 35
    <6df>   DW_AT_type        : <0x6e5>
    <6e3>   DW_AT_data_member_location: 8
 <2><6e4>: Abbrev Number: 0
 <1><6e5>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <6e6>   DW_AT_byte_size   : 8
    <6e7>   DW_AT_type        : <0x6bd>
 <1><6eb>: Abbrev Number: 2 (DW_TAG_typedef)
    <6ec>   DW_AT_name        : (indirect string, offset: 0x1681): __pthread_list_t
    <6f0>   DW_AT_decl_file   : 15
    <6f1>   DW_AT_decl_line   : 53
    <6f2>   DW_AT_decl_column : 3
    <6f3>   DW_AT_type        : <0x6bd>
 <1><6f7>: Abbrev Number: 13 (DW_TAG_structure_type)
    <6f8>   DW_AT_name        : (indirect string, offset: 0xd6e): __pthread_internal_slist
    <6fc>   DW_AT_byte_size   : 8
    <6fd>   DW_AT_decl_file   : 15
    <6fe>   DW_AT_decl_line   : 55
    <6ff>   DW_AT_decl_column : 16
    <700>   DW_AT_sibling     : <0x712>
 <2><704>: Abbrev Number: 8 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0xe69): __next
    <709>   DW_AT_decl_file   : 15
    <70a>   DW_AT_decl_line   : 57
    <70b>   DW_AT_decl_column : 36
    <70c>   DW_AT_type        : <0x712>
    <710>   DW_AT_data_member_location: 0
 <2><711>: Abbrev Number: 0
 <1><712>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <713>   DW_AT_byte_size   : 8
    <714>   DW_AT_type        : <0x6f7>
 <1><718>: Abbrev Number: 2 (DW_TAG_typedef)
    <719>   DW_AT_name        : (indirect string, offset: 0x651): __pthread_slist_t
    <71d>   DW_AT_decl_file   : 15
    <71e>   DW_AT_decl_line   : 58
    <71f>   DW_AT_decl_column : 3
    <720>   DW_AT_type        : <0x6f7>
 <1><724>: Abbrev Number: 13 (DW_TAG_structure_type)
    <725>   DW_AT_name        : (indirect string, offset: 0x2359): __pthread_mutex_s
    <729>   DW_AT_byte_size   : 40
    <72a>   DW_AT_decl_file   : 16
    <72b>   DW_AT_decl_line   : 22
    <72c>   DW_AT_decl_column : 8
    <72d>   DW_AT_sibling     : <0x79a>
 <2><731>: Abbrev Number: 8 (DW_TAG_member)
    <732>   DW_AT_name        : (indirect string, offset: 0x1c8d): __lock
    <736>   DW_AT_decl_file   : 16
    <737>   DW_AT_decl_line   : 24
    <738>   DW_AT_decl_column : 7
    <739>   DW_AT_type        : <0xc8>
    <73d>   DW_AT_data_member_location: 0
 <2><73e>: Abbrev Number: 8 (DW_TAG_member)
    <73f>   DW_AT_name        : (indirect string, offset: 0x844): __count
    <743>   DW_AT_decl_file   : 16
    <744>   DW_AT_decl_line   : 25
    <745>   DW_AT_decl_column : 16
    <746>   DW_AT_type        : <0x64>
    <74a>   DW_AT_data_member_location: 4
 <2><74b>: Abbrev Number: 8 (DW_TAG_member)
    <74c>   DW_AT_name        : (indirect string, offset: 0xa68): __owner
    <750>   DW_AT_decl_file   : 16
    <751>   DW_AT_decl_line   : 26
    <752>   DW_AT_decl_column : 7
    <753>   DW_AT_type        : <0xc8>
    <757>   DW_AT_data_member_location: 8
 <2><758>: Abbrev Number: 8 (DW_TAG_member)
    <759>   DW_AT_name        : (indirect string, offset: 0x1844): __nusers
    <75d>   DW_AT_decl_file   : 16
    <75e>   DW_AT_decl_line   : 28
    <75f>   DW_AT_decl_column : 16
    <760>   DW_AT_type        : <0x64>
    <764>   DW_AT_data_member_location: 12
 <2><765>: Abbrev Number: 8 (DW_TAG_member)
    <766>   DW_AT_name        : (indirect string, offset: 0x147d): __kind
    <76a>   DW_AT_decl_file   : 16
    <76b>   DW_AT_decl_line   : 32
    <76c>   DW_AT_decl_column : 7
    <76d>   DW_AT_type        : <0xc8>
    <771>   DW_AT_data_member_location: 16
 <2><772>: Abbrev Number: 8 (DW_TAG_member)
    <773>   DW_AT_name        : (indirect string, offset: 0x1f9f): __spins
    <777>   DW_AT_decl_file   : 16
    <778>   DW_AT_decl_line   : 34
    <779>   DW_AT_decl_column : 9
    <77a>   DW_AT_type        : <0xa9>
    <77e>   DW_AT_data_member_location: 20
 <2><77f>: Abbrev Number: 8 (DW_TAG_member)
    <780>   DW_AT_name        : (indirect string, offset: 0xaaf): __elision
    <784>   DW_AT_decl_file   : 16
    <785>   DW_AT_decl_line   : 35
    <786>   DW_AT_decl_column : 9
    <787>   DW_AT_type        : <0xa9>
    <78b>   DW_AT_data_member_location: 22
 <2><78c>: Abbrev Number: 8 (DW_TAG_member)
    <78d>   DW_AT_name        : (indirect string, offset: 0x1198): __list
    <791>   DW_AT_decl_file   : 16
    <792>   DW_AT_decl_line   : 36
    <793>   DW_AT_decl_column : 20
    <794>   DW_AT_type        : <0x6eb>
    <798>   DW_AT_data_member_location: 24
 <2><799>: Abbrev Number: 0
 <1><79a>: Abbrev Number: 13 (DW_TAG_structure_type)
    <79b>   DW_AT_name        : (indirect string, offset: 0x1a8c): __pthread_rwlock_arch_t
    <79f>   DW_AT_byte_size   : 56
    <7a0>   DW_AT_decl_file   : 17
    <7a1>   DW_AT_decl_line   : 23
    <7a2>   DW_AT_decl_column : 8
    <7a3>   DW_AT_sibling     : <0x844>
 <2><7a7>: Abbrev Number: 8 (DW_TAG_member)
    <7a8>   DW_AT_name        : (indirect string, offset: 0x15): __readers
    <7ac>   DW_AT_decl_file   : 17
    <7ad>   DW_AT_decl_line   : 25
    <7ae>   DW_AT_decl_column : 16
    <7af>   DW_AT_type        : <0x64>
    <7b3>   DW_AT_data_member_location: 0
 <2><7b4>: Abbrev Number: 8 (DW_TAG_member)
    <7b5>   DW_AT_name        : (indirect string, offset: 0x5c5): __writers
    <7b9>   DW_AT_decl_file   : 17
    <7ba>   DW_AT_decl_line   : 26
    <7bb>   DW_AT_decl_column : 16
    <7bc>   DW_AT_type        : <0x64>
    <7c0>   DW_AT_data_member_location: 4
 <2><7c1>: Abbrev Number: 8 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x1c03): __wrphase_futex
    <7c6>   DW_AT_decl_file   : 17
    <7c7>   DW_AT_decl_line   : 27
    <7c8>   DW_AT_decl_column : 16
    <7c9>   DW_AT_type        : <0x64>
    <7cd>   DW_AT_data_member_location: 8
 <2><7ce>: Abbrev Number: 8 (DW_TAG_member)
    <7cf>   DW_AT_name        : (indirect string, offset: 0xe70): __writers_futex
    <7d3>   DW_AT_decl_file   : 17
    <7d4>   DW_AT_decl_line   : 28
    <7d5>   DW_AT_decl_column : 16
    <7d6>   DW_AT_type        : <0x64>
    <7da>   DW_AT_data_member_location: 12
 <2><7db>: Abbrev Number: 8 (DW_TAG_member)
    <7dc>   DW_AT_name        : (indirect string, offset: 0xb2e): __pad3
    <7e0>   DW_AT_decl_file   : 17
    <7e1>   DW_AT_decl_line   : 29
    <7e2>   DW_AT_decl_column : 16
    <7e3>   DW_AT_type        : <0x64>
    <7e7>   DW_AT_data_member_location: 16
 <2><7e8>: Abbrev Number: 8 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0x14dd): __pad4
    <7ed>   DW_AT_decl_file   : 17
    <7ee>   DW_AT_decl_line   : 30
    <7ef>   DW_AT_decl_column : 16
    <7f0>   DW_AT_type        : <0x64>
    <7f4>   DW_AT_data_member_location: 20
 <2><7f5>: Abbrev Number: 8 (DW_TAG_member)
    <7f6>   DW_AT_name        : (indirect string, offset: 0x33d): __cur_writer
    <7fa>   DW_AT_decl_file   : 17
    <7fb>   DW_AT_decl_line   : 32
    <7fc>   DW_AT_decl_column : 7
    <7fd>   DW_AT_type        : <0xc8>
    <801>   DW_AT_data_member_location: 24
 <2><802>: Abbrev Number: 8 (DW_TAG_member)
    <803>   DW_AT_name        : (indirect string, offset: 0x77b): __shared
    <807>   DW_AT_decl_file   : 17
    <808>   DW_AT_decl_line   : 33
    <809>   DW_AT_decl_column : 7
    <80a>   DW_AT_type        : <0xc8>
    <80e>   DW_AT_data_member_location: 28
 <2><80f>: Abbrev Number: 8 (DW_TAG_member)
    <810>   DW_AT_name        : (indirect string, offset: 0xaf9): __rwelision
    <814>   DW_AT_decl_file   : 17
    <815>   DW_AT_decl_line   : 34
    <816>   DW_AT_decl_column : 15
    <817>   DW_AT_type        : <0x8a>
    <81b>   DW_AT_data_member_location: 32
 <2><81c>: Abbrev Number: 8 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0x14c6): __pad1
    <821>   DW_AT_decl_file   : 17
    <822>   DW_AT_decl_line   : 39
    <823>   DW_AT_decl_column : 17
    <824>   DW_AT_type        : <0x844>
    <828>   DW_AT_data_member_location: 33
 <2><829>: Abbrev Number: 8 (DW_TAG_member)
    <82a>   DW_AT_name        : (indirect string, offset: 0x14cd): __pad2
    <82e>   DW_AT_decl_file   : 17
    <82f>   DW_AT_decl_line   : 42
    <830>   DW_AT_decl_column : 21
    <831>   DW_AT_type        : <0x77>
    <835>   DW_AT_data_member_location: 40
 <2><836>: Abbrev Number: 8 (DW_TAG_member)
    <837>   DW_AT_name        : (indirect string, offset: 0x1fe): __flags
    <83b>   DW_AT_decl_file   : 17
    <83c>   DW_AT_decl_line   : 45
    <83d>   DW_AT_decl_column : 16
    <83e>   DW_AT_type        : <0x64>
    <842>   DW_AT_data_member_location: 48
 <2><843>: Abbrev Number: 0
 <1><844>: Abbrev Number: 9 (DW_TAG_array_type)
    <845>   DW_AT_type        : <0x39>
    <849>   DW_AT_sibling     : <0x854>
 <2><84d>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <84e>   DW_AT_type        : <0x77>
    <852>   DW_AT_upper_bound : 6
 <2><853>: Abbrev Number: 0
 <1><854>: Abbrev Number: 7 (DW_TAG_structure_type)
    <855>   DW_AT_byte_size   : 8
    <856>   DW_AT_decl_file   : 15
    <857>   DW_AT_decl_line   : 97
    <858>   DW_AT_decl_column : 5
    <859>   DW_AT_sibling     : <0x878>
 <2><85d>: Abbrev Number: 8 (DW_TAG_member)
    <85e>   DW_AT_name        : (indirect string, offset: 0x1f5f): __low
    <862>   DW_AT_decl_file   : 15
    <863>   DW_AT_decl_line   : 99
    <864>   DW_AT_decl_column : 20
    <865>   DW_AT_type        : <0x64>
    <869>   DW_AT_data_member_location: 0
 <2><86a>: Abbrev Number: 8 (DW_TAG_member)
    <86b>   DW_AT_name        : (indirect string, offset: 0xc43): __high
    <86f>   DW_AT_decl_file   : 15
    <870>   DW_AT_decl_line   : 100
    <871>   DW_AT_decl_column : 20
    <872>   DW_AT_type        : <0x64>
    <876>   DW_AT_data_member_location: 4
 <2><877>: Abbrev Number: 0
 <1><878>: Abbrev Number: 14 (DW_TAG_union_type)
    <879>   DW_AT_byte_size   : 8
    <87a>   DW_AT_decl_file   : 15
    <87b>   DW_AT_decl_line   : 94
    <87c>   DW_AT_decl_column : 17
    <87d>   DW_AT_sibling     : <0x89a>
 <2><881>: Abbrev Number: 15 (DW_TAG_member)
    <882>   DW_AT_name        : (indirect string, offset: 0x1f1d): __wseq
    <886>   DW_AT_decl_file   : 15
    <887>   DW_AT_decl_line   : 96
    <888>   DW_AT_decl_column : 42
    <889>   DW_AT_type        : <0x89a>
 <2><88d>: Abbrev Number: 15 (DW_TAG_member)
    <88e>   DW_AT_name        : (indirect string, offset: 0xe59): __wseq32
    <892>   DW_AT_decl_file   : 15
    <893>   DW_AT_decl_line   : 101
    <894>   DW_AT_decl_column : 7
    <895>   DW_AT_type        : <0x854>
 <2><899>: Abbrev Number: 0
 <1><89a>: Abbrev Number: 3 (DW_TAG_base_type)
    <89b>   DW_AT_byte_size   : 8
    <89c>   DW_AT_encoding    : 7	(unsigned)
    <89d>   DW_AT_name        : (indirect string, offset: 0x976): long long unsigned int
 <1><8a1>: Abbrev Number: 7 (DW_TAG_structure_type)
    <8a2>   DW_AT_byte_size   : 8
    <8a3>   DW_AT_decl_file   : 15
    <8a4>   DW_AT_decl_line   : 106
    <8a5>   DW_AT_decl_column : 5
    <8a6>   DW_AT_sibling     : <0x8c5>
 <2><8aa>: Abbrev Number: 8 (DW_TAG_member)
    <8ab>   DW_AT_name        : (indirect string, offset: 0x1f5f): __low
    <8af>   DW_AT_decl_file   : 15
    <8b0>   DW_AT_decl_line   : 108
    <8b1>   DW_AT_decl_column : 20
    <8b2>   DW_AT_type        : <0x64>
    <8b6>   DW_AT_data_member_location: 0
 <2><8b7>: Abbrev Number: 8 (DW_TAG_member)
    <8b8>   DW_AT_name        : (indirect string, offset: 0xc43): __high
    <8bc>   DW_AT_decl_file   : 15
    <8bd>   DW_AT_decl_line   : 109
    <8be>   DW_AT_decl_column : 20
    <8bf>   DW_AT_type        : <0x64>
    <8c3>   DW_AT_data_member_location: 4
 <2><8c4>: Abbrev Number: 0
 <1><8c5>: Abbrev Number: 14 (DW_TAG_union_type)
    <8c6>   DW_AT_byte_size   : 8
    <8c7>   DW_AT_decl_file   : 15
    <8c8>   DW_AT_decl_line   : 103
    <8c9>   DW_AT_decl_column : 17
    <8ca>   DW_AT_sibling     : <0x8e7>
 <2><8ce>: Abbrev Number: 15 (DW_TAG_member)
    <8cf>   DW_AT_name        : (indirect string, offset: 0x820): __g1_start
    <8d3>   DW_AT_decl_file   : 15
    <8d4>   DW_AT_decl_line   : 105
    <8d5>   DW_AT_decl_column : 42
    <8d6>   DW_AT_type        : <0x89a>
 <2><8da>: Abbrev Number: 15 (DW_TAG_member)
    <8db>   DW_AT_name        : (indirect string, offset: 0x1a40): __g1_start32
    <8df>   DW_AT_decl_file   : 15
    <8e0>   DW_AT_decl_line   : 110
    <8e1>   DW_AT_decl_column : 7
    <8e2>   DW_AT_type        : <0x8a1>
 <2><8e6>: Abbrev Number: 0
 <1><8e7>: Abbrev Number: 13 (DW_TAG_structure_type)
    <8e8>   DW_AT_name        : (indirect string, offset: 0x1e60): __pthread_cond_s
    <8ec>   DW_AT_byte_size   : 48
    <8ed>   DW_AT_decl_file   : 15
    <8ee>   DW_AT_decl_line   : 92
    <8ef>   DW_AT_decl_column : 8
    <8f0>   DW_AT_sibling     : <0x942>
 <2><8f4>: Abbrev Number: 16 (DW_TAG_member)
    <8f5>   DW_AT_type        : <0x878>
    <8f9>   DW_AT_data_member_location: 0
 <2><8fa>: Abbrev Number: 16 (DW_TAG_member)
    <8fb>   DW_AT_type        : <0x8c5>
    <8ff>   DW_AT_data_member_location: 8
 <2><900>: Abbrev Number: 8 (DW_TAG_member)
    <901>   DW_AT_name        : (indirect string, offset: 0x1ce3): __g_refs
    <905>   DW_AT_decl_file   : 15
    <906>   DW_AT_decl_line   : 112
    <907>   DW_AT_decl_column : 16
    <908>   DW_AT_type        : <0x942>
    <90c>   DW_AT_data_member_location: 16
 <2><90d>: Abbrev Number: 8 (DW_TAG_member)
    <90e>   DW_AT_name        : (indirect string, offset: 0x193b): __g_size
    <912>   DW_AT_decl_file   : 15
    <913>   DW_AT_decl_line   : 113
    <914>   DW_AT_decl_column : 16
    <915>   DW_AT_type        : <0x942>
    <919>   DW_AT_data_member_location: 24
 <2><91a>: Abbrev Number: 8 (DW_TAG_member)
    <91b>   DW_AT_name        : (indirect string, offset: 0x21a3): __g1_orig_size
    <91f>   DW_AT_decl_file   : 15
    <920>   DW_AT_decl_line   : 114
    <921>   DW_AT_decl_column : 16
    <922>   DW_AT_type        : <0x64>
    <926>   DW_AT_data_member_location: 32
 <2><927>: Abbrev Number: 8 (DW_TAG_member)
    <928>   DW_AT_name        : (indirect string, offset: 0x406): __wrefs
    <92c>   DW_AT_decl_file   : 15
    <92d>   DW_AT_decl_line   : 115
    <92e>   DW_AT_decl_column : 16
    <92f>   DW_AT_type        : <0x64>
    <933>   DW_AT_data_member_location: 36
 <2><934>: Abbrev Number: 8 (DW_TAG_member)
    <935>   DW_AT_name        : (indirect string, offset: 0x1f11): __g_signals
    <939>   DW_AT_decl_file   : 15
    <93a>   DW_AT_decl_line   : 116
    <93b>   DW_AT_decl_column : 16
    <93c>   DW_AT_type        : <0x942>
    <940>   DW_AT_data_member_location: 40
 <2><941>: Abbrev Number: 0
 <1><942>: Abbrev Number: 9 (DW_TAG_array_type)
    <943>   DW_AT_type        : <0x64>
    <947>   DW_AT_sibling     : <0x952>
 <2><94b>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <94c>   DW_AT_type        : <0x77>
    <950>   DW_AT_upper_bound : 1
 <2><951>: Abbrev Number: 0
 <1><952>: Abbrev Number: 2 (DW_TAG_typedef)
    <953>   DW_AT_name        : (indirect string, offset: 0x740): __tss_t
    <957>   DW_AT_decl_file   : 15
    <958>   DW_AT_decl_line   : 119
    <959>   DW_AT_decl_column : 22
    <95a>   DW_AT_type        : <0x64>
 <1><95e>: Abbrev Number: 2 (DW_TAG_typedef)
    <95f>   DW_AT_name        : (indirect string, offset: 0x1951): __thrd_t
    <963>   DW_AT_decl_file   : 15
    <964>   DW_AT_decl_line   : 120
    <965>   DW_AT_decl_column : 27
    <966>   DW_AT_type        : <0x77>
 <1><96a>: Abbrev Number: 7 (DW_TAG_structure_type)
    <96b>   DW_AT_byte_size   : 4
    <96c>   DW_AT_decl_file   : 15
    <96d>   DW_AT_decl_line   : 122
    <96e>   DW_AT_decl_column : 9
    <96f>   DW_AT_sibling     : <0x981>
 <2><973>: Abbrev Number: 8 (DW_TAG_member)
    <974>   DW_AT_name        : (indirect string, offset: 0x195a): __data
    <978>   DW_AT_decl_file   : 15
    <979>   DW_AT_decl_line   : 124
    <97a>   DW_AT_decl_column : 7
    <97b>   DW_AT_type        : <0xc8>
    <97f>   DW_AT_data_member_location: 0
 <2><980>: Abbrev Number: 0
 <1><981>: Abbrev Number: 2 (DW_TAG_typedef)
    <982>   DW_AT_name        : (indirect string, offset: 0x569): __once_flag
    <986>   DW_AT_decl_file   : 15
    <987>   DW_AT_decl_line   : 125
    <988>   DW_AT_decl_column : 3
    <989>   DW_AT_type        : <0x96a>
 <1><98d>: Abbrev Number: 2 (DW_TAG_typedef)
    <98e>   DW_AT_name        : (indirect string, offset: 0xb1): pthread_t
    <992>   DW_AT_decl_file   : 18
    <993>   DW_AT_decl_line   : 27
    <994>   DW_AT_decl_column : 27
    <995>   DW_AT_type        : <0x77>
 <1><999>: Abbrev Number: 14 (DW_TAG_union_type)
    <99a>   DW_AT_byte_size   : 4
    <99b>   DW_AT_decl_file   : 18
    <99c>   DW_AT_decl_line   : 32
    <99d>   DW_AT_decl_column : 9
    <99e>   DW_AT_sibling     : <0x9bb>
 <2><9a2>: Abbrev Number: 15 (DW_TAG_member)
    <9a3>   DW_AT_name        : (indirect string, offset: 0x229f): __size
    <9a7>   DW_AT_decl_file   : 18
    <9a8>   DW_AT_decl_line   : 34
    <9a9>   DW_AT_decl_column : 8
    <9aa>   DW_AT_type        : <0x9bb>
 <2><9ae>: Abbrev Number: 15 (DW_TAG_member)
    <9af>   DW_AT_name        : (indirect string, offset: 0x21e5): __align
    <9b3>   DW_AT_decl_file   : 18
    <9b4>   DW_AT_decl_line   : 35
    <9b5>   DW_AT_decl_column : 7
    <9b6>   DW_AT_type        : <0xc8>
 <2><9ba>: Abbrev Number: 0
 <1><9bb>: Abbrev Number: 9 (DW_TAG_array_type)
    <9bc>   DW_AT_type        : <0x373>
    <9c0>   DW_AT_sibling     : <0x9cb>
 <2><9c4>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <9c5>   DW_AT_type        : <0x77>
    <9c9>   DW_AT_upper_bound : 3
 <2><9ca>: Abbrev Number: 0
 <1><9cb>: Abbrev Number: 2 (DW_TAG_typedef)
    <9cc>   DW_AT_name        : (indirect string, offset: 0x2a7): pthread_mutexattr_t
    <9d0>   DW_AT_decl_file   : 18
    <9d1>   DW_AT_decl_line   : 36
    <9d2>   DW_AT_decl_column : 3
    <9d3>   DW_AT_type        : <0x999>
 <1><9d7>: Abbrev Number: 14 (DW_TAG_union_type)
    <9d8>   DW_AT_byte_size   : 4
    <9d9>   DW_AT_decl_file   : 18
    <9da>   DW_AT_decl_line   : 41
    <9db>   DW_AT_decl_column : 9
    <9dc>   DW_AT_sibling     : <0x9f9>
 <2><9e0>: Abbrev Number: 15 (DW_TAG_member)
    <9e1>   DW_AT_name        : (indirect string, offset: 0x229f): __size
    <9e5>   DW_AT_decl_file   : 18
    <9e6>   DW_AT_decl_line   : 43
    <9e7>   DW_AT_decl_column : 8
    <9e8>   DW_AT_type        : <0x9bb>
 <2><9ec>: Abbrev Number: 15 (DW_TAG_member)
    <9ed>   DW_AT_name        : (indirect string, offset: 0x21e5): __align
    <9f1>   DW_AT_decl_file   : 18
    <9f2>   DW_AT_decl_line   : 44
    <9f3>   DW_AT_decl_column : 7
    <9f4>   DW_AT_type        : <0xc8>
 <2><9f8>: Abbrev Number: 0
 <1><9f9>: Abbrev Number: 2 (DW_TAG_typedef)
    <9fa>   DW_AT_name        : (indirect string, offset: 0x1722): pthread_condattr_t
    <9fe>   DW_AT_decl_file   : 18
    <9ff>   DW_AT_decl_line   : 45
    <a00>   DW_AT_decl_column : 3
    <a01>   DW_AT_type        : <0x9d7>
 <1><a05>: Abbrev Number: 2 (DW_TAG_typedef)
    <a06>   DW_AT_name        : (indirect string, offset: 0x87e): pthread_key_t
    <a0a>   DW_AT_decl_file   : 18
    <a0b>   DW_AT_decl_line   : 49
    <a0c>   DW_AT_decl_column : 22
    <a0d>   DW_AT_type        : <0x64>
 <1><a11>: Abbrev Number: 2 (DW_TAG_typedef)
    <a12>   DW_AT_name        : (indirect string, offset: 0x1cf5): pthread_once_t
    <a16>   DW_AT_decl_file   : 18
    <a17>   DW_AT_decl_line   : 53
    <a18>   DW_AT_decl_column : 30
    <a19>   DW_AT_type        : <0xc8>
 <1><a1d>: Abbrev Number: 17 (DW_TAG_union_type)
    <a1e>   DW_AT_name        : (indirect string, offset: 0xaa0): pthread_attr_t
    <a22>   DW_AT_byte_size   : 56
    <a23>   DW_AT_decl_file   : 18
    <a24>   DW_AT_decl_line   : 56
    <a25>   DW_AT_decl_column : 7
    <a26>   DW_AT_sibling     : <0xa43>
 <2><a2a>: Abbrev Number: 15 (DW_TAG_member)
    <a2b>   DW_AT_name        : (indirect string, offset: 0x229f): __size
    <a2f>   DW_AT_decl_file   : 18
    <a30>   DW_AT_decl_line   : 58
    <a31>   DW_AT_decl_column : 8
    <a32>   DW_AT_type        : <0xa43>
 <2><a36>: Abbrev Number: 15 (DW_TAG_member)
    <a37>   DW_AT_name        : (indirect string, offset: 0x21e5): __align
    <a3b>   DW_AT_decl_file   : 18
    <a3c>   DW_AT_decl_line   : 59
    <a3d>   DW_AT_decl_column : 12
    <a3e>   DW_AT_type        : <0xf1>
 <2><a42>: Abbrev Number: 0
 <1><a43>: Abbrev Number: 9 (DW_TAG_array_type)
    <a44>   DW_AT_type        : <0x373>
    <a48>   DW_AT_sibling     : <0xa53>
 <2><a4c>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <a4d>   DW_AT_type        : <0x77>
    <a51>   DW_AT_upper_bound : 55
 <2><a52>: Abbrev Number: 0
 <1><a53>: Abbrev Number: 2 (DW_TAG_typedef)
    <a54>   DW_AT_name        : (indirect string, offset: 0xaa0): pthread_attr_t
    <a58>   DW_AT_decl_file   : 18
    <a59>   DW_AT_decl_line   : 62
    <a5a>   DW_AT_decl_column : 30
    <a5b>   DW_AT_type        : <0xa1d>
 <1><a5f>: Abbrev Number: 14 (DW_TAG_union_type)
    <a60>   DW_AT_byte_size   : 40
    <a61>   DW_AT_decl_file   : 18
    <a62>   DW_AT_decl_line   : 67
    <a63>   DW_AT_decl_column : 9
    <a64>   DW_AT_sibling     : <0xa8d>
 <2><a68>: Abbrev Number: 15 (DW_TAG_member)
    <a69>   DW_AT_name        : (indirect string, offset: 0x195a): __data
    <a6d>   DW_AT_decl_file   : 18
    <a6e>   DW_AT_decl_line   : 69
    <a6f>   DW_AT_decl_column : 28
    <a70>   DW_AT_type        : <0x724>
 <2><a74>: Abbrev Number: 15 (DW_TAG_member)
    <a75>   DW_AT_name        : (indirect string, offset: 0x229f): __size
    <a79>   DW_AT_decl_file   : 18
    <a7a>   DW_AT_decl_line   : 70
    <a7b>   DW_AT_decl_column : 8
    <a7c>   DW_AT_type        : <0xa8d>
 <2><a80>: Abbrev Number: 15 (DW_TAG_member)
    <a81>   DW_AT_name        : (indirect string, offset: 0x21e5): __align
    <a85>   DW_AT_decl_file   : 18
    <a86>   DW_AT_decl_line   : 71
    <a87>   DW_AT_decl_column : 12
    <a88>   DW_AT_type        : <0xf1>
 <2><a8c>: Abbrev Number: 0
 <1><a8d>: Abbrev Number: 9 (DW_TAG_array_type)
    <a8e>   DW_AT_type        : <0x373>
    <a92>   DW_AT_sibling     : <0xa9d>
 <2><a96>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <a97>   DW_AT_type        : <0x77>
    <a9b>   DW_AT_upper_bound : 39
 <2><a9c>: Abbrev Number: 0
 <1><a9d>: Abbrev Number: 2 (DW_TAG_typedef)
    <a9e>   DW_AT_name        : (indirect string, offset: 0x1c6e): pthread_mutex_t
    <aa2>   DW_AT_decl_file   : 18
    <aa3>   DW_AT_decl_line   : 72
    <aa4>   DW_AT_decl_column : 3
    <aa5>   DW_AT_type        : <0xa5f>
 <1><aa9>: Abbrev Number: 14 (DW_TAG_union_type)
    <aaa>   DW_AT_byte_size   : 48
    <aab>   DW_AT_decl_file   : 18
    <aac>   DW_AT_decl_line   : 75
    <aad>   DW_AT_decl_column : 9
    <aae>   DW_AT_sibling     : <0xad7>
 <2><ab2>: Abbrev Number: 15 (DW_TAG_member)
    <ab3>   DW_AT_name        : (indirect string, offset: 0x195a): __data
    <ab7>   DW_AT_decl_file   : 18
    <ab8>   DW_AT_decl_line   : 77
    <ab9>   DW_AT_decl_column : 27
    <aba>   DW_AT_type        : <0x8e7>
 <2><abe>: Abbrev Number: 15 (DW_TAG_member)
    <abf>   DW_AT_name        : (indirect string, offset: 0x229f): __size
    <ac3>   DW_AT_decl_file   : 18
    <ac4>   DW_AT_decl_line   : 78
    <ac5>   DW_AT_decl_column : 8
    <ac6>   DW_AT_type        : <0xad7>
 <2><aca>: Abbrev Number: 15 (DW_TAG_member)
    <acb>   DW_AT_name        : (indirect string, offset: 0x21e5): __align
    <acf>   DW_AT_decl_file   : 18
    <ad0>   DW_AT_decl_line   : 79
    <ad1>   DW_AT_decl_column : 31
    <ad2>   DW_AT_type        : <0xae7>
 <2><ad6>: Abbrev Number: 0
 <1><ad7>: Abbrev Number: 9 (DW_TAG_array_type)
    <ad8>   DW_AT_type        : <0x373>
    <adc>   DW_AT_sibling     : <0xae7>
 <2><ae0>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <ae1>   DW_AT_type        : <0x77>
    <ae5>   DW_AT_upper_bound : 47
 <2><ae6>: Abbrev Number: 0
 <1><ae7>: Abbrev Number: 3 (DW_TAG_base_type)
    <ae8>   DW_AT_byte_size   : 8
    <ae9>   DW_AT_encoding    : 5	(signed)
    <aea>   DW_AT_name        : (indirect string, offset: 0x119f): long long int
 <1><aee>: Abbrev Number: 2 (DW_TAG_typedef)
    <aef>   DW_AT_name        : (indirect string, offset: 0x1c7e): pthread_cond_t
    <af3>   DW_AT_decl_file   : 18
    <af4>   DW_AT_decl_line   : 80
    <af5>   DW_AT_decl_column : 3
    <af6>   DW_AT_type        : <0xaa9>
 <1><afa>: Abbrev Number: 14 (DW_TAG_union_type)
    <afb>   DW_AT_byte_size   : 56
    <afc>   DW_AT_decl_file   : 18
    <afd>   DW_AT_decl_line   : 86
    <afe>   DW_AT_decl_column : 9
    <aff>   DW_AT_sibling     : <0xb28>
 <2><b03>: Abbrev Number: 15 (DW_TAG_member)
    <b04>   DW_AT_name        : (indirect string, offset: 0x195a): __data
    <b08>   DW_AT_decl_file   : 18
    <b09>   DW_AT_decl_line   : 88
    <b0a>   DW_AT_decl_column : 34
    <b0b>   DW_AT_type        : <0x79a>
 <2><b0f>: Abbrev Number: 15 (DW_TAG_member)
    <b10>   DW_AT_name        : (indirect string, offset: 0x229f): __size
    <b14>   DW_AT_decl_file   : 18
    <b15>   DW_AT_decl_line   : 89
    <b16>   DW_AT_decl_column : 8
    <b17>   DW_AT_type        : <0xa43>
 <2><b1b>: Abbrev Number: 15 (DW_TAG_member)
    <b1c>   DW_AT_name        : (indirect string, offset: 0x21e5): __align
    <b20>   DW_AT_decl_file   : 18
    <b21>   DW_AT_decl_line   : 90
    <b22>   DW_AT_decl_column : 12
    <b23>   DW_AT_type        : <0xf1>
 <2><b27>: Abbrev Number: 0
 <1><b28>: Abbrev Number: 2 (DW_TAG_typedef)
    <b29>   DW_AT_name        : (indirect string, offset: 0x13de): pthread_rwlock_t
    <b2d>   DW_AT_decl_file   : 18
    <b2e>   DW_AT_decl_line   : 91
    <b2f>   DW_AT_decl_column : 3
    <b30>   DW_AT_type        : <0xafa>
 <1><b34>: Abbrev Number: 14 (DW_TAG_union_type)
    <b35>   DW_AT_byte_size   : 8
    <b36>   DW_AT_decl_file   : 18
    <b37>   DW_AT_decl_line   : 93
    <b38>   DW_AT_decl_column : 9
    <b39>   DW_AT_sibling     : <0xb56>
 <2><b3d>: Abbrev Number: 15 (DW_TAG_member)
    <b3e>   DW_AT_name        : (indirect string, offset: 0x229f): __size
    <b42>   DW_AT_decl_file   : 18
    <b43>   DW_AT_decl_line   : 95
    <b44>   DW_AT_decl_column : 8
    <b45>   DW_AT_type        : <0xb56>
 <2><b49>: Abbrev Number: 15 (DW_TAG_member)
    <b4a>   DW_AT_name        : (indirect string, offset: 0x21e5): __align
    <b4e>   DW_AT_decl_file   : 18
    <b4f>   DW_AT_decl_line   : 96
    <b50>   DW_AT_decl_column : 12
    <b51>   DW_AT_type        : <0xf1>
 <2><b55>: Abbrev Number: 0
 <1><b56>: Abbrev Number: 9 (DW_TAG_array_type)
    <b57>   DW_AT_type        : <0x373>
    <b5b>   DW_AT_sibling     : <0xb66>
 <2><b5f>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <b60>   DW_AT_type        : <0x77>
    <b64>   DW_AT_upper_bound : 7
 <2><b65>: Abbrev Number: 0
 <1><b66>: Abbrev Number: 2 (DW_TAG_typedef)
    <b67>   DW_AT_name        : (indirect string, offset: 0): pthread_rwlockattr_t
    <b6b>   DW_AT_decl_file   : 18
    <b6c>   DW_AT_decl_line   : 97
    <b6d>   DW_AT_decl_column : 3
    <b6e>   DW_AT_type        : <0xb34>
 <1><b72>: Abbrev Number: 2 (DW_TAG_typedef)
    <b73>   DW_AT_name        : (indirect string, offset: 0x18e0): pthread_spinlock_t
    <b77>   DW_AT_decl_file   : 18
    <b78>   DW_AT_decl_line   : 103
    <b79>   DW_AT_decl_column : 22
    <b7a>   DW_AT_type        : <0xcf>
 <1><b7e>: Abbrev Number: 14 (DW_TAG_union_type)
    <b7f>   DW_AT_byte_size   : 32
    <b80>   DW_AT_decl_file   : 18
    <b81>   DW_AT_decl_line   : 108
    <b82>   DW_AT_decl_column : 9
    <b83>   DW_AT_sibling     : <0xba0>
 <2><b87>: Abbrev Number: 15 (DW_TAG_member)
    <b88>   DW_AT_name        : (indirect string, offset: 0x229f): __size
    <b8c>   DW_AT_decl_file   : 18
    <b8d>   DW_AT_decl_line   : 110
    <b8e>   DW_AT_decl_column : 8
    <b8f>   DW_AT_type        : <0xba0>
 <2><b93>: Abbrev Number: 15 (DW_TAG_member)
    <b94>   DW_AT_name        : (indirect string, offset: 0x21e5): __align
    <b98>   DW_AT_decl_file   : 18
    <b99>   DW_AT_decl_line   : 111
    <b9a>   DW_AT_decl_column : 12
    <b9b>   DW_AT_type        : <0xf1>
 <2><b9f>: Abbrev Number: 0
 <1><ba0>: Abbrev Number: 9 (DW_TAG_array_type)
    <ba1>   DW_AT_type        : <0x373>
    <ba5>   DW_AT_sibling     : <0xbb0>
 <2><ba9>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <baa>   DW_AT_type        : <0x77>
    <bae>   DW_AT_upper_bound : 31
 <2><baf>: Abbrev Number: 0
 <1><bb0>: Abbrev Number: 2 (DW_TAG_typedef)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x185f): pthread_barrier_t
    <bb5>   DW_AT_decl_file   : 18
    <bb6>   DW_AT_decl_line   : 112
    <bb7>   DW_AT_decl_column : 3
    <bb8>   DW_AT_type        : <0xb7e>
 <1><bbc>: Abbrev Number: 14 (DW_TAG_union_type)
    <bbd>   DW_AT_byte_size   : 4
    <bbe>   DW_AT_decl_file   : 18
    <bbf>   DW_AT_decl_line   : 114
    <bc0>   DW_AT_decl_column : 9
    <bc1>   DW_AT_sibling     : <0xbde>
 <2><bc5>: Abbrev Number: 15 (DW_TAG_member)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x229f): __size
    <bca>   DW_AT_decl_file   : 18
    <bcb>   DW_AT_decl_line   : 116
    <bcc>   DW_AT_decl_column : 8
    <bcd>   DW_AT_type        : <0x9bb>
 <2><bd1>: Abbrev Number: 15 (DW_TAG_member)
    <bd2>   DW_AT_name        : (indirect string, offset: 0x21e5): __align
    <bd6>   DW_AT_decl_file   : 18
    <bd7>   DW_AT_decl_line   : 117
    <bd8>   DW_AT_decl_column : 7
    <bd9>   DW_AT_type        : <0xc8>
 <2><bdd>: Abbrev Number: 0
 <1><bde>: Abbrev Number: 2 (DW_TAG_typedef)
    <bdf>   DW_AT_name        : (indirect string, offset: 0x2031): pthread_barrierattr_t
    <be3>   DW_AT_decl_file   : 18
    <be4>   DW_AT_decl_line   : 118
    <be5>   DW_AT_decl_column : 3
    <be6>   DW_AT_type        : <0xbbc>
 <1><bea>: Abbrev Number: 7 (DW_TAG_structure_type)
    <beb>   DW_AT_byte_size   : 80
    <bec>   DW_AT_decl_file   : 19
    <bed>   DW_AT_decl_line   : 49
    <bee>   DW_AT_decl_column : 4
    <bef>   DW_AT_sibling     : <0xc90>
 <2><bf3>: Abbrev Number: 8 (DW_TAG_member)
    <bf4>   DW_AT_name        : (indirect string, offset: 0x18ba): next_in
    <bf8>   DW_AT_decl_file   : 19
    <bf9>   DW_AT_decl_line   : 50
    <bfa>   DW_AT_decl_column : 13
    <bfb>   DW_AT_type        : <0x36d>
    <bff>   DW_AT_data_member_location: 0
 <2><c00>: Abbrev Number: 8 (DW_TAG_member)
    <c01>   DW_AT_name        : (indirect string, offset: 0x14d4): avail_in
    <c05>   DW_AT_decl_file   : 19
    <c06>   DW_AT_decl_line   : 51
    <c07>   DW_AT_decl_column : 20
    <c08>   DW_AT_type        : <0x64>
    <c0c>   DW_AT_data_member_location: 8
 <2><c0d>: Abbrev Number: 8 (DW_TAG_member)
    <c0e>   DW_AT_name        : (indirect string, offset: 0x1a24): total_in_lo32
    <c12>   DW_AT_decl_file   : 19
    <c13>   DW_AT_decl_line   : 52
    <c14>   DW_AT_decl_column : 20
    <c15>   DW_AT_type        : <0x64>
    <c19>   DW_AT_data_member_location: 12
 <2><c1a>: Abbrev Number: 8 (DW_TAG_member)
    <c1b>   DW_AT_name        : (indirect string, offset: 0x1e9): total_in_hi32
    <c1f>   DW_AT_decl_file   : 19
    <c20>   DW_AT_decl_line   : 53
    <c21>   DW_AT_decl_column : 20
    <c22>   DW_AT_type        : <0x64>
    <c26>   DW_AT_data_member_location: 16
 <2><c27>: Abbrev Number: 8 (DW_TAG_member)
    <c28>   DW_AT_name        : (indirect string, offset: 0x1222): next_out
    <c2c>   DW_AT_decl_file   : 19
    <c2d>   DW_AT_decl_line   : 55
    <c2e>   DW_AT_decl_column : 13
    <c2f>   DW_AT_type        : <0x36d>
    <c33>   DW_AT_data_member_location: 24
 <2><c34>: Abbrev Number: 8 (DW_TAG_member)
    <c35>   DW_AT_name        : (indirect string, offset: 0xb12): avail_out
    <c39>   DW_AT_decl_file   : 19
    <c3a>   DW_AT_decl_line   : 56
    <c3b>   DW_AT_decl_column : 20
    <c3c>   DW_AT_type        : <0x64>
    <c40>   DW_AT_data_member_location: 32
 <2><c41>: Abbrev Number: 8 (DW_TAG_member)
    <c42>   DW_AT_name        : (indirect string, offset: 0x1537): total_out_lo32
    <c46>   DW_AT_decl_file   : 19
    <c47>   DW_AT_decl_line   : 57
    <c48>   DW_AT_decl_column : 20
    <c49>   DW_AT_type        : <0x64>
    <c4d>   DW_AT_data_member_location: 36
 <2><c4e>: Abbrev Number: 8 (DW_TAG_member)
    <c4f>   DW_AT_name        : (indirect string, offset: 0x15b8): total_out_hi32
    <c53>   DW_AT_decl_file   : 19
    <c54>   DW_AT_decl_line   : 58
    <c55>   DW_AT_decl_column : 20
    <c56>   DW_AT_type        : <0x64>
    <c5a>   DW_AT_data_member_location: 40
 <2><c5b>: Abbrev Number: 8 (DW_TAG_member)
    <c5c>   DW_AT_name        : (indirect string, offset: 0x2248): state
    <c60>   DW_AT_decl_file   : 19
    <c61>   DW_AT_decl_line   : 60
    <c62>   DW_AT_decl_column : 13
    <c63>   DW_AT_type        : <0x2cf>
    <c67>   DW_AT_data_member_location: 48
 <2><c68>: Abbrev Number: 8 (DW_TAG_member)
    <c69>   DW_AT_name        : (indirect string, offset: 0x121a): bzalloc
    <c6d>   DW_AT_decl_file   : 19
    <c6e>   DW_AT_decl_line   : 62
    <c6f>   DW_AT_decl_column : 15
    <c70>   DW_AT_type        : <0xca9>
    <c74>   DW_AT_data_member_location: 56
 <2><c75>: Abbrev Number: 8 (DW_TAG_member)
    <c76>   DW_AT_name        : (indirect string, offset: 0x2ff): bzfree
    <c7a>   DW_AT_decl_file   : 19
    <c7b>   DW_AT_decl_line   : 63
    <c7c>   DW_AT_decl_column : 14
    <c7d>   DW_AT_type        : <0xcbf>
    <c81>   DW_AT_data_member_location: 64
 <2><c82>: Abbrev Number: 8 (DW_TAG_member)
    <c83>   DW_AT_name        : (indirect string, offset: 0x7ad): opaque
    <c87>   DW_AT_decl_file   : 19
    <c88>   DW_AT_decl_line   : 64
    <c89>   DW_AT_decl_column : 13
    <c8a>   DW_AT_type        : <0x2cf>
    <c8e>   DW_AT_data_member_location: 72
 <2><c8f>: Abbrev Number: 0
 <1><c90>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <c91>   DW_AT_prototyped  : 1
    <c91>   DW_AT_type        : <0x2cf>
    <c95>   DW_AT_sibling     : <0xca9>
 <2><c99>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <c9a>   DW_AT_type        : <0x2cf>
 <2><c9e>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <c9f>   DW_AT_type        : <0xc8>
 <2><ca3>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <ca4>   DW_AT_type        : <0xc8>
 <2><ca8>: Abbrev Number: 0
 <1><ca9>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <caa>   DW_AT_byte_size   : 8
    <cab>   DW_AT_type        : <0xc90>
 <1><caf>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <cb0>   DW_AT_prototyped  : 1
    <cb0>   DW_AT_sibling     : <0xcbf>
 <2><cb4>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <cb5>   DW_AT_type        : <0x2cf>
 <2><cb9>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <cba>   DW_AT_type        : <0x2cf>
 <2><cbe>: Abbrev Number: 0
 <1><cbf>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <cc0>   DW_AT_byte_size   : 8
    <cc1>   DW_AT_type        : <0xcaf>
 <1><cc5>: Abbrev Number: 2 (DW_TAG_typedef)
    <cc6>   DW_AT_name        : (indirect string, offset: 0x2027): bz_stream
    <cca>   DW_AT_decl_file   : 19
    <ccb>   DW_AT_decl_line   : 66
    <ccc>   DW_AT_decl_column : 4
    <ccd>   DW_AT_type        : <0xbea>
 <1><cd1>: Abbrev Number: 2 (DW_TAG_typedef)
    <cd2>   DW_AT_name        : (indirect string, offset: 0xb94): __gnuc_va_list
    <cd6>   DW_AT_decl_file   : 20
    <cd7>   DW_AT_decl_line   : 40
    <cd8>   DW_AT_decl_column : 27
    <cd9>   DW_AT_type        : <0xcdd>
 <1><cdd>: Abbrev Number: 21 (DW_TAG_typedef)
    <cde>   DW_AT_name        : (indirect string, offset: 0x20c2): __builtin_va_list
    <ce2>   DW_AT_type        : <0xce6>
 <1><ce6>: Abbrev Number: 9 (DW_TAG_array_type)
    <ce7>   DW_AT_type        : <0xcf6>
    <ceb>   DW_AT_sibling     : <0xcf6>
 <2><cef>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <cf0>   DW_AT_type        : <0x77>
    <cf4>   DW_AT_upper_bound : 0
 <2><cf5>: Abbrev Number: 0
 <1><cf6>: Abbrev Number: 22 (DW_TAG_structure_type)
    <cf7>   DW_AT_name        : (indirect string, offset: 0x1a32): __va_list_tag
    <cfb>   DW_AT_byte_size   : 24
    <cfc>   DW_AT_decl_file   : 21
    <cfd>   DW_AT_decl_line   : 0
    <cfe>   DW_AT_sibling     : <0xd33>
 <2><d02>: Abbrev Number: 23 (DW_TAG_member)
    <d03>   DW_AT_name        : (indirect string, offset: 0x1d2): gp_offset
    <d07>   DW_AT_decl_file   : 21
    <d08>   DW_AT_decl_line   : 0
    <d09>   DW_AT_type        : <0x64>
    <d0d>   DW_AT_data_member_location: 0
 <2><d0e>: Abbrev Number: 23 (DW_TAG_member)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x429): fp_offset
    <d13>   DW_AT_decl_file   : 21
    <d14>   DW_AT_decl_line   : 0
    <d15>   DW_AT_type        : <0x64>
    <d19>   DW_AT_data_member_location: 4
 <2><d1a>: Abbrev Number: 23 (DW_TAG_member)
    <d1b>   DW_AT_name        : (indirect string, offset: 0x954): overflow_arg_area
    <d1f>   DW_AT_decl_file   : 21
    <d20>   DW_AT_decl_line   : 0
    <d21>   DW_AT_type        : <0x2cf>
    <d25>   DW_AT_data_member_location: 8
 <2><d26>: Abbrev Number: 23 (DW_TAG_member)
    <d27>   DW_AT_name        : (indirect string, offset: 0x1c1c): reg_save_area
    <d2b>   DW_AT_decl_file   : 21
    <d2c>   DW_AT_decl_line   : 0
    <d2d>   DW_AT_type        : <0x2cf>
    <d31>   DW_AT_data_member_location: 16
 <2><d32>: Abbrev Number: 0
 <1><d33>: Abbrev Number: 14 (DW_TAG_union_type)
    <d34>   DW_AT_byte_size   : 4
    <d35>   DW_AT_decl_file   : 22
    <d36>   DW_AT_decl_line   : 16
    <d37>   DW_AT_decl_column : 3
    <d38>   DW_AT_sibling     : <0xd55>
 <2><d3c>: Abbrev Number: 15 (DW_TAG_member)
    <d3d>   DW_AT_name        : (indirect string, offset: 0x101e): __wch
    <d41>   DW_AT_decl_file   : 22
    <d42>   DW_AT_decl_line   : 18
    <d43>   DW_AT_decl_column : 19
    <d44>   DW_AT_type        : <0x64>
 <2><d48>: Abbrev Number: 15 (DW_TAG_member)
    <d49>   DW_AT_name        : (indirect string, offset: 0x19f8): __wchb
    <d4d>   DW_AT_decl_file   : 22
    <d4e>   DW_AT_decl_line   : 19
    <d4f>   DW_AT_decl_column : 10
    <d50>   DW_AT_type        : <0x9bb>
 <2><d54>: Abbrev Number: 0
 <1><d55>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d56>   DW_AT_byte_size   : 8
    <d57>   DW_AT_decl_file   : 22
    <d58>   DW_AT_decl_line   : 13
    <d59>   DW_AT_decl_column : 9
    <d5a>   DW_AT_sibling     : <0xd79>
 <2><d5e>: Abbrev Number: 8 (DW_TAG_member)
    <d5f>   DW_AT_name        : (indirect string, offset: 0x844): __count
    <d63>   DW_AT_decl_file   : 22
    <d64>   DW_AT_decl_line   : 15
    <d65>   DW_AT_decl_column : 7
    <d66>   DW_AT_type        : <0xc8>
    <d6a>   DW_AT_data_member_location: 0
 <2><d6b>: Abbrev Number: 8 (DW_TAG_member)
    <d6c>   DW_AT_name        : (indirect string, offset: 0xc5e): __value
    <d70>   DW_AT_decl_file   : 22
    <d71>   DW_AT_decl_line   : 20
    <d72>   DW_AT_decl_column : 5
    <d73>   DW_AT_type        : <0xd33>
    <d77>   DW_AT_data_member_location: 4
 <2><d78>: Abbrev Number: 0
 <1><d79>: Abbrev Number: 2 (DW_TAG_typedef)
    <d7a>   DW_AT_name        : (indirect string, offset: 0x1651): __mbstate_t
    <d7e>   DW_AT_decl_file   : 22
    <d7f>   DW_AT_decl_line   : 21
    <d80>   DW_AT_decl_column : 3
    <d81>   DW_AT_type        : <0xd55>
 <1><d85>: Abbrev Number: 13 (DW_TAG_structure_type)
    <d86>   DW_AT_name        : (indirect string, offset: 0x1b65): _G_fpos_t
    <d8a>   DW_AT_byte_size   : 16
    <d8b>   DW_AT_decl_file   : 23
    <d8c>   DW_AT_decl_line   : 10
    <d8d>   DW_AT_decl_column : 16
    <d8e>   DW_AT_sibling     : <0xdad>
 <2><d92>: Abbrev Number: 8 (DW_TAG_member)
    <d93>   DW_AT_name        : (indirect string, offset: 0x10e0): __pos
    <d97>   DW_AT_decl_file   : 23
    <d98>   DW_AT_decl_line   : 12
    <d99>   DW_AT_decl_column : 11
    <d9a>   DW_AT_type        : <0x1e8>
    <d9e>   DW_AT_data_member_location: 0
 <2><d9f>: Abbrev Number: 8 (DW_TAG_member)
    <da0>   DW_AT_name        : (indirect string, offset: 0x2246): __state
    <da4>   DW_AT_decl_file   : 23
    <da5>   DW_AT_decl_line   : 13
    <da6>   DW_AT_decl_column : 15
    <da7>   DW_AT_type        : <0xd79>
    <dab>   DW_AT_data_member_location: 8
 <2><dac>: Abbrev Number: 0
 <1><dad>: Abbrev Number: 2 (DW_TAG_typedef)
    <dae>   DW_AT_name        : (indirect string, offset: 0x306): __fpos_t
    <db2>   DW_AT_decl_file   : 23
    <db3>   DW_AT_decl_line   : 14
    <db4>   DW_AT_decl_column : 3
    <db5>   DW_AT_type        : <0xd85>
 <1><db9>: Abbrev Number: 13 (DW_TAG_structure_type)
    <dba>   DW_AT_name        : (indirect string, offset: 0x6a3): _G_fpos64_t
    <dbe>   DW_AT_byte_size   : 16
    <dbf>   DW_AT_decl_file   : 24
    <dc0>   DW_AT_decl_line   : 10
    <dc1>   DW_AT_decl_column : 16
    <dc2>   DW_AT_sibling     : <0xde1>
 <2><dc6>: Abbrev Number: 8 (DW_TAG_member)
    <dc7>   DW_AT_name        : (indirect string, offset: 0x10e0): __pos
    <dcb>   DW_AT_decl_file   : 24
    <dcc>   DW_AT_decl_line   : 12
    <dcd>   DW_AT_decl_column : 13
    <dce>   DW_AT_type        : <0x1f4>
    <dd2>   DW_AT_data_member_location: 0
 <2><dd3>: Abbrev Number: 8 (DW_TAG_member)
    <dd4>   DW_AT_name        : (indirect string, offset: 0x2246): __state
    <dd8>   DW_AT_decl_file   : 24
    <dd9>   DW_AT_decl_line   : 13
    <dda>   DW_AT_decl_column : 15
    <ddb>   DW_AT_type        : <0xd79>
    <ddf>   DW_AT_data_member_location: 8
 <2><de0>: Abbrev Number: 0
 <1><de1>: Abbrev Number: 2 (DW_TAG_typedef)
    <de2>   DW_AT_name        : (indirect string, offset: 0x127c): __fpos64_t
    <de6>   DW_AT_decl_file   : 24
    <de7>   DW_AT_decl_line   : 14
    <de8>   DW_AT_decl_column : 3
    <de9>   DW_AT_type        : <0xdb9>
 <1><ded>: Abbrev Number: 2 (DW_TAG_typedef)
    <dee>   DW_AT_name        : (indirect string, offset: 0xa61): __FILE
    <df2>   DW_AT_decl_file   : 25
    <df3>   DW_AT_decl_line   : 5
    <df4>   DW_AT_decl_column : 25
    <df5>   DW_AT_type        : <0xdf9>
 <1><df9>: Abbrev Number: 13 (DW_TAG_structure_type)
    <dfa>   DW_AT_name        : (indirect string, offset: 0x1bfa): _IO_FILE
    <dfe>   DW_AT_byte_size   : 216
    <dff>   DW_AT_decl_file   : 26
    <e00>   DW_AT_decl_line   : 49
    <e01>   DW_AT_decl_column : 8
    <e02>   DW_AT_sibling     : <0xf80>
 <2><e06>: Abbrev Number: 8 (DW_TAG_member)
    <e07>   DW_AT_name        : (indirect string, offset: 0x1ff): _flags
    <e0b>   DW_AT_decl_file   : 26
    <e0c>   DW_AT_decl_line   : 51
    <e0d>   DW_AT_decl_column : 7
    <e0e>   DW_AT_type        : <0xc8>
    <e12>   DW_AT_data_member_location: 0
 <2><e13>: Abbrev Number: 8 (DW_TAG_member)
    <e14>   DW_AT_name        : (indirect string, offset: 0xfd1): _IO_read_ptr
    <e18>   DW_AT_decl_file   : 26
    <e19>   DW_AT_decl_line   : 54
    <e1a>   DW_AT_decl_column : 9
    <e1b>   DW_AT_type        : <0x36d>
    <e1f>   DW_AT_data_member_location: 8
 <2><e20>: Abbrev Number: 8 (DW_TAG_member)
    <e21>   DW_AT_name        : (indirect string, offset: 0x17de): _IO_read_end
    <e25>   DW_AT_decl_file   : 26
    <e26>   DW_AT_decl_line   : 55
    <e27>   DW_AT_decl_column : 9
    <e28>   DW_AT_type        : <0x36d>
    <e2c>   DW_AT_data_member_location: 16
 <2><e2d>: Abbrev Number: 8 (DW_TAG_member)
    <e2e>   DW_AT_name        : (indirect string, offset: 0xc66): _IO_read_base
    <e32>   DW_AT_decl_file   : 26
    <e33>   DW_AT_decl_line   : 56
    <e34>   DW_AT_decl_column : 9
    <e35>   DW_AT_type        : <0x36d>
    <e39>   DW_AT_data_member_location: 24
 <2><e3a>: Abbrev Number: 8 (DW_TAG_member)
    <e3b>   DW_AT_name        : (indirect string, offset: 0x862): _IO_write_base
    <e3f>   DW_AT_decl_file   : 26
    <e40>   DW_AT_decl_line   : 57
    <e41>   DW_AT_decl_column : 9
    <e42>   DW_AT_type        : <0x36d>
    <e46>   DW_AT_data_member_location: 32
 <2><e47>: Abbrev Number: 8 (DW_TAG_member)
    <e48>   DW_AT_name        : (indirect string, offset: 0x1d96): _IO_write_ptr
    <e4c>   DW_AT_decl_file   : 26
    <e4d>   DW_AT_decl_line   : 58
    <e4e>   DW_AT_decl_column : 9
    <e4f>   DW_AT_type        : <0x36d>
    <e53>   DW_AT_data_member_location: 40
 <2><e54>: Abbrev Number: 8 (DW_TAG_member)
    <e55>   DW_AT_name        : (indirect string, offset: 0x19d4): _IO_write_end
    <e59>   DW_AT_decl_file   : 26
    <e5a>   DW_AT_decl_line   : 59
    <e5b>   DW_AT_decl_column : 9
    <e5c>   DW_AT_type        : <0x36d>
    <e60>   DW_AT_data_member_location: 48
 <2><e61>: Abbrev Number: 8 (DW_TAG_member)
    <e62>   DW_AT_name        : (indirect string, offset: 0x234c): _IO_buf_base
    <e66>   DW_AT_decl_file   : 26
    <e67>   DW_AT_decl_line   : 60
    <e68>   DW_AT_decl_column : 9
    <e69>   DW_AT_type        : <0x36d>
    <e6d>   DW_AT_data_member_location: 56
 <2><e6e>: Abbrev Number: 8 (DW_TAG_member)
    <e6f>   DW_AT_name        : (indirect string, offset: 0x20c): _IO_buf_end
    <e73>   DW_AT_decl_file   : 26
    <e74>   DW_AT_decl_line   : 61
    <e75>   DW_AT_decl_column : 9
    <e76>   DW_AT_type        : <0x36d>
    <e7a>   DW_AT_data_member_location: 64
 <2><e7b>: Abbrev Number: 8 (DW_TAG_member)
    <e7c>   DW_AT_name        : (indirect string, offset: 0x11e5): _IO_save_base
    <e80>   DW_AT_decl_file   : 26
    <e81>   DW_AT_decl_line   : 64
    <e82>   DW_AT_decl_column : 9
    <e83>   DW_AT_type        : <0x36d>
    <e87>   DW_AT_data_member_location: 72
 <2><e88>: Abbrev Number: 8 (DW_TAG_member)
    <e89>   DW_AT_name        : (indirect string, offset: 0x142e): _IO_backup_base
    <e8d>   DW_AT_decl_file   : 26
    <e8e>   DW_AT_decl_line   : 65
    <e8f>   DW_AT_decl_column : 9
    <e90>   DW_AT_type        : <0x36d>
    <e94>   DW_AT_data_member_location: 80
 <2><e95>: Abbrev Number: 8 (DW_TAG_member)
    <e96>   DW_AT_name        : (indirect string, offset: 0x1177): _IO_save_end
    <e9a>   DW_AT_decl_file   : 26
    <e9b>   DW_AT_decl_line   : 66
    <e9c>   DW_AT_decl_column : 9
    <e9d>   DW_AT_type        : <0x36d>
    <ea1>   DW_AT_data_member_location: 88
 <2><ea2>: Abbrev Number: 8 (DW_TAG_member)
    <ea3>   DW_AT_name        : (indirect string, offset: 0x4f2): _markers
    <ea7>   DW_AT_decl_file   : 26
    <ea8>   DW_AT_decl_line   : 68
    <ea9>   DW_AT_decl_column : 22
    <eaa>   DW_AT_type        : <0xf99>
    <eae>   DW_AT_data_member_location: 96
 <2><eaf>: Abbrev Number: 8 (DW_TAG_member)
    <eb0>   DW_AT_name        : (indirect string, offset: 0xe1b): _chain
    <eb4>   DW_AT_decl_file   : 26
    <eb5>   DW_AT_decl_line   : 70
    <eb6>   DW_AT_decl_column : 20
    <eb7>   DW_AT_type        : <0xf9f>
    <ebb>   DW_AT_data_member_location: 104
 <2><ebc>: Abbrev Number: 8 (DW_TAG_member)
    <ebd>   DW_AT_name        : (indirect string, offset: 0xb05): _fileno
    <ec1>   DW_AT_decl_file   : 26
    <ec2>   DW_AT_decl_line   : 72
    <ec3>   DW_AT_decl_column : 7
    <ec4>   DW_AT_type        : <0xc8>
    <ec8>   DW_AT_data_member_location: 112
 <2><ec9>: Abbrev Number: 8 (DW_TAG_member)
    <eca>   DW_AT_name        : (indirect string, offset: 0x224e): _flags2
    <ece>   DW_AT_decl_file   : 26
    <ecf>   DW_AT_decl_line   : 73
    <ed0>   DW_AT_decl_column : 7
    <ed1>   DW_AT_type        : <0xc8>
    <ed5>   DW_AT_data_member_location: 116
 <2><ed6>: Abbrev Number: 8 (DW_TAG_member)
    <ed7>   DW_AT_name        : (indirect string, offset: 0x1be2): _old_offset
    <edb>   DW_AT_decl_file   : 26
    <edc>   DW_AT_decl_line   : 74
    <edd>   DW_AT_decl_column : 11
    <ede>   DW_AT_type        : <0x1e8>
    <ee2>   DW_AT_data_member_location: 120
 <2><ee3>: Abbrev Number: 8 (DW_TAG_member)
    <ee4>   DW_AT_name        : (indirect string, offset: 0x22b4): _cur_column
    <ee8>   DW_AT_decl_file   : 26
    <ee9>   DW_AT_decl_line   : 77
    <eea>   DW_AT_decl_column : 18
    <eeb>   DW_AT_type        : <0x4c>
    <eef>   DW_AT_data_member_location: 128
 <2><ef0>: Abbrev Number: 8 (DW_TAG_member)
    <ef1>   DW_AT_name        : (indirect string, offset: 0xc06): _vtable_offset
    <ef5>   DW_AT_decl_file   : 26
    <ef6>   DW_AT_decl_line   : 78
    <ef7>   DW_AT_decl_column : 15
    <ef8>   DW_AT_type        : <0x8a>
    <efc>   DW_AT_data_member_location: 130
 <2><efd>: Abbrev Number: 8 (DW_TAG_member)
    <efe>   DW_AT_name        : (indirect string, offset: 0xbb): _shortbuf
    <f02>   DW_AT_decl_file   : 26
    <f03>   DW_AT_decl_line   : 79
    <f04>   DW_AT_decl_column : 8
    <f05>   DW_AT_type        : <0xfa5>
    <f09>   DW_AT_data_member_location: 131
 <2><f0a>: Abbrev Number: 8 (DW_TAG_member)
    <f0b>   DW_AT_name        : (indirect string, offset: 0x1c8e): _lock
    <f0f>   DW_AT_decl_file   : 26
    <f10>   DW_AT_decl_line   : 81
    <f11>   DW_AT_decl_column : 15
    <f12>   DW_AT_type        : <0xfb5>
    <f16>   DW_AT_data_member_location: 136
 <2><f17>: Abbrev Number: 8 (DW_TAG_member)
    <f18>   DW_AT_name        : (indirect string, offset: 0x1be6): _offset
    <f1c>   DW_AT_decl_file   : 26
    <f1d>   DW_AT_decl_line   : 89
    <f1e>   DW_AT_decl_column : 13
    <f1f>   DW_AT_type        : <0x1f4>
    <f23>   DW_AT_data_member_location: 144
 <2><f24>: Abbrev Number: 8 (DW_TAG_member)
    <f25>   DW_AT_name        : (indirect string, offset: 0x895): _codecvt
    <f29>   DW_AT_decl_file   : 26
    <f2a>   DW_AT_decl_line   : 91
    <f2b>   DW_AT_decl_column : 23
    <f2c>   DW_AT_type        : <0xfc0>
    <f30>   DW_AT_data_member_location: 152
 <2><f31>: Abbrev Number: 8 (DW_TAG_member)
    <f32>   DW_AT_name        : (indirect string, offset: 0x19b0): _wide_data
    <f36>   DW_AT_decl_file   : 26
    <f37>   DW_AT_decl_line   : 92
    <f38>   DW_AT_decl_column : 25
    <f39>   DW_AT_type        : <0xfcb>
    <f3d>   DW_AT_data_member_location: 160
 <2><f3e>: Abbrev Number: 8 (DW_TAG_member)
    <f3f>   DW_AT_name        : (indirect string, offset: 0x39f): _freeres_list
    <f43>   DW_AT_decl_file   : 26
    <f44>   DW_AT_decl_line   : 93
    <f45>   DW_AT_decl_column : 20
    <f46>   DW_AT_type        : <0xf9f>
    <f4a>   DW_AT_data_member_location: 168
 <2><f4b>: Abbrev Number: 8 (DW_TAG_member)
    <f4c>   DW_AT_name        : (indirect string, offset: 0x5e0): _freeres_buf
    <f50>   DW_AT_decl_file   : 26
    <f51>   DW_AT_decl_line   : 94
    <f52>   DW_AT_decl_column : 9
    <f53>   DW_AT_type        : <0x2cf>
    <f57>   DW_AT_data_member_location: 176
 <2><f58>: Abbrev Number: 8 (DW_TAG_member)
    <f59>   DW_AT_name        : (indirect string, offset: 0xb50): __pad5
    <f5d>   DW_AT_decl_file   : 26
    <f5e>   DW_AT_decl_line   : 95
    <f5f>   DW_AT_decl_column : 10
    <f60>   DW_AT_type        : <0x4e7>
    <f64>   DW_AT_data_member_location: 184
 <2><f65>: Abbrev Number: 8 (DW_TAG_member)
    <f66>   DW_AT_name        : (indirect string, offset: 0xd0a): _mode
    <f6a>   DW_AT_decl_file   : 26
    <f6b>   DW_AT_decl_line   : 96
    <f6c>   DW_AT_decl_column : 7
    <f6d>   DW_AT_type        : <0xc8>
    <f71>   DW_AT_data_member_location: 192
 <2><f72>: Abbrev Number: 8 (DW_TAG_member)
    <f73>   DW_AT_name        : (indirect string, offset: 0x2343): _unused2
    <f77>   DW_AT_decl_file   : 26
    <f78>   DW_AT_decl_line   : 98
    <f79>   DW_AT_decl_column : 8
    <f7a>   DW_AT_type        : <0xfd1>
    <f7e>   DW_AT_data_member_location: 196
 <2><f7f>: Abbrev Number: 0
 <1><f80>: Abbrev Number: 2 (DW_TAG_typedef)
    <f81>   DW_AT_name        : (indirect string, offset: 0x1b53): FILE
    <f85>   DW_AT_decl_file   : 27
    <f86>   DW_AT_decl_line   : 7
    <f87>   DW_AT_decl_column : 25
    <f88>   DW_AT_type        : <0xdf9>
 <1><f8c>: Abbrev Number: 24 (DW_TAG_typedef)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x118): _IO_lock_t
    <f91>   DW_AT_decl_file   : 26
    <f92>   DW_AT_decl_line   : 43
    <f93>   DW_AT_decl_column : 14
 <1><f94>: Abbrev Number: 25 (DW_TAG_structure_type)
    <f95>   DW_AT_name        : (indirect string, offset: 0x116c): _IO_marker
    <f99>   DW_AT_declaration : 1
 <1><f99>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <f9a>   DW_AT_byte_size   : 8
    <f9b>   DW_AT_type        : <0xf94>
 <1><f9f>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <fa0>   DW_AT_byte_size   : 8
    <fa1>   DW_AT_type        : <0xdf9>
 <1><fa5>: Abbrev Number: 9 (DW_TAG_array_type)
    <fa6>   DW_AT_type        : <0x373>
    <faa>   DW_AT_sibling     : <0xfb5>
 <2><fae>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <faf>   DW_AT_type        : <0x77>
    <fb3>   DW_AT_upper_bound : 0
 <2><fb4>: Abbrev Number: 0
 <1><fb5>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <fb6>   DW_AT_byte_size   : 8
    <fb7>   DW_AT_type        : <0xf8c>
 <1><fbb>: Abbrev Number: 25 (DW_TAG_structure_type)
    <fbc>   DW_AT_name        : (indirect string, offset: 0x892): _IO_codecvt
    <fc0>   DW_AT_declaration : 1
 <1><fc0>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <fc1>   DW_AT_byte_size   : 8
    <fc2>   DW_AT_type        : <0xfbb>
 <1><fc6>: Abbrev Number: 25 (DW_TAG_structure_type)
    <fc7>   DW_AT_name        : (indirect string, offset: 0x19ad): _IO_wide_data
    <fcb>   DW_AT_declaration : 1
 <1><fcb>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <fcc>   DW_AT_byte_size   : 8
    <fcd>   DW_AT_type        : <0xfc6>
 <1><fd1>: Abbrev Number: 9 (DW_TAG_array_type)
    <fd2>   DW_AT_type        : <0x373>
    <fd6>   DW_AT_sibling     : <0xfe1>
 <2><fda>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <fdb>   DW_AT_type        : <0x77>
    <fdf>   DW_AT_upper_bound : 19
 <2><fe0>: Abbrev Number: 0
 <1><fe1>: Abbrev Number: 2 (DW_TAG_typedef)
    <fe2>   DW_AT_name        : (indirect string, offset: 0xb9b): va_list
    <fe6>   DW_AT_decl_file   : 28
    <fe7>   DW_AT_decl_line   : 52
    <fe8>   DW_AT_decl_column : 24
    <fe9>   DW_AT_type        : <0xcd1>
 <1><fed>: Abbrev Number: 2 (DW_TAG_typedef)
    <fee>   DW_AT_name        : (indirect string, offset: 0x1b68): fpos_t
    <ff2>   DW_AT_decl_file   : 28
    <ff3>   DW_AT_decl_line   : 86
    <ff4>   DW_AT_decl_column : 20
    <ff5>   DW_AT_type        : <0xde1>
 <1><ff9>: Abbrev Number: 2 (DW_TAG_typedef)
    <ffa>   DW_AT_name        : (indirect string, offset: 0x6a6): fpos64_t
    <ffe>   DW_AT_decl_file   : 28
    <fff>   DW_AT_decl_line   : 89
    <1000>   DW_AT_decl_column : 20
    <1001>   DW_AT_type        : <0xde1>
 <1><1005>: Abbrev Number: 26 (DW_TAG_variable)
    <1006>   DW_AT_name        : (indirect string, offset: 0xcdc): stdin
    <100a>   DW_AT_decl_file   : 28
    <100b>   DW_AT_decl_line   : 137
    <100c>   DW_AT_decl_column : 14
    <100d>   DW_AT_type        : <0x1011>
    <1011>   DW_AT_external    : 1
    <1011>   DW_AT_declaration : 1
 <1><1011>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <1012>   DW_AT_byte_size   : 8
    <1013>   DW_AT_type        : <0xf80>
 <1><1017>: Abbrev Number: 26 (DW_TAG_variable)
    <1018>   DW_AT_name        : (indirect string, offset: 0x804): stdout
    <101c>   DW_AT_decl_file   : 28
    <101d>   DW_AT_decl_line   : 138
    <101e>   DW_AT_decl_column : 14
    <101f>   DW_AT_type        : <0x1011>
    <1023>   DW_AT_external    : 1
    <1023>   DW_AT_declaration : 1
 <1><1023>: Abbrev Number: 26 (DW_TAG_variable)
    <1024>   DW_AT_name        : (indirect string, offset: 0x1f7): stderr
    <1028>   DW_AT_decl_file   : 28
    <1029>   DW_AT_decl_line   : 139
    <102a>   DW_AT_decl_column : 14
    <102b>   DW_AT_type        : <0x1011>
    <102f>   DW_AT_external    : 1
    <102f>   DW_AT_declaration : 1
 <1><102f>: Abbrev Number: 24 (DW_TAG_typedef)
    <1030>   DW_AT_name        : (indirect string, offset: 0x1b51): BZFILE
    <1034>   DW_AT_decl_file   : 19
    <1035>   DW_AT_decl_line   : 140
    <1036>   DW_AT_decl_column : 14
 <1><1037>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1038>   DW_AT_name        : (indirect string, offset: 0x206): flock
    <103c>   DW_AT_byte_size   : 32
    <103d>   DW_AT_decl_file   : 29
    <103e>   DW_AT_decl_line   : 35
    <103f>   DW_AT_decl_column : 8
    <1040>   DW_AT_sibling     : <0x1086>
 <2><1044>: Abbrev Number: 8 (DW_TAG_member)
    <1045>   DW_AT_name        : (indirect string, offset: 0x51f): l_type
    <1049>   DW_AT_decl_file   : 29
    <104a>   DW_AT_decl_line   : 37
    <104b>   DW_AT_decl_column : 15
    <104c>   DW_AT_type        : <0xa9>
    <1050>   DW_AT_data_member_location: 0
 <2><1051>: Abbrev Number: 8 (DW_TAG_member)
    <1052>   DW_AT_name        : (indirect string, offset: 0x1d6e): l_whence
    <1056>   DW_AT_decl_file   : 29
    <1057>   DW_AT_decl_line   : 38
    <1058>   DW_AT_decl_column : 15
    <1059>   DW_AT_type        : <0xa9>
    <105d>   DW_AT_data_member_location: 2
 <2><105e>: Abbrev Number: 8 (DW_TAG_member)
    <105f>   DW_AT_name        : (indirect string, offset: 0x34a): l_start
    <1063>   DW_AT_decl_file   : 29
    <1064>   DW_AT_decl_line   : 43
    <1065>   DW_AT_decl_column : 15
    <1066>   DW_AT_type        : <0x1f4>
    <106a>   DW_AT_data_member_location: 8
 <2><106b>: Abbrev Number: 8 (DW_TAG_member)
    <106c>   DW_AT_name        : (indirect string, offset: 0x18da): l_len
    <1070>   DW_AT_decl_file   : 29
    <1071>   DW_AT_decl_line   : 44
    <1072>   DW_AT_decl_column : 15
    <1073>   DW_AT_type        : <0x1f4>
    <1077>   DW_AT_data_member_location: 16
 <2><1078>: Abbrev Number: 8 (DW_TAG_member)
    <1079>   DW_AT_name        : (indirect string, offset: 0x1309): l_pid
    <107d>   DW_AT_decl_file   : 29
    <107e>   DW_AT_decl_line   : 46
    <107f>   DW_AT_decl_column : 13
    <1080>   DW_AT_type        : <0x200>
    <1084>   DW_AT_data_member_location: 24
 <2><1085>: Abbrev Number: 0
 <1><1086>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1087>   DW_AT_name        : (indirect string, offset: 0x8cb): flock64
    <108b>   DW_AT_byte_size   : 32
    <108c>   DW_AT_decl_file   : 29
    <108d>   DW_AT_decl_line   : 50
    <108e>   DW_AT_decl_column : 8
    <108f>   DW_AT_sibling     : <0x10d5>
 <2><1093>: Abbrev Number: 8 (DW_TAG_member)
    <1094>   DW_AT_name        : (indirect string, offset: 0x51f): l_type
    <1098>   DW_AT_decl_file   : 29
    <1099>   DW_AT_decl_line   : 52
    <109a>   DW_AT_decl_column : 15
    <109b>   DW_AT_type        : <0xa9>
    <109f>   DW_AT_data_member_location: 0
 <2><10a0>: Abbrev Number: 8 (DW_TAG_member)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x1d6e): l_whence
    <10a5>   DW_AT_decl_file   : 29
    <10a6>   DW_AT_decl_line   : 53
    <10a7>   DW_AT_decl_column : 15
    <10a8>   DW_AT_type        : <0xa9>
    <10ac>   DW_AT_data_member_location: 2
 <2><10ad>: Abbrev Number: 8 (DW_TAG_member)
    <10ae>   DW_AT_name        : (indirect string, offset: 0x34a): l_start
    <10b2>   DW_AT_decl_file   : 29
    <10b3>   DW_AT_decl_line   : 54
    <10b4>   DW_AT_decl_column : 15
    <10b5>   DW_AT_type        : <0x1f4>
    <10b9>   DW_AT_data_member_location: 8
 <2><10ba>: Abbrev Number: 8 (DW_TAG_member)
    <10bb>   DW_AT_name        : (indirect string, offset: 0x18da): l_len
    <10bf>   DW_AT_decl_file   : 29
    <10c0>   DW_AT_decl_line   : 55
    <10c1>   DW_AT_decl_column : 15
    <10c2>   DW_AT_type        : <0x1f4>
    <10c6>   DW_AT_data_member_location: 16
 <2><10c7>: Abbrev Number: 8 (DW_TAG_member)
    <10c8>   DW_AT_name        : (indirect string, offset: 0x1309): l_pid
    <10cc>   DW_AT_decl_file   : 29
    <10cd>   DW_AT_decl_line   : 56
    <10ce>   DW_AT_decl_column : 13
    <10cf>   DW_AT_type        : <0x200>
    <10d3>   DW_AT_data_member_location: 24
 <2><10d4>: Abbrev Number: 0
 <1><10d5>: Abbrev Number: 13 (DW_TAG_structure_type)
    <10d6>   DW_AT_name        : (indirect string, offset: 0xb0d): stat
    <10da>   DW_AT_byte_size   : 144
    <10db>   DW_AT_decl_file   : 30
    <10dc>   DW_AT_decl_line   : 26
    <10dd>   DW_AT_decl_column : 8
    <10de>   DW_AT_sibling     : <0x11a6>
 <2><10e2>: Abbrev Number: 8 (DW_TAG_member)
    <10e3>   DW_AT_name        : (indirect string, offset: 0x2012): st_dev
    <10e7>   DW_AT_decl_file   : 30
    <10e8>   DW_AT_decl_line   : 31
    <10e9>   DW_AT_decl_column : 13
    <10ea>   DW_AT_type        : <0x194>
    <10ee>   DW_AT_data_member_location: 0
 <2><10ef>: Abbrev Number: 8 (DW_TAG_member)
    <10f0>   DW_AT_name        : (indirect string, offset: 0x10ef): st_ino
    <10f4>   DW_AT_decl_file   : 30
    <10f5>   DW_AT_decl_line   : 36
    <10f6>   DW_AT_decl_column : 13
    <10f7>   DW_AT_type        : <0x1b8>
    <10fb>   DW_AT_data_member_location: 8
 <2><10fc>: Abbrev Number: 8 (DW_TAG_member)
    <10fd>   DW_AT_name        : (indirect string, offset: 0xd87): st_nlink
    <1101>   DW_AT_decl_file   : 30
    <1102>   DW_AT_decl_line   : 44
    <1103>   DW_AT_decl_column : 15
    <1104>   DW_AT_type        : <0x1dc>
    <1108>   DW_AT_data_member_location: 16
 <2><1109>: Abbrev Number: 8 (DW_TAG_member)
    <110a>   DW_AT_name        : (indirect string, offset: 0xd08): st_mode
    <110e>   DW_AT_decl_file   : 30
    <110f>   DW_AT_decl_line   : 45
    <1110>   DW_AT_decl_column : 14
    <1111>   DW_AT_type        : <0x1d0>
    <1115>   DW_AT_data_member_location: 24
 <2><1116>: Abbrev Number: 8 (DW_TAG_member)
    <1117>   DW_AT_name        : (indirect string, offset: 0x1f98): st_uid
    <111b>   DW_AT_decl_file   : 30
    <111c>   DW_AT_decl_line   : 47
    <111d>   DW_AT_decl_column : 13
    <111e>   DW_AT_type        : <0x1a0>
    <1122>   DW_AT_data_member_location: 28
 <2><1123>: Abbrev Number: 8 (DW_TAG_member)
    <1124>   DW_AT_name        : (indirect string, offset: 0xc9c): st_gid
    <1128>   DW_AT_decl_file   : 30
    <1129>   DW_AT_decl_line   : 48
    <112a>   DW_AT_decl_column : 13
    <112b>   DW_AT_type        : <0x1ac>
    <112f>   DW_AT_data_member_location: 32
 <2><1130>: Abbrev Number: 8 (DW_TAG_member)
    <1131>   DW_AT_name        : (indirect string, offset: 0x14bf): __pad0
    <1135>   DW_AT_decl_file   : 30
    <1136>   DW_AT_decl_line   : 50
    <1137>   DW_AT_decl_column : 9
    <1138>   DW_AT_type        : <0xc8>
    <113c>   DW_AT_data_member_location: 36
 <2><113d>: Abbrev Number: 8 (DW_TAG_member)
    <113e>   DW_AT_name        : (indirect string, offset: 0x222f): st_rdev
    <1142>   DW_AT_decl_file   : 30
    <1143>   DW_AT_decl_line   : 52
    <1144>   DW_AT_decl_column : 13
    <1145>   DW_AT_type        : <0x194>
    <1149>   DW_AT_data_member_location: 40
 <2><114a>: Abbrev Number: 8 (DW_TAG_member)
    <114b>   DW_AT_name        : (indirect string, offset: 0x1ef8): st_size
    <114f>   DW_AT_decl_file   : 30
    <1150>   DW_AT_decl_line   : 57
    <1151>   DW_AT_decl_column : 13
    <1152>   DW_AT_type        : <0x1e8>
    <1156>   DW_AT_data_member_location: 48
 <2><1157>: Abbrev Number: 8 (DW_TAG_member)
    <1158>   DW_AT_name        : (indirect string, offset: 0x3cf): st_blksize
    <115c>   DW_AT_decl_file   : 30
    <115d>   DW_AT_decl_line   : 61
    <115e>   DW_AT_decl_column : 17
    <115f>   DW_AT_type        : <0x2d1>
    <1163>   DW_AT_data_member_location: 56
 <2><1164>: Abbrev Number: 8 (DW_TAG_member)
    <1165>   DW_AT_name        : (indirect string, offset: 0x98d): st_blocks
    <1169>   DW_AT_decl_file   : 30
    <116a>   DW_AT_decl_line   : 63
    <116b>   DW_AT_decl_column : 16
    <116c>   DW_AT_type        : <0x2dd>
    <1170>   DW_AT_data_member_location: 64
 <2><1171>: Abbrev Number: 8 (DW_TAG_member)
    <1172>   DW_AT_name        : (indirect string, offset: 0x1b0b): st_atim
    <1176>   DW_AT_decl_file   : 30
    <1177>   DW_AT_decl_line   : 74
    <1178>   DW_AT_decl_column : 21
    <1179>   DW_AT_type        : <0x5ea>
    <117d>   DW_AT_data_member_location: 72
 <2><117e>: Abbrev Number: 8 (DW_TAG_member)
    <117f>   DW_AT_name        : (indirect string, offset: 0x1832): st_mtim
    <1183>   DW_AT_decl_file   : 30
    <1184>   DW_AT_decl_line   : 75
    <1185>   DW_AT_decl_column : 21
    <1186>   DW_AT_type        : <0x5ea>
    <118a>   DW_AT_data_member_location: 88
 <2><118b>: Abbrev Number: 8 (DW_TAG_member)
    <118c>   DW_AT_name        : (indirect string, offset: 0x1fe1): st_ctim
    <1190>   DW_AT_decl_file   : 30
    <1191>   DW_AT_decl_line   : 76
    <1192>   DW_AT_decl_column : 21
    <1193>   DW_AT_type        : <0x5ea>
    <1197>   DW_AT_data_member_location: 104
 <2><1198>: Abbrev Number: 8 (DW_TAG_member)
    <1199>   DW_AT_name        : (indirect string, offset: 0x20da): __glibc_reserved
    <119d>   DW_AT_decl_file   : 30
    <119e>   DW_AT_decl_line   : 89
    <119f>   DW_AT_decl_column : 23
    <11a0>   DW_AT_type        : <0x11a6>
    <11a4>   DW_AT_data_member_location: 120
 <2><11a5>: Abbrev Number: 0
 <1><11a6>: Abbrev Number: 9 (DW_TAG_array_type)
    <11a7>   DW_AT_type        : <0x33d>
    <11ab>   DW_AT_sibling     : <0x11b6>
 <2><11af>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <11b0>   DW_AT_type        : <0x77>
    <11b4>   DW_AT_upper_bound : 2
 <2><11b5>: Abbrev Number: 0
 <1><11b6>: Abbrev Number: 13 (DW_TAG_structure_type)
    <11b7>   DW_AT_name        : (indirect string, offset: 0xa14): stat64
    <11bb>   DW_AT_byte_size   : 144
    <11bc>   DW_AT_decl_file   : 30
    <11bd>   DW_AT_decl_line   : 103
    <11be>   DW_AT_decl_column : 8
    <11bf>   DW_AT_sibling     : <0x1287>
 <2><11c3>: Abbrev Number: 8 (DW_TAG_member)
    <11c4>   DW_AT_name        : (indirect string, offset: 0x2012): st_dev
    <11c8>   DW_AT_decl_file   : 30
    <11c9>   DW_AT_decl_line   : 108
    <11ca>   DW_AT_decl_column : 13
    <11cb>   DW_AT_type        : <0x194>
    <11cf>   DW_AT_data_member_location: 0
 <2><11d0>: Abbrev Number: 8 (DW_TAG_member)
    <11d1>   DW_AT_name        : (indirect string, offset: 0x10ef): st_ino
    <11d5>   DW_AT_decl_file   : 30
    <11d6>   DW_AT_decl_line   : 110
    <11d7>   DW_AT_decl_column : 15
    <11d8>   DW_AT_type        : <0x1c4>
    <11dc>   DW_AT_data_member_location: 8
 <2><11dd>: Abbrev Number: 8 (DW_TAG_member)
    <11de>   DW_AT_name        : (indirect string, offset: 0xd87): st_nlink
    <11e2>   DW_AT_decl_file   : 30
    <11e3>   DW_AT_decl_line   : 111
    <11e4>   DW_AT_decl_column : 15
    <11e5>   DW_AT_type        : <0x1dc>
    <11e9>   DW_AT_data_member_location: 16
