bsdiff:	file format elf64-x86-64

.debug_info contents:
0x00000000: Compile Unit: length = 0x00001658, format = DWARF32, version = 0x0005, unit_type = DW_UT_compile, abbr_offset = 0x0000, addr_size = 0x08 (next unit at 0x0000165c)

0x0000000c: DW_TAG_compile_unit
              DW_AT_producer	("GNU C17 14.2.1 20250322 -mtune=generic -march=x86-64 -g -O3 -O2 -fstack-clash-protection -fzero-call-used-regs=used-gpr -fstack-protector-strong -fno-strict-overflow -frandom-seed=a3a2x8wkly --param=ssp-buffer-size=4")
              DW_AT_language	(DW_LANG_C11)
              DW_AT_name	("bsdiff.c")
              DW_AT_comp_dir	("/build/bsdiff-4.3")
              DW_AT_ranges	(0x000000c5
                 [0x0000000000402180, 0x00000000004028aa)
                 [0x0000000000401180, 0x00000000004013c8)
                 [0x0000000000401400, 0x0000000000402052))
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_stmt_list	(0x00000000)

0x0000002a:   DW_TAG_typedef
                DW_AT_name	("__u_char")
                DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types.h")
                DW_AT_decl_line	(31)
                DW_AT_decl_column	(23)
                DW_AT_type	(0x00000036 "unsigned char")

0x00000036:   DW_TAG_base_type
                DW_AT_byte_size	(0x01)
                DW_AT_encoding	(DW_ATE_unsigned_char)
                DW_AT_name	("unsigned char")

0x0000003d:   DW_TAG_base_type
                DW_AT_byte_size	(0x02)
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_name	("short unsigned int")

0x00000044:   DW_TAG_base_type
                DW_AT_byte_size	(0x04)
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_name	("unsigned int")

0x0000004b:   DW_TAG_base_type
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_name	("long unsigned int")

0x00000052:   DW_TAG_base_type
                DW_AT_byte_size	(0x01)
                DW_AT_encoding	(DW_ATE_signed_char)
                DW_AT_name	("signed char")

0x00000059:   DW_TAG_base_type
                DW_AT_byte_size	(0x02)
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_name	("short int")

0x00000060:   DW_TAG_typedef
                DW_AT_name	("__int32_t")
                DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types.h")
                DW_AT_decl_line	(41)
                DW_AT_decl_column	(20)
                DW_AT_type	(0x0000006c "int")

0x0000006c:   DW_TAG_base_type
                DW_AT_byte_size	(0x04)
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_name	("int")

0x00000073:   DW_TAG_base_type
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_name	("long int")

0x0000007a:   DW_TAG_typedef
                DW_AT_name	("__off_t")
                DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types.h")
                DW_AT_decl_line	(152)
                DW_AT_decl_column	(25)
                DW_AT_type	(0x00000073 "long int")

0x00000086:   DW_TAG_typedef
                DW_AT_name	("__off64_t")
                DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types.h")
                DW_AT_decl_line	(153)
                DW_AT_decl_column	(27)
                DW_AT_type	(0x00000073 "long int")

0x00000092:   DW_TAG_pointer_type
                DW_AT_byte_size	(0x08)

0x00000094:   DW_TAG_pointer_type
                DW_AT_byte_size	(8)
                DW_AT_type	(0x00000099 "char")

0x00000099:   DW_TAG_base_type
                DW_AT_byte_size	(0x01)
                DW_AT_encoding	(DW_ATE_signed_char)
                DW_AT_name	("char")

0x000000a0:   DW_TAG_const_type
                DW_AT_type	(0x00000099 "char")

0x000000a5:   DW_TAG_typedef
                DW_AT_name	("u_char")
                DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/sys/types.h")
                DW_AT_decl_line	(33)
                DW_AT_decl_column	(18)
                DW_AT_type	(0x0000002a "__u_char")

0x000000b1:   DW_TAG_typedef
                DW_AT_name	("off_t")
                DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/sys/types.h")
                DW_AT_decl_line	(85)
                DW_AT_decl_column	(17)
                DW_AT_type	(0x0000007a "__off_t")

0x000000bd:   DW_TAG_typedef
                DW_AT_name	("size_t")
                DW_AT_decl_file	("/nix/store/6i862vz60awrlsila8vw18rg4d4l66iy-gcc-14.2.1.20250322/lib/gcc/x86_64-unknown-linux-gnu/14.2.1/include/stddef.h")
                DW_AT_decl_line	(214)
                DW_AT_decl_column	(23)
                DW_AT_type	(0x0000004b "long unsigned int")

0x000000c9:   DW_TAG_typedef
                DW_AT_name	("int32_t")
                DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/stdint-intn.h")
                DW_AT_decl_line	(26)
                DW_AT_decl_column	(19)
                DW_AT_type	(0x00000060 "__int32_t")

0x000000d5:   DW_TAG_base_type
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_unsigned)
                DW_AT_name	("long long unsigned int")

0x000000dc:   DW_TAG_base_type
                DW_AT_byte_size	(0x08)
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_name	("long long int")

0x000000e3:   DW_TAG_structure_type
                DW_AT_name	("_IO_FILE")
                DW_AT_byte_size	(0xd8)
                DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                DW_AT_decl_line	(49)
                DW_AT_decl_column	(8)
                DW_AT_sibling	(0x0000024d)

0x000000f0:     DW_TAG_member
                  DW_AT_name	("_flags")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(51)
                  DW_AT_decl_column	(7)
                  DW_AT_type	(0x0000006c "int")
                  DW_AT_data_member_location	(0x00)

0x000000fc:     DW_TAG_member
                  DW_AT_name	("_IO_read_ptr")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(54)
                  DW_AT_decl_column	(9)
                  DW_AT_type	(0x00000094 "char *")
                  DW_AT_data_member_location	(0x08)

0x00000108:     DW_TAG_member
                  DW_AT_name	("_IO_read_end")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(55)
                  DW_AT_decl_column	(9)
                  DW_AT_type	(0x00000094 "char *")
                  DW_AT_data_member_location	(0x10)

0x00000114:     DW_TAG_member
                  DW_AT_name	("_IO_read_base")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(56)
                  DW_AT_decl_column	(9)
                  DW_AT_type	(0x00000094 "char *")
                  DW_AT_data_member_location	(0x18)

0x00000120:     DW_TAG_member
                  DW_AT_name	("_IO_write_base")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(57)
                  DW_AT_decl_column	(9)
                  DW_AT_type	(0x00000094 "char *")
                  DW_AT_data_member_location	(0x20)

0x0000012c:     DW_TAG_member
                  DW_AT_name	("_IO_write_ptr")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(58)
                  DW_AT_decl_column	(9)
                  DW_AT_type	(0x00000094 "char *")
                  DW_AT_data_member_location	(0x28)

0x00000138:     DW_TAG_member
                  DW_AT_name	("_IO_write_end")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(59)
                  DW_AT_decl_column	(9)
                  DW_AT_type	(0x00000094 "char *")
                  DW_AT_data_member_location	(0x30)

0x00000144:     DW_TAG_member
                  DW_AT_name	("_IO_buf_base")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(60)
                  DW_AT_decl_column	(9)
                  DW_AT_type	(0x00000094 "char *")
                  DW_AT_data_member_location	(0x38)

0x00000150:     DW_TAG_member
                  DW_AT_name	("_IO_buf_end")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(61)
                  DW_AT_decl_column	(9)
                  DW_AT_type	(0x00000094 "char *")
                  DW_AT_data_member_location	(0x40)

0x0000015c:     DW_TAG_member
                  DW_AT_name	("_IO_save_base")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(64)
                  DW_AT_decl_column	(9)
                  DW_AT_type	(0x00000094 "char *")
                  DW_AT_data_member_location	(0x48)

0x00000168:     DW_TAG_member
                  DW_AT_name	("_IO_backup_base")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(65)
                  DW_AT_decl_column	(9)
                  DW_AT_type	(0x00000094 "char *")
                  DW_AT_data_member_location	(0x50)

0x00000174:     DW_TAG_member
                  DW_AT_name	("_IO_save_end")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(66)
                  DW_AT_decl_column	(9)
                  DW_AT_type	(0x00000094 "char *")
                  DW_AT_data_member_location	(0x58)

0x00000180:     DW_TAG_member
                  DW_AT_name	("_markers")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(68)
                  DW_AT_decl_column	(22)
                  DW_AT_type	(0x00000265 "_IO_marker *")
                  DW_AT_data_member_location	(0x60)

0x0000018c:     DW_TAG_member
                  DW_AT_name	("_chain")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(70)
                  DW_AT_decl_column	(20)
                  DW_AT_type	(0x0000026a "_IO_FILE *")
                  DW_AT_data_member_location	(0x68)

0x00000198:     DW_TAG_member
                  DW_AT_name	("_fileno")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(72)
                  DW_AT_decl_column	(7)
                  DW_AT_type	(0x0000006c "int")
                  DW_AT_data_member_location	(0x70)

0x000001a4:     DW_TAG_member
                  DW_AT_name	("_flags2")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(73)
                  DW_AT_decl_column	(7)
                  DW_AT_type	(0x0000006c "int")
                  DW_AT_data_member_location	(0x74)

0x000001b0:     DW_TAG_member
                  DW_AT_name	("_old_offset")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(74)
                  DW_AT_decl_column	(11)
                  DW_AT_type	(0x0000007a "__off_t")
                  DW_AT_data_member_location	(0x78)

0x000001bc:     DW_TAG_member
                  DW_AT_name	("_cur_column")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(77)
                  DW_AT_decl_column	(18)
                  DW_AT_type	(0x0000003d "short unsigned int")
                  DW_AT_data_member_location	(0x80)

0x000001c8:     DW_TAG_member
                  DW_AT_name	("_vtable_offset")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(78)
                  DW_AT_decl_column	(15)
                  DW_AT_type	(0x00000052 "signed char")
                  DW_AT_data_member_location	(0x82)

0x000001d4:     DW_TAG_member
                  DW_AT_name	("_shortbuf")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(79)
                  DW_AT_decl_column	(8)
                  DW_AT_type	(0x0000026f "char[1]")
                  DW_AT_data_member_location	(0x83)

0x000001e0:     DW_TAG_member
                  DW_AT_name	("_lock")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(81)
                  DW_AT_decl_column	(15)
                  DW_AT_type	(0x0000027f "_IO_lock_t *")
                  DW_AT_data_member_location	(0x88)

0x000001ec:     DW_TAG_member
                  DW_AT_name	("_offset")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(89)
                  DW_AT_decl_column	(13)
                  DW_AT_type	(0x00000086 "__off64_t")
                  DW_AT_data_member_location	(0x90)

0x000001f8:     DW_TAG_member
                  DW_AT_name	("_codecvt")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(91)
                  DW_AT_decl_column	(23)
                  DW_AT_type	(0x00000289 "_IO_codecvt *")
                  DW_AT_data_member_location	(0x98)

0x00000204:     DW_TAG_member
                  DW_AT_name	("_wide_data")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(92)
                  DW_AT_decl_column	(25)
                  DW_AT_type	(0x00000293 "_IO_wide_data *")
                  DW_AT_data_member_location	(0xa0)

0x00000210:     DW_TAG_member
                  DW_AT_name	("_freeres_list")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(93)
                  DW_AT_decl_column	(20)
                  DW_AT_type	(0x0000026a "_IO_FILE *")
                  DW_AT_data_member_location	(0xa8)

0x0000021c:     DW_TAG_member
                  DW_AT_name	("_freeres_buf")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(94)
                  DW_AT_decl_column	(9)
                  DW_AT_type	(0x00000092 "void *")
                  DW_AT_data_member_location	(0xb0)

0x00000228:     DW_TAG_member
                  DW_AT_name	("_prevchain")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(95)
                  DW_AT_decl_column	(21)
                  DW_AT_type	(0x00000298 "_IO_FILE **")
                  DW_AT_data_member_location	(0xb8)

0x00000234:     DW_TAG_member
                  DW_AT_name	("_mode")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(96)
                  DW_AT_decl_column	(7)
                  DW_AT_type	(0x0000006c "int")
                  DW_AT_data_member_location	(0xc0)

0x00000240:     DW_TAG_member
                  DW_AT_name	("_unused2")
                  DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                  DW_AT_decl_line	(98)
                  DW_AT_decl_column	(8)
                  DW_AT_type	(0x0000029d "char[20]")
                  DW_AT_data_member_location	(0xc4)

0x0000024c:     NULL

0x0000024d:   DW_TAG_typedef
                DW_AT_name	("FILE")
                DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/FILE.h")
                DW_AT_decl_line	(7)
                DW_AT_decl_column	(25)
                DW_AT_type	(0x000000e3 "_IO_FILE")

0x00000259:   DW_TAG_typedef
                DW_AT_name	("_IO_lock_t")
                DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/bits/types/struct_FILE.h")
                DW_AT_decl_line	(43)
                DW_AT_decl_column	(14)

0x00000260:   DW_TAG_structure_type
                DW_AT_name	("_IO_marker")
                DW_AT_declaration	(true)

0x00000265:   DW_TAG_pointer_type
                DW_AT_byte_size	(8)
                DW_AT_type	(0x00000260 "_IO_marker")

0x0000026a:   DW_TAG_pointer_type
                DW_AT_byte_size	(8)
                DW_AT_type	(0x000000e3 "_IO_FILE")

0x0000026f:   DW_TAG_array_type
                DW_AT_type	(0x00000099 "char")
                DW_AT_sibling	(0x0000027f)

0x00000278:     DW_TAG_subrange_type
                  DW_AT_type	(0x0000004b "long unsigned int")
                  DW_AT_upper_bound	(0x00)

0x0000027e:     NULL

0x0000027f:   DW_TAG_pointer_type
                DW_AT_byte_size	(8)
                DW_AT_type	(0x00000259 "_IO_lock_t")

0x00000284:   DW_TAG_structure_type
                DW_AT_name	("_IO_codecvt")
                DW_AT_declaration	(true)

0x00000289:   DW_TAG_pointer_type
                DW_AT_byte_size	(8)
                DW_AT_type	(0x00000284 "_IO_codecvt")

0x0000028e:   DW_TAG_structure_type
                DW_AT_name	("_IO_wide_data")
                DW_AT_declaration	(true)

0x00000293:   DW_TAG_pointer_type
                DW_AT_byte_size	(8)
                DW_AT_type	(0x0000028e "_IO_wide_data")

0x00000298:   DW_TAG_pointer_type
                DW_AT_byte_size	(8)
                DW_AT_type	(0x0000026a "_IO_FILE *")

0x0000029d:   DW_TAG_array_type
                DW_AT_type	(0x00000099 "char")
                DW_AT_sibling	(0x000002ad)

0x000002a6:     DW_TAG_subrange_type
                  DW_AT_type	(0x0000004b "long unsigned int")
                  DW_AT_upper_bound	(0x13)

0x000002ac:     NULL

0x000002ad:   DW_TAG_pointer_type
                DW_AT_byte_size	(8)
                DW_AT_type	(0x000000a0 "const char")

0x000002b2:   DW_TAG_restrict_type
                DW_AT_type	(0x000002ad "const char *")

0x000002b7:   DW_TAG_pointer_type
                DW_AT_byte_size	(8)
                DW_AT_type	(0x0000024d "FILE")

0x000002bc:   DW_TAG_typedef
                DW_AT_name	("BZFILE")
                DW_AT_decl_file	("/nix/store/wjqj8ncgdxqpn78qp23blp5ijprpavp9-bzip2-1.0.8-dev/include/bzlib.h")
                DW_AT_decl_line	(139)
                DW_AT_decl_column	(14)

0x000002c3:   DW_TAG_pointer_type
                DW_AT_byte_size	(8)
                DW_AT_type	(0x000000c9 "int32_t")

0x000002c8:   DW_TAG_pointer_type
                DW_AT_byte_size	(8)
                DW_AT_type	(0x000002cd "const void")

0x000002cd:   DW_TAG_const_type

0x000002ce:   DW_TAG_pointer_type
                DW_AT_byte_size	(8)
                DW_AT_type	(0x00000094 "char *")

0x000002d3:   DW_TAG_subprogram
                DW_AT_external	(true)
                DW_AT_name	("memcmp")
                DW_AT_decl_file	("/nix/store/41pf3md9zgpda9kwh6rzn5kaddf7i0lp-glibc-2.40-66-dev/include/string.h")
                DW_AT_decl_line	(64)
                DW_AT_decl_column	(12)
                DW_AT_prototyped	(true)
                DW_AT_type	(0x0000006c "int")
                DW_AT_declaration	(true)
                DW_AT_sibling	(0x000002f3)

0x000002e3:     DW_TAG_formal_parameter
                  DW_AT_type	(0x000002c8 "const void *")

0x000002e8:     DW_TAG_formal_parameter
                  DW_AT_type	(0x000002c8 "const void *")

